MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv.inc
CYDEV_CACHE_HITMISS EQU 0x40004898
    ENDIF
    IF :LNOT::DEF:CYDEV_I2C_BASE
CYDEV_I2C_BASE EQU 0x40004900
    ENDIF
    IF :LNOT::DEF:CYDEV_I2C_SIZE
CYDEV_I2C_SIZE EQU 0x000000dc
    ENDIF
    IF :LNOT::DEF:CYDEV_I2C_XCFG
CYDEV_I2C_XCFG EQU 0x400049c8
    ENDIF
    IF :LNOT::DEF:CYDEV_I2C_ADR
CYDEV_I2C_ADR EQU 0x400049ca
    ENDIF
    IF :LNOT::DEF:CYDEV_I2C_CFG
CYDEV_I2C_CFG EQU 0x400049d6
    ENDIF
    IF :LNOT::DEF:CYDEV_I2C_CSR
CYDEV_I2C_CSR EQU 0x400049d7
    ENDIF
    IF :LNOT::DEF:CYDEV_I2C_D
CYDEV_I2C_D EQU 0x400049d8
    ENDIF
    IF :LNOT::DEF:CYDEV_I2C_MCSR
CYDEV_I2C_MCSR EQU 0x400049d9
    ENDIF
    IF :LNOT::DEF:CYDEV_I2C_CLK_DIV
CYDEV_I2C_CLK_DIV EQU 0x400049db
    ENDIF
    IF :LNOT::DEF:CYDEV_DEC_BASE
CYDEV_DEC_BASE EQU 0x40004e00
    ENDIF
    IF :LNOT::DEF:CYDEV_DEC_SIZE
CYDEV_DEC_SIZE EQU 0x00000015
    ENDIF
    IF :LNOT::DEF:CYDEV_DEC_CR
CYDEV_DEC_CR EQU 0x40004e00
    ENDIF
    IF :LNOT::DEF:CYDEV_DEC_SR
CYDEV_DEC_SR EQU 0x40004e01
    ENDIF
    IF :LNOT::DEF:CYDEV_DEC_SHIFT1
CYDEV_DEC_SHIFT1 EQU 0x40004e02
    ENDIF
    IF :LNOT::DEF:CYDEV_DEC_SHIFT2
CYDEV_DEC_SHIFT2 EQU 0x40004e03
    ENDIF
    IF :LNOT::DEF:CYDEV_DEC_DR2
CYDEV_DEC_DR2 EQU 0x40004e04
    ENDIF
    IF :LNOT::DEF:CYDEV_DEC_DR2H
CYDEV_DEC_DR2H EQU 0x40004e05
    ENDIF
    IF :LNOT::DEF:CYDEV_DEC_DR1
CYDEV_DEC_DR1 EQU 0x40004e06
    ENDIF
    IF :LNOT::DEF:CYDEV_DEC_OCOR
CYDEV_DEC_OCOR EQU 0x40004e08
    ENDIF
    IF :LNOT::DEF:CYDEV_DEC_OCORM
CYDEV_DEC_OCORM EQU 0x40004e09
    ENDIF
    IF :LNOT::DEF:CYDEV_DEC_OCORH
CYDEV_DEC_OCORH EQU 0x40004e0a
    ENDIF
    IF :LNOT::DEF:CYDEV_DEC_GCOR
CYDEV_DEC_GCOR EQU 0x40004e0c
    ENDIF
    IF :LNOT::DEF:CYDEV_DEC_GCORH
CYDEV_DEC_GCORH EQU 0x40004e0d
    ENDIF
    IF :LNOT::DEF:CYDEV_DEC_GVAL
CYDEV_DEC_GVAL EQU 0x40004e0e
    ENDIF
    IF :LNOT::DEF:CYDEV_DEC_OUTSAMP
CYDEV_DEC_OUTSAMP EQU 0x40004e10
    ENDIF
    IF :LNOT::DEF:CYDEV_DEC_OUTSAMPM
CYDEV_DEC_OUTSAMPM EQU 0x40004e11
    ENDIF
    IF :LNOT::DEF:CYDEV_DEC_OUTSAMPH
CYDEV_DEC_OUTSAMPH EQU 0x40004e12
    ENDIF
    IF :LNOT::DEF:CYDEV_DEC_OUTSAMPS
CYDEV_DEC_OUTSAMPS EQU 0x40004e13
    ENDIF
    IF :LNOT::DEF:CYDEV_DEC_COHER
CYDEV_DEC_COHER EQU 0x40004e14
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR0_BASE
CYDEV_TMR0_BASE EQU 0x40004f00
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR0_SIZE
CYDEV_TMR0_SIZE EQU 0x0000000b
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR0_CFG0
CYDEV_TMR0_CFG0 EQU 0x40004f00
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR0_CFG1
CYDEV_TMR0_CFG1 EQU 0x40004f01
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR0_PER0
CYDEV_TMR0_PER0 EQU 0x40004f02
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR0_PER1
CYDEV_TMR0_PER1 EQU 0x40004f03
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR0_CNT_CMP0
CYDEV_TMR0_CNT_CMP0 EQU 0x40004f04
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR0_CNT_CMP1
CYDEV_TMR0_CNT_CMP1 EQU 0x40004f05
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR0_CAP0
CYDEV_TMR0_CAP0 EQU 0x40004f06
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR0_CAP1
CYDEV_TMR0_CAP1 EQU 0x40004f07
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR0_SR0
CYDEV_TMR0_SR0 EQU 0x40004f08
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR0_RT0
CYDEV_TMR0_RT0 EQU 0x40004f09
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR0_RT1
CYDEV_TMR0_RT1 EQU 0x40004f0a
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR1_BASE
CYDEV_TMR1_BASE EQU 0x40004f0c
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR1_SIZE
CYDEV_TMR1_SIZE EQU 0x0000000b
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR1_CFG0
CYDEV_TMR1_CFG0 EQU 0x40004f0c
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR1_CFG1
CYDEV_TMR1_CFG1 EQU 0x40004f0d
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR1_PER0
CYDEV_TMR1_PER0 EQU 0x40004f0e
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR1_PER1
CYDEV_TMR1_PER1 EQU 0x40004f0f
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR1_CNT_CMP0
CYDEV_TMR1_CNT_CMP0 EQU 0x40004f10
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR1_CNT_CMP1
CYDEV_TMR1_CNT_CMP1 EQU 0x40004f11
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR1_CAP0
CYDEV_TMR1_CAP0 EQU 0x40004f12
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR1_CAP1
CYDEV_TMR1_CAP1 EQU 0x40004f13
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR1_SR0
CYDEV_TMR1_SR0 EQU 0x40004f14
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR1_RT0
CYDEV_TMR1_RT0 EQU 0x40004f15
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR1_RT1
CYDEV_TMR1_RT1 EQU 0x40004f16
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR2_BASE
CYDEV_TMR2_BASE EQU 0x40004f18
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR2_SIZE
CYDEV_TMR2_SIZE EQU 0x0000000b
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR2_CFG0
CYDEV_TMR2_CFG0 EQU 0x40004f18
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR2_CFG1
CYDEV_TMR2_CFG1 EQU 0x40004f19
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR2_PER0
CYDEV_TMR2_PER0 EQU 0x40004f1a
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR2_PER1
CYDEV_TMR2_PER1 EQU 0x40004f1b
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR2_CNT_CMP0
CYDEV_TMR2_CNT_CMP0 EQU 0x40004f1c
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR2_CNT_CMP1
CYDEV_TMR2_CNT_CMP1 EQU 0x40004f1d
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR2_CAP0
CYDEV_TMR2_CAP0 EQU 0x40004f1e
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR2_CAP1
CYDEV_TMR2_CAP1 EQU 0x40004f1f
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR2_SR0
CYDEV_TMR2_SR0 EQU 0x40004f20
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR2_RT0
CYDEV_TMR2_RT0 EQU 0x40004f21
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR2_RT1
CYDEV_TMR2_RT1 EQU 0x40004f22
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR3_BASE
CYDEV_TMR3_BASE EQU 0x40004f24
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR3_SIZE
CYDEV_TMR3_SIZE EQU 0x0000000b
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR3_CFG0
CYDEV_TMR3_CFG0 EQU 0x40004f24
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR3_CFG1
CYDEV_TMR3_CFG1 EQU 0x40004f25
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR3_PER0
CYDEV_TMR3_PER0 EQU 0x40004f26
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR3_PER1
CYDEV_TMR3_PER1 EQU 0x40004f27
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR3_CNT_CMP0
CYDEV_TMR3_CNT_CMP0 EQU 0x40004f28
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR3_CNT_CMP1
CYDEV_TMR3_CNT_CMP1 EQU 0x40004f29
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR3_CAP0
CYDEV_TMR3_CAP0 EQU 0x40004f2a
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR3_CAP1
CYDEV_TMR3_CAP1 EQU 0x40004f2b
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR3_SR0
CYDEV_TMR3_SR0 EQU 0x40004f2c
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR3_RT0
CYDEV_TMR3_RT0 EQU 0x40004f2d
    ENDIF
    IF :LNOT::DEF:CYDEV_TMR3_RT1
CYDEV_TMR3_RT1 EQU 0x40004f2e
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_BASE
CYDEV_IO_BASE EQU 0x40005000
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_SIZE
CYDEV_IO_SIZE EQU 0x00000200
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_BASE
CYDEV_IO_PC_BASE EQU 0x40005000
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_SIZE
CYDEV_IO_PC_SIZE EQU 0x00000080
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT0_BASE
CYDEV_IO_PC_PRT0_BASE EQU 0x40005000
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT0_SIZE
CYDEV_IO_PC_PRT0_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT0_PC0
CYDEV_IO_PC_PRT0_PC0 EQU 0x40005000
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT0_PC1
CYDEV_IO_PC_PRT0_PC1 EQU 0x40005001
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT0_PC2
CYDEV_IO_PC_PRT0_PC2 EQU 0x40005002
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT0_PC3
CYDEV_IO_PC_PRT0_PC3 EQU 0x40005003
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT0_PC4
CYDEV_IO_PC_PRT0_PC4 EQU 0x40005004
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT0_PC5
CYDEV_IO_PC_PRT0_PC5 EQU 0x40005005
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT0_PC6
CYDEV_IO_PC_PRT0_PC6 EQU 0x40005006
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT0_PC7
CYDEV_IO_PC_PRT0_PC7 EQU 0x40005007
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT1_BASE
CYDEV_IO_PC_PRT1_BASE EQU 0x40005008
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT1_SIZE
CYDEV_IO_PC_PRT1_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT1_PC0
CYDEV_IO_PC_PRT1_PC0 EQU 0x40005008
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT1_PC1
CYDEV_IO_PC_PRT1_PC1 EQU 0x40005009
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT1_PC2
CYDEV_IO_PC_PRT1_PC2 EQU 0x4000500a
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT1_PC3
CYDEV_IO_PC_PRT1_PC3 EQU 0x4000500b
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT1_PC4
CYDEV_IO_PC_PRT1_PC4 EQU 0x4000500c
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT1_PC5
CYDEV_IO_PC_PRT1_PC5 EQU 0x4000500d
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT1_PC6
CYDEV_IO_PC_PRT1_PC6 EQU 0x4000500e
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT1_PC7
CYDEV_IO_PC_PRT1_PC7 EQU 0x4000500f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT2_BASE
CYDEV_IO_PC_PRT2_BASE EQU 0x40005010
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT2_SIZE
CYDEV_IO_PC_PRT2_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT2_PC0
CYDEV_IO_PC_PRT2_PC0 EQU 0x40005010
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT2_PC1
CYDEV_IO_PC_PRT2_PC1 EQU 0x40005011
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT2_PC2
CYDEV_IO_PC_PRT2_PC2 EQU 0x40005012
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT2_PC3
CYDEV_IO_PC_PRT2_PC3 EQU 0x40005013
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT2_PC4
CYDEV_IO_PC_PRT2_PC4 EQU 0x40005014
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT2_PC5
CYDEV_IO_PC_PRT2_PC5 EQU 0x40005015
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT2_PC6
CYDEV_IO_PC_PRT2_PC6 EQU 0x40005016
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT2_PC7
CYDEV_IO_PC_PRT2_PC7 EQU 0x40005017
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT3_BASE
CYDEV_IO_PC_PRT3_BASE EQU 0x40005018
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT3_SIZE
CYDEV_IO_PC_PRT3_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT3_PC0
CYDEV_IO_PC_PRT3_PC0 EQU 0x40005018
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT3_PC1
CYDEV_IO_PC_PRT3_PC1 EQU 0x40005019
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT3_PC2
CYDEV_IO_PC_PRT3_PC2 EQU 0x4000501a
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT3_PC3
CYDEV_IO_PC_PRT3_PC3 EQU 0x4000501b
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT3_PC4
CYDEV_IO_PC_PRT3_PC4 EQU 0x4000501c
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT3_PC5
CYDEV_IO_PC_PRT3_PC5 EQU 0x4000501d
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT3_PC6
CYDEV_IO_PC_PRT3_PC6 EQU 0x4000501e
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT3_PC7
CYDEV_IO_PC_PRT3_PC7 EQU 0x4000501f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT4_BASE
CYDEV_IO_PC_PRT4_BASE EQU 0x40005020
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT4_SIZE
CYDEV_IO_PC_PRT4_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT4_PC0
CYDEV_IO_PC_PRT4_PC0 EQU 0x40005020
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT4_PC1
CYDEV_IO_PC_PRT4_PC1 EQU 0x40005021
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT4_PC2
CYDEV_IO_PC_PRT4_PC2 EQU 0x40005022
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT4_PC3
CYDEV_IO_PC_PRT4_PC3 EQU 0x40005023
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT4_PC4
CYDEV_IO_PC_PRT4_PC4 EQU 0x40005024
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT4_PC5
CYDEV_IO_PC_PRT4_PC5 EQU 0x40005025
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT4_PC6
CYDEV_IO_PC_PRT4_PC6 EQU 0x40005026
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT4_PC7
CYDEV_IO_PC_PRT4_PC7 EQU 0x40005027
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT5_BASE
CYDEV_IO_PC_PRT5_BASE EQU 0x40005028
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT5_SIZE
CYDEV_IO_PC_PRT5_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT5_PC0
CYDEV_IO_PC_PRT5_PC0 EQU 0x40005028
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT5_PC1
CYDEV_IO_PC_PRT5_PC1 EQU 0x40005029
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT5_PC2
CYDEV_IO_PC_PRT5_PC2 EQU 0x4000502a
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT5_PC3
CYDEV_IO_PC_PRT5_PC3 EQU 0x4000502b
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT5_PC4
CYDEV_IO_PC_PRT5_PC4 EQU 0x4000502c
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT5_PC5
CYDEV_IO_PC_PRT5_PC5 EQU 0x4000502d
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT5_PC6
CYDEV_IO_PC_PRT5_PC6 EQU 0x4000502e
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT5_PC7
CYDEV_IO_PC_PRT5_PC7 EQU 0x4000502f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT6_BASE
CYDEV_IO_PC_PRT6_BASE EQU 0x40005030
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT6_SIZE
CYDEV_IO_PC_PRT6_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT6_PC0
CYDEV_IO_PC_PRT6_PC0 EQU 0x40005030
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT6_PC1
CYDEV_IO_PC_PRT6_PC1 EQU 0x40005031
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT6_PC2
CYDEV_IO_PC_PRT6_PC2 EQU 0x40005032
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT6_PC3
CYDEV_IO_PC_PRT6_PC3 EQU 0x40005033
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT6_PC4
CYDEV_IO_PC_PRT6_PC4 EQU 0x40005034
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT6_PC5
CYDEV_IO_PC_PRT6_PC5 EQU 0x40005035
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT6_PC6
CYDEV_IO_PC_PRT6_PC6 EQU 0x40005036
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT6_PC7
CYDEV_IO_PC_PRT6_PC7 EQU 0x40005037
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT12_BASE
CYDEV_IO_PC_PRT12_BASE EQU 0x40005060
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT12_SIZE
CYDEV_IO_PC_PRT12_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT12_PC0
CYDEV_IO_PC_PRT12_PC0 EQU 0x40005060
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT12_PC1
CYDEV_IO_PC_PRT12_PC1 EQU 0x40005061
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT12_PC2
CYDEV_IO_PC_PRT12_PC2 EQU 0x40005062
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT12_PC3
CYDEV_IO_PC_PRT12_PC3 EQU 0x40005063
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT12_PC4
CYDEV_IO_PC_PRT12_PC4 EQU 0x40005064
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT12_PC5
CYDEV_IO_PC_PRT12_PC5 EQU 0x40005065
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT12_PC6
CYDEV_IO_PC_PRT12_PC6 EQU 0x40005066
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT12_PC7
CYDEV_IO_PC_PRT12_PC7 EQU 0x40005067
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT15_BASE
CYDEV_IO_PC_PRT15_BASE EQU 0x40005078
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT15_SIZE
CYDEV_IO_PC_PRT15_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT15_PC0
CYDEV_IO_PC_PRT15_PC0 EQU 0x40005078
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT15_PC1
CYDEV_IO_PC_PRT15_PC1 EQU 0x40005079
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT15_PC2
CYDEV_IO_PC_PRT15_PC2 EQU 0x4000507a
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT15_PC3
CYDEV_IO_PC_PRT15_PC3 EQU 0x4000507b
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT15_PC4
CYDEV_IO_PC_PRT15_PC4 EQU 0x4000507c
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT15_PC5
CYDEV_IO_PC_PRT15_PC5 EQU 0x4000507d
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT15_PC6
CYDEV_IO_PC_PRT15_PC6 EQU 0x4000507e
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PC_PRT15_PC7
CYDEV_IO_PC_PRT15_PC7 EQU 0x4000507f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_BASE
CYDEV_IO_DR_BASE EQU 0x40005080
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_SIZE
CYDEV_IO_DR_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT0_BASE
CYDEV_IO_DR_PRT0_BASE EQU 0x40005080
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT0_SIZE
CYDEV_IO_DR_PRT0_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT0_DR_ALIAS
CYDEV_IO_DR_PRT0_DR_ALIAS EQU 0x40005080
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT1_BASE
CYDEV_IO_DR_PRT1_BASE EQU 0x40005081
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT1_SIZE
CYDEV_IO_DR_PRT1_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT1_DR_ALIAS
CYDEV_IO_DR_PRT1_DR_ALIAS EQU 0x40005081
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT2_BASE
CYDEV_IO_DR_PRT2_BASE EQU 0x40005082
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT2_SIZE
CYDEV_IO_DR_PRT2_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT2_DR_ALIAS
CYDEV_IO_DR_PRT2_DR_ALIAS EQU 0x40005082
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT3_BASE
CYDEV_IO_DR_PRT3_BASE EQU 0x40005083
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT3_SIZE
CYDEV_IO_DR_PRT3_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT3_DR_ALIAS
CYDEV_IO_DR_PRT3_DR_ALIAS EQU 0x40005083
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT4_BASE
CYDEV_IO_DR_PRT4_BASE EQU 0x40005084
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT4_SIZE
CYDEV_IO_DR_PRT4_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT4_DR_ALIAS
CYDEV_IO_DR_PRT4_DR_ALIAS EQU 0x40005084
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT5_BASE
CYDEV_IO_DR_PRT5_BASE EQU 0x40005085
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT5_SIZE
CYDEV_IO_DR_PRT5_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT5_DR_ALIAS
CYDEV_IO_DR_PRT5_DR_ALIAS EQU 0x40005085
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT6_BASE
CYDEV_IO_DR_PRT6_BASE EQU 0x40005086
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT6_SIZE
CYDEV_IO_DR_PRT6_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT6_DR_ALIAS
CYDEV_IO_DR_PRT6_DR_ALIAS EQU 0x40005086
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT12_BASE
CYDEV_IO_DR_PRT12_BASE EQU 0x4000508c
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT12_SIZE
CYDEV_IO_DR_PRT12_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT12_DR_ALIAS
CYDEV_IO_DR_PRT12_DR_ALIAS EQU 0x4000508c
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT15_BASE
CYDEV_IO_DR_PRT15_BASE EQU 0x4000508f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT15_SIZE
CYDEV_IO_DR_PRT15_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_DR_PRT15_DR_ALIAS
CYDEV_IO_DR_PRT15_DR_ALIAS EQU 0x4000508f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_BASE
CYDEV_IO_PS_BASE EQU 0x40005090
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_SIZE
CYDEV_IO_PS_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT0_BASE
CYDEV_IO_PS_PRT0_BASE EQU 0x40005090
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT0_SIZE
CYDEV_IO_PS_PRT0_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT0_PS_ALIAS
CYDEV_IO_PS_PRT0_PS_ALIAS EQU 0x40005090
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT1_BASE
CYDEV_IO_PS_PRT1_BASE EQU 0x40005091
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT1_SIZE
CYDEV_IO_PS_PRT1_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT1_PS_ALIAS
CYDEV_IO_PS_PRT1_PS_ALIAS EQU 0x40005091
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT2_BASE
CYDEV_IO_PS_PRT2_BASE EQU 0x40005092
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT2_SIZE
CYDEV_IO_PS_PRT2_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT2_PS_ALIAS
CYDEV_IO_PS_PRT2_PS_ALIAS EQU 0x40005092
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT3_BASE
CYDEV_IO_PS_PRT3_BASE EQU 0x40005093
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT3_SIZE
CYDEV_IO_PS_PRT3_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT3_PS_ALIAS
CYDEV_IO_PS_PRT3_PS_ALIAS EQU 0x40005093
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT4_BASE
CYDEV_IO_PS_PRT4_BASE EQU 0x40005094
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT4_SIZE
CYDEV_IO_PS_PRT4_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT4_PS_ALIAS
CYDEV_IO_PS_PRT4_PS_ALIAS EQU 0x40005094
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT5_BASE
CYDEV_IO_PS_PRT5_BASE EQU 0x40005095
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT5_SIZE
CYDEV_IO_PS_PRT5_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT5_PS_ALIAS
CYDEV_IO_PS_PRT5_PS_ALIAS EQU 0x40005095
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT6_BASE
CYDEV_IO_PS_PRT6_BASE EQU 0x40005096
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT6_SIZE
CYDEV_IO_PS_PRT6_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT6_PS_ALIAS
CYDEV_IO_PS_PRT6_PS_ALIAS EQU 0x40005096
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT12_BASE
CYDEV_IO_PS_PRT12_BASE EQU 0x4000509c
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT12_SIZE
CYDEV_IO_PS_PRT12_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT12_PS_ALIAS
CYDEV_IO_PS_PRT12_PS_ALIAS EQU 0x4000509c
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT15_BASE
CYDEV_IO_PS_PRT15_BASE EQU 0x4000509f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT15_SIZE
CYDEV_IO_PS_PRT15_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PS_PRT15_PS_ALIAS
CYDEV_IO_PS_PRT15_PS_ALIAS EQU 0x4000509f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_BASE
CYDEV_IO_PRT_BASE EQU 0x40005100
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_SIZE
CYDEV_IO_PRT_SIZE EQU 0x00000100
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT0_BASE
CYDEV_IO_PRT_PRT0_BASE EQU 0x40005100
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT0_SIZE
CYDEV_IO_PRT_PRT0_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT0_DR
CYDEV_IO_PRT_PRT0_DR EQU 0x40005100
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT0_PS
CYDEV_IO_PRT_PRT0_PS EQU 0x40005101
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT0_DM0
CYDEV_IO_PRT_PRT0_DM0 EQU 0x40005102
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT0_DM1
CYDEV_IO_PRT_PRT0_DM1 EQU 0x40005103
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT0_DM2
CYDEV_IO_PRT_PRT0_DM2 EQU 0x40005104
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT0_SLW
CYDEV_IO_PRT_PRT0_SLW EQU 0x40005105
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT0_BYP
CYDEV_IO_PRT_PRT0_BYP EQU 0x40005106
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT0_BIE
CYDEV_IO_PRT_PRT0_BIE EQU 0x40005107
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT0_INP_DIS
CYDEV_IO_PRT_PRT0_INP_DIS EQU 0x40005108
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT0_CTL
CYDEV_IO_PRT_PRT0_CTL EQU 0x40005109
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT0_PRT
CYDEV_IO_PRT_PRT0_PRT EQU 0x4000510a
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT0_BIT_MASK
CYDEV_IO_PRT_PRT0_BIT_MASK EQU 0x4000510b
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT0_AMUX
CYDEV_IO_PRT_PRT0_AMUX EQU 0x4000510c
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT0_AG
CYDEV_IO_PRT_PRT0_AG EQU 0x4000510d
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT0_LCD_COM_SEG
CYDEV_IO_PRT_PRT0_LCD_COM_SEG EQU 0x4000510e
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT0_LCD_EN
CYDEV_IO_PRT_PRT0_LCD_EN EQU 0x4000510f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT1_BASE
CYDEV_IO_PRT_PRT1_BASE EQU 0x40005110
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT1_SIZE
CYDEV_IO_PRT_PRT1_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT1_DR
CYDEV_IO_PRT_PRT1_DR EQU 0x40005110
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT1_PS
CYDEV_IO_PRT_PRT1_PS EQU 0x40005111
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT1_DM0
CYDEV_IO_PRT_PRT1_DM0 EQU 0x40005112
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT1_DM1
CYDEV_IO_PRT_PRT1_DM1 EQU 0x40005113
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT1_DM2
CYDEV_IO_PRT_PRT1_DM2 EQU 0x40005114
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT1_SLW
CYDEV_IO_PRT_PRT1_SLW EQU 0x40005115
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT1_BYP
CYDEV_IO_PRT_PRT1_BYP EQU 0x40005116
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT1_BIE
CYDEV_IO_PRT_PRT1_BIE EQU 0x40005117
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT1_INP_DIS
CYDEV_IO_PRT_PRT1_INP_DIS EQU 0x40005118
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT1_CTL
CYDEV_IO_PRT_PRT1_CTL EQU 0x40005119
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT1_PRT
CYDEV_IO_PRT_PRT1_PRT EQU 0x4000511a
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT1_BIT_MASK
CYDEV_IO_PRT_PRT1_BIT_MASK EQU 0x4000511b
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT1_AMUX
CYDEV_IO_PRT_PRT1_AMUX EQU 0x4000511c
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT1_AG
CYDEV_IO_PRT_PRT1_AG EQU 0x4000511d
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT1_LCD_COM_SEG
CYDEV_IO_PRT_PRT1_LCD_COM_SEG EQU 0x4000511e
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT1_LCD_EN
CYDEV_IO_PRT_PRT1_LCD_EN EQU 0x4000511f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT2_BASE
CYDEV_IO_PRT_PRT2_BASE EQU 0x40005120
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT2_SIZE
CYDEV_IO_PRT_PRT2_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT2_DR
CYDEV_IO_PRT_PRT2_DR EQU 0x40005120
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT2_PS
CYDEV_IO_PRT_PRT2_PS EQU 0x40005121
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT2_DM0
CYDEV_IO_PRT_PRT2_DM0 EQU 0x40005122
    ENDIF
