MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv.inc
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT2_DM1
CYDEV_IO_PRT_PRT2_DM1 EQU 0x40005123
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT2_DM2
CYDEV_IO_PRT_PRT2_DM2 EQU 0x40005124
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT2_SLW
CYDEV_IO_PRT_PRT2_SLW EQU 0x40005125
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT2_BYP
CYDEV_IO_PRT_PRT2_BYP EQU 0x40005126
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT2_BIE
CYDEV_IO_PRT_PRT2_BIE EQU 0x40005127
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT2_INP_DIS
CYDEV_IO_PRT_PRT2_INP_DIS EQU 0x40005128
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT2_CTL
CYDEV_IO_PRT_PRT2_CTL EQU 0x40005129
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT2_PRT
CYDEV_IO_PRT_PRT2_PRT EQU 0x4000512a
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT2_BIT_MASK
CYDEV_IO_PRT_PRT2_BIT_MASK EQU 0x4000512b
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT2_AMUX
CYDEV_IO_PRT_PRT2_AMUX EQU 0x4000512c
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT2_AG
CYDEV_IO_PRT_PRT2_AG EQU 0x4000512d
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT2_LCD_COM_SEG
CYDEV_IO_PRT_PRT2_LCD_COM_SEG EQU 0x4000512e
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT2_LCD_EN
CYDEV_IO_PRT_PRT2_LCD_EN EQU 0x4000512f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT3_BASE
CYDEV_IO_PRT_PRT3_BASE EQU 0x40005130
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT3_SIZE
CYDEV_IO_PRT_PRT3_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT3_DR
CYDEV_IO_PRT_PRT3_DR EQU 0x40005130
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT3_PS
CYDEV_IO_PRT_PRT3_PS EQU 0x40005131
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT3_DM0
CYDEV_IO_PRT_PRT3_DM0 EQU 0x40005132
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT3_DM1
CYDEV_IO_PRT_PRT3_DM1 EQU 0x40005133
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT3_DM2
CYDEV_IO_PRT_PRT3_DM2 EQU 0x40005134
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT3_SLW
CYDEV_IO_PRT_PRT3_SLW EQU 0x40005135
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT3_BYP
CYDEV_IO_PRT_PRT3_BYP EQU 0x40005136
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT3_BIE
CYDEV_IO_PRT_PRT3_BIE EQU 0x40005137
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT3_INP_DIS
CYDEV_IO_PRT_PRT3_INP_DIS EQU 0x40005138
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT3_CTL
CYDEV_IO_PRT_PRT3_CTL EQU 0x40005139
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT3_PRT
CYDEV_IO_PRT_PRT3_PRT EQU 0x4000513a
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT3_BIT_MASK
CYDEV_IO_PRT_PRT3_BIT_MASK EQU 0x4000513b
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT3_AMUX
CYDEV_IO_PRT_PRT3_AMUX EQU 0x4000513c
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT3_AG
CYDEV_IO_PRT_PRT3_AG EQU 0x4000513d
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT3_LCD_COM_SEG
CYDEV_IO_PRT_PRT3_LCD_COM_SEG EQU 0x4000513e
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT3_LCD_EN
CYDEV_IO_PRT_PRT3_LCD_EN EQU 0x4000513f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT4_BASE
CYDEV_IO_PRT_PRT4_BASE EQU 0x40005140
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT4_SIZE
CYDEV_IO_PRT_PRT4_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT4_DR
CYDEV_IO_PRT_PRT4_DR EQU 0x40005140
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT4_PS
CYDEV_IO_PRT_PRT4_PS EQU 0x40005141
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT4_DM0
CYDEV_IO_PRT_PRT4_DM0 EQU 0x40005142
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT4_DM1
CYDEV_IO_PRT_PRT4_DM1 EQU 0x40005143
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT4_DM2
CYDEV_IO_PRT_PRT4_DM2 EQU 0x40005144
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT4_SLW
CYDEV_IO_PRT_PRT4_SLW EQU 0x40005145
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT4_BYP
CYDEV_IO_PRT_PRT4_BYP EQU 0x40005146
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT4_BIE
CYDEV_IO_PRT_PRT4_BIE EQU 0x40005147
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT4_INP_DIS
CYDEV_IO_PRT_PRT4_INP_DIS EQU 0x40005148
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT4_CTL
CYDEV_IO_PRT_PRT4_CTL EQU 0x40005149
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT4_PRT
CYDEV_IO_PRT_PRT4_PRT EQU 0x4000514a
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT4_BIT_MASK
CYDEV_IO_PRT_PRT4_BIT_MASK EQU 0x4000514b
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT4_AMUX
CYDEV_IO_PRT_PRT4_AMUX EQU 0x4000514c
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT4_AG
CYDEV_IO_PRT_PRT4_AG EQU 0x4000514d
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT4_LCD_COM_SEG
CYDEV_IO_PRT_PRT4_LCD_COM_SEG EQU 0x4000514e
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT4_LCD_EN
CYDEV_IO_PRT_PRT4_LCD_EN EQU 0x4000514f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT5_BASE
CYDEV_IO_PRT_PRT5_BASE EQU 0x40005150
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT5_SIZE
CYDEV_IO_PRT_PRT5_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT5_DR
CYDEV_IO_PRT_PRT5_DR EQU 0x40005150
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT5_PS
CYDEV_IO_PRT_PRT5_PS EQU 0x40005151
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT5_DM0
CYDEV_IO_PRT_PRT5_DM0 EQU 0x40005152
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT5_DM1
CYDEV_IO_PRT_PRT5_DM1 EQU 0x40005153
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT5_DM2
CYDEV_IO_PRT_PRT5_DM2 EQU 0x40005154
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT5_SLW
CYDEV_IO_PRT_PRT5_SLW EQU 0x40005155
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT5_BYP
CYDEV_IO_PRT_PRT5_BYP EQU 0x40005156
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT5_BIE
CYDEV_IO_PRT_PRT5_BIE EQU 0x40005157
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT5_INP_DIS
CYDEV_IO_PRT_PRT5_INP_DIS EQU 0x40005158
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT5_CTL
CYDEV_IO_PRT_PRT5_CTL EQU 0x40005159
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT5_PRT
CYDEV_IO_PRT_PRT5_PRT EQU 0x4000515a
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT5_BIT_MASK
CYDEV_IO_PRT_PRT5_BIT_MASK EQU 0x4000515b
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT5_AMUX
CYDEV_IO_PRT_PRT5_AMUX EQU 0x4000515c
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT5_AG
CYDEV_IO_PRT_PRT5_AG EQU 0x4000515d
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT5_LCD_COM_SEG
CYDEV_IO_PRT_PRT5_LCD_COM_SEG EQU 0x4000515e
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT5_LCD_EN
CYDEV_IO_PRT_PRT5_LCD_EN EQU 0x4000515f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT6_BASE
CYDEV_IO_PRT_PRT6_BASE EQU 0x40005160
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT6_SIZE
CYDEV_IO_PRT_PRT6_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT6_DR
CYDEV_IO_PRT_PRT6_DR EQU 0x40005160
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT6_PS
CYDEV_IO_PRT_PRT6_PS EQU 0x40005161
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT6_DM0
CYDEV_IO_PRT_PRT6_DM0 EQU 0x40005162
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT6_DM1
CYDEV_IO_PRT_PRT6_DM1 EQU 0x40005163
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT6_DM2
CYDEV_IO_PRT_PRT6_DM2 EQU 0x40005164
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT6_SLW
CYDEV_IO_PRT_PRT6_SLW EQU 0x40005165
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT6_BYP
CYDEV_IO_PRT_PRT6_BYP EQU 0x40005166
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT6_BIE
CYDEV_IO_PRT_PRT6_BIE EQU 0x40005167
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT6_INP_DIS
CYDEV_IO_PRT_PRT6_INP_DIS EQU 0x40005168
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT6_CTL
CYDEV_IO_PRT_PRT6_CTL EQU 0x40005169
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT6_PRT
CYDEV_IO_PRT_PRT6_PRT EQU 0x4000516a
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT6_BIT_MASK
CYDEV_IO_PRT_PRT6_BIT_MASK EQU 0x4000516b
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT6_AMUX
CYDEV_IO_PRT_PRT6_AMUX EQU 0x4000516c
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT6_AG
CYDEV_IO_PRT_PRT6_AG EQU 0x4000516d
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT6_LCD_COM_SEG
CYDEV_IO_PRT_PRT6_LCD_COM_SEG EQU 0x4000516e
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT6_LCD_EN
CYDEV_IO_PRT_PRT6_LCD_EN EQU 0x4000516f
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT12_BASE
CYDEV_IO_PRT_PRT12_BASE EQU 0x400051c0
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT12_SIZE
CYDEV_IO_PRT_PRT12_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT12_DR
CYDEV_IO_PRT_PRT12_DR EQU 0x400051c0
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT12_PS
CYDEV_IO_PRT_PRT12_PS EQU 0x400051c1
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT12_DM0
CYDEV_IO_PRT_PRT12_DM0 EQU 0x400051c2
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT12_DM1
CYDEV_IO_PRT_PRT12_DM1 EQU 0x400051c3
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT12_DM2
CYDEV_IO_PRT_PRT12_DM2 EQU 0x400051c4
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT12_SLW
CYDEV_IO_PRT_PRT12_SLW EQU 0x400051c5
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT12_BYP
CYDEV_IO_PRT_PRT12_BYP EQU 0x400051c6
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT12_BIE
CYDEV_IO_PRT_PRT12_BIE EQU 0x400051c7
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT12_INP_DIS
CYDEV_IO_PRT_PRT12_INP_DIS EQU 0x400051c8
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT12_SIO_HYST_EN
CYDEV_IO_PRT_PRT12_SIO_HYST_EN EQU 0x400051c9
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT12_PRT
CYDEV_IO_PRT_PRT12_PRT EQU 0x400051ca
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT12_BIT_MASK
CYDEV_IO_PRT_PRT12_BIT_MASK EQU 0x400051cb
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT12_SIO_REG_HIFREQ
CYDEV_IO_PRT_PRT12_SIO_REG_HIFREQ EQU 0x400051cc
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT12_AG
CYDEV_IO_PRT_PRT12_AG EQU 0x400051cd
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT12_SIO_CFG
CYDEV_IO_PRT_PRT12_SIO_CFG EQU 0x400051ce
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT12_SIO_DIFF
CYDEV_IO_PRT_PRT12_SIO_DIFF EQU 0x400051cf
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT15_BASE
CYDEV_IO_PRT_PRT15_BASE EQU 0x400051f0
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT15_SIZE
CYDEV_IO_PRT_PRT15_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT15_DR
CYDEV_IO_PRT_PRT15_DR EQU 0x400051f0
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT15_PS
CYDEV_IO_PRT_PRT15_PS EQU 0x400051f1
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT15_DM0
CYDEV_IO_PRT_PRT15_DM0 EQU 0x400051f2
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT15_DM1
CYDEV_IO_PRT_PRT15_DM1 EQU 0x400051f3
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT15_DM2
CYDEV_IO_PRT_PRT15_DM2 EQU 0x400051f4
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT15_SLW
CYDEV_IO_PRT_PRT15_SLW EQU 0x400051f5
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT15_BYP
CYDEV_IO_PRT_PRT15_BYP EQU 0x400051f6
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT15_BIE
CYDEV_IO_PRT_PRT15_BIE EQU 0x400051f7
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT15_INP_DIS
CYDEV_IO_PRT_PRT15_INP_DIS EQU 0x400051f8
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT15_CTL
CYDEV_IO_PRT_PRT15_CTL EQU 0x400051f9
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT15_PRT
CYDEV_IO_PRT_PRT15_PRT EQU 0x400051fa
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT15_BIT_MASK
CYDEV_IO_PRT_PRT15_BIT_MASK EQU 0x400051fb
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT15_AMUX
CYDEV_IO_PRT_PRT15_AMUX EQU 0x400051fc
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT15_AG
CYDEV_IO_PRT_PRT15_AG EQU 0x400051fd
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT15_LCD_COM_SEG
CYDEV_IO_PRT_PRT15_LCD_COM_SEG EQU 0x400051fe
    ENDIF
    IF :LNOT::DEF:CYDEV_IO_PRT_PRT15_LCD_EN
CYDEV_IO_PRT_PRT15_LCD_EN EQU 0x400051ff
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_BASE
CYDEV_PRTDSI_BASE EQU 0x40005200
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_SIZE
CYDEV_PRTDSI_SIZE EQU 0x0000007f
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT0_BASE
CYDEV_PRTDSI_PRT0_BASE EQU 0x40005200
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT0_SIZE
CYDEV_PRTDSI_PRT0_SIZE EQU 0x00000007
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT0_OUT_SEL0
CYDEV_PRTDSI_PRT0_OUT_SEL0 EQU 0x40005200
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT0_OUT_SEL1
CYDEV_PRTDSI_PRT0_OUT_SEL1 EQU 0x40005201
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT0_OE_SEL0
CYDEV_PRTDSI_PRT0_OE_SEL0 EQU 0x40005202
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT0_OE_SEL1
CYDEV_PRTDSI_PRT0_OE_SEL1 EQU 0x40005203
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT0_DBL_SYNC_IN
CYDEV_PRTDSI_PRT0_DBL_SYNC_IN EQU 0x40005204
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT0_SYNC_OUT
CYDEV_PRTDSI_PRT0_SYNC_OUT EQU 0x40005205
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT0_CAPS_SEL
CYDEV_PRTDSI_PRT0_CAPS_SEL EQU 0x40005206
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT1_BASE
CYDEV_PRTDSI_PRT1_BASE EQU 0x40005208
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT1_SIZE
CYDEV_PRTDSI_PRT1_SIZE EQU 0x00000007
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT1_OUT_SEL0
CYDEV_PRTDSI_PRT1_OUT_SEL0 EQU 0x40005208
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT1_OUT_SEL1
CYDEV_PRTDSI_PRT1_OUT_SEL1 EQU 0x40005209
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT1_OE_SEL0
CYDEV_PRTDSI_PRT1_OE_SEL0 EQU 0x4000520a
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT1_OE_SEL1
CYDEV_PRTDSI_PRT1_OE_SEL1 EQU 0x4000520b
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT1_DBL_SYNC_IN
CYDEV_PRTDSI_PRT1_DBL_SYNC_IN EQU 0x4000520c
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT1_SYNC_OUT
CYDEV_PRTDSI_PRT1_SYNC_OUT EQU 0x4000520d
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT1_CAPS_SEL
CYDEV_PRTDSI_PRT1_CAPS_SEL EQU 0x4000520e
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT2_BASE
CYDEV_PRTDSI_PRT2_BASE EQU 0x40005210
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT2_SIZE
CYDEV_PRTDSI_PRT2_SIZE EQU 0x00000007
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT2_OUT_SEL0
CYDEV_PRTDSI_PRT2_OUT_SEL0 EQU 0x40005210
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT2_OUT_SEL1
CYDEV_PRTDSI_PRT2_OUT_SEL1 EQU 0x40005211
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT2_OE_SEL0
CYDEV_PRTDSI_PRT2_OE_SEL0 EQU 0x40005212
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT2_OE_SEL1
CYDEV_PRTDSI_PRT2_OE_SEL1 EQU 0x40005213
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT2_DBL_SYNC_IN
CYDEV_PRTDSI_PRT2_DBL_SYNC_IN EQU 0x40005214
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT2_SYNC_OUT
CYDEV_PRTDSI_PRT2_SYNC_OUT EQU 0x40005215
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT2_CAPS_SEL
CYDEV_PRTDSI_PRT2_CAPS_SEL EQU 0x40005216
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT3_BASE
CYDEV_PRTDSI_PRT3_BASE EQU 0x40005218
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT3_SIZE
CYDEV_PRTDSI_PRT3_SIZE EQU 0x00000007
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT3_OUT_SEL0
CYDEV_PRTDSI_PRT3_OUT_SEL0 EQU 0x40005218
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT3_OUT_SEL1
CYDEV_PRTDSI_PRT3_OUT_SEL1 EQU 0x40005219
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT3_OE_SEL0
CYDEV_PRTDSI_PRT3_OE_SEL0 EQU 0x4000521a
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT3_OE_SEL1
CYDEV_PRTDSI_PRT3_OE_SEL1 EQU 0x4000521b
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT3_DBL_SYNC_IN
CYDEV_PRTDSI_PRT3_DBL_SYNC_IN EQU 0x4000521c
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT3_SYNC_OUT
CYDEV_PRTDSI_PRT3_SYNC_OUT EQU 0x4000521d
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT3_CAPS_SEL
CYDEV_PRTDSI_PRT3_CAPS_SEL EQU 0x4000521e
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT4_BASE
CYDEV_PRTDSI_PRT4_BASE EQU 0x40005220
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT4_SIZE
CYDEV_PRTDSI_PRT4_SIZE EQU 0x00000007
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT4_OUT_SEL0
CYDEV_PRTDSI_PRT4_OUT_SEL0 EQU 0x40005220
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT4_OUT_SEL1
CYDEV_PRTDSI_PRT4_OUT_SEL1 EQU 0x40005221
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT4_OE_SEL0
CYDEV_PRTDSI_PRT4_OE_SEL0 EQU 0x40005222
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT4_OE_SEL1
CYDEV_PRTDSI_PRT4_OE_SEL1 EQU 0x40005223
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT4_DBL_SYNC_IN
CYDEV_PRTDSI_PRT4_DBL_SYNC_IN EQU 0x40005224
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT4_SYNC_OUT
CYDEV_PRTDSI_PRT4_SYNC_OUT EQU 0x40005225
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT4_CAPS_SEL
CYDEV_PRTDSI_PRT4_CAPS_SEL EQU 0x40005226
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT5_BASE
CYDEV_PRTDSI_PRT5_BASE EQU 0x40005228
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT5_SIZE
CYDEV_PRTDSI_PRT5_SIZE EQU 0x00000007
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT5_OUT_SEL0
CYDEV_PRTDSI_PRT5_OUT_SEL0 EQU 0x40005228
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT5_OUT_SEL1
CYDEV_PRTDSI_PRT5_OUT_SEL1 EQU 0x40005229
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT5_OE_SEL0
CYDEV_PRTDSI_PRT5_OE_SEL0 EQU 0x4000522a
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT5_OE_SEL1
CYDEV_PRTDSI_PRT5_OE_SEL1 EQU 0x4000522b
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT5_DBL_SYNC_IN
CYDEV_PRTDSI_PRT5_DBL_SYNC_IN EQU 0x4000522c
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT5_SYNC_OUT
CYDEV_PRTDSI_PRT5_SYNC_OUT EQU 0x4000522d
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT5_CAPS_SEL
CYDEV_PRTDSI_PRT5_CAPS_SEL EQU 0x4000522e
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT6_BASE
CYDEV_PRTDSI_PRT6_BASE EQU 0x40005230
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT6_SIZE
CYDEV_PRTDSI_PRT6_SIZE EQU 0x00000007
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT6_OUT_SEL0
CYDEV_PRTDSI_PRT6_OUT_SEL0 EQU 0x40005230
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT6_OUT_SEL1
CYDEV_PRTDSI_PRT6_OUT_SEL1 EQU 0x40005231
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT6_OE_SEL0
CYDEV_PRTDSI_PRT6_OE_SEL0 EQU 0x40005232
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT6_OE_SEL1
CYDEV_PRTDSI_PRT6_OE_SEL1 EQU 0x40005233
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT6_DBL_SYNC_IN
CYDEV_PRTDSI_PRT6_DBL_SYNC_IN EQU 0x40005234
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT6_SYNC_OUT
CYDEV_PRTDSI_PRT6_SYNC_OUT EQU 0x40005235
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT6_CAPS_SEL
CYDEV_PRTDSI_PRT6_CAPS_SEL EQU 0x40005236
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT12_BASE
CYDEV_PRTDSI_PRT12_BASE EQU 0x40005260
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT12_SIZE
CYDEV_PRTDSI_PRT12_SIZE EQU 0x00000006
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT12_OUT_SEL0
CYDEV_PRTDSI_PRT12_OUT_SEL0 EQU 0x40005260
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT12_OUT_SEL1
CYDEV_PRTDSI_PRT12_OUT_SEL1 EQU 0x40005261
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT12_OE_SEL0
CYDEV_PRTDSI_PRT12_OE_SEL0 EQU 0x40005262
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT12_OE_SEL1
CYDEV_PRTDSI_PRT12_OE_SEL1 EQU 0x40005263
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT12_DBL_SYNC_IN
CYDEV_PRTDSI_PRT12_DBL_SYNC_IN EQU 0x40005264
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT12_SYNC_OUT
CYDEV_PRTDSI_PRT12_SYNC_OUT EQU 0x40005265
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT15_BASE
CYDEV_PRTDSI_PRT15_BASE EQU 0x40005278
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT15_SIZE
CYDEV_PRTDSI_PRT15_SIZE EQU 0x00000007
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT15_OUT_SEL0
CYDEV_PRTDSI_PRT15_OUT_SEL0 EQU 0x40005278
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT15_OUT_SEL1
CYDEV_PRTDSI_PRT15_OUT_SEL1 EQU 0x40005279
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT15_OE_SEL0
CYDEV_PRTDSI_PRT15_OE_SEL0 EQU 0x4000527a
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT15_OE_SEL1
CYDEV_PRTDSI_PRT15_OE_SEL1 EQU 0x4000527b
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT15_DBL_SYNC_IN
CYDEV_PRTDSI_PRT15_DBL_SYNC_IN EQU 0x4000527c
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT15_SYNC_OUT
CYDEV_PRTDSI_PRT15_SYNC_OUT EQU 0x4000527d
    ENDIF
    IF :LNOT::DEF:CYDEV_PRTDSI_PRT15_CAPS_SEL
CYDEV_PRTDSI_PRT15_CAPS_SEL EQU 0x4000527e
    ENDIF
    IF :LNOT::DEF:CYDEV_EMIF_BASE
CYDEV_EMIF_BASE EQU 0x40005400
    ENDIF
    IF :LNOT::DEF:CYDEV_EMIF_SIZE
CYDEV_EMIF_SIZE EQU 0x00000005
    ENDIF
    IF :LNOT::DEF:CYDEV_EMIF_NO_UDB
CYDEV_EMIF_NO_UDB EQU 0x40005400
    ENDIF
    IF :LNOT::DEF:CYDEV_EMIF_WAIT_STATES
CYDEV_EMIF_WAIT_STATES EQU 0x40005401
    ENDIF
    IF :LNOT::DEF:CYDEV_EMIF_MEM_DWN
CYDEV_EMIF_MEM_DWN EQU 0x40005402
    ENDIF
    IF :LNOT::DEF:CYDEV_EMIF_MEMCLK_DIV
CYDEV_EMIF_MEMCLK_DIV EQU 0x40005403
    ENDIF
    IF :LNOT::DEF:CYDEV_EMIF_CLOCK_EN
CYDEV_EMIF_CLOCK_EN EQU 0x40005404
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_BASE
CYDEV_ANAIF_BASE EQU 0x40005800
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_SIZE
CYDEV_ANAIF_SIZE EQU 0x000003a9
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_BASE
CYDEV_ANAIF_CFG_BASE EQU 0x40005800
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SIZE
CYDEV_ANAIF_CFG_SIZE EQU 0x00000110
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC0_BASE
CYDEV_ANAIF_CFG_SC0_BASE EQU 0x40005800
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC0_SIZE
CYDEV_ANAIF_CFG_SC0_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC0_CR0
CYDEV_ANAIF_CFG_SC0_CR0 EQU 0x40005800
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC0_CR1
CYDEV_ANAIF_CFG_SC0_CR1 EQU 0x40005801
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC0_CR2
CYDEV_ANAIF_CFG_SC0_CR2 EQU 0x40005802
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC1_BASE
CYDEV_ANAIF_CFG_SC1_BASE EQU 0x40005804
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC1_SIZE
CYDEV_ANAIF_CFG_SC1_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC1_CR0
CYDEV_ANAIF_CFG_SC1_CR0 EQU 0x40005804
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC1_CR1
CYDEV_ANAIF_CFG_SC1_CR1 EQU 0x40005805
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC1_CR2
CYDEV_ANAIF_CFG_SC1_CR2 EQU 0x40005806
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC2_BASE
CYDEV_ANAIF_CFG_SC2_BASE EQU 0x40005808
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC2_SIZE
CYDEV_ANAIF_CFG_SC2_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC2_CR0
CYDEV_ANAIF_CFG_SC2_CR0 EQU 0x40005808
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC2_CR1
CYDEV_ANAIF_CFG_SC2_CR1 EQU 0x40005809
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC2_CR2
CYDEV_ANAIF_CFG_SC2_CR2 EQU 0x4000580a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC3_BASE
CYDEV_ANAIF_CFG_SC3_BASE EQU 0x4000580c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC3_SIZE
CYDEV_ANAIF_CFG_SC3_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC3_CR0
CYDEV_ANAIF_CFG_SC3_CR0 EQU 0x4000580c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC3_CR1
CYDEV_ANAIF_CFG_SC3_CR1 EQU 0x4000580d
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SC3_CR2
CYDEV_ANAIF_CFG_SC3_CR2 EQU 0x4000580e
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC0_BASE
CYDEV_ANAIF_CFG_DAC0_BASE EQU 0x40005820
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC0_SIZE
CYDEV_ANAIF_CFG_DAC0_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC0_CR0
CYDEV_ANAIF_CFG_DAC0_CR0 EQU 0x40005820
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC0_CR1
CYDEV_ANAIF_CFG_DAC0_CR1 EQU 0x40005821
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC0_TST
CYDEV_ANAIF_CFG_DAC0_TST EQU 0x40005822
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC1_BASE
CYDEV_ANAIF_CFG_DAC1_BASE EQU 0x40005824
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC1_SIZE
CYDEV_ANAIF_CFG_DAC1_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC1_CR0
CYDEV_ANAIF_CFG_DAC1_CR0 EQU 0x40005824
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC1_CR1
CYDEV_ANAIF_CFG_DAC1_CR1 EQU 0x40005825
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC1_TST
CYDEV_ANAIF_CFG_DAC1_TST EQU 0x40005826
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC2_BASE
CYDEV_ANAIF_CFG_DAC2_BASE EQU 0x40005828
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC2_SIZE
CYDEV_ANAIF_CFG_DAC2_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC2_CR0
CYDEV_ANAIF_CFG_DAC2_CR0 EQU 0x40005828
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC2_CR1
CYDEV_ANAIF_CFG_DAC2_CR1 EQU 0x40005829
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC2_TST
CYDEV_ANAIF_CFG_DAC2_TST EQU 0x4000582a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC3_BASE
CYDEV_ANAIF_CFG_DAC3_BASE EQU 0x4000582c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC3_SIZE
CYDEV_ANAIF_CFG_DAC3_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC3_CR0
CYDEV_ANAIF_CFG_DAC3_CR0 EQU 0x4000582c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC3_CR1
CYDEV_ANAIF_CFG_DAC3_CR1 EQU 0x4000582d
