MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv.inc
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DAC3_TST
CYDEV_ANAIF_CFG_DAC3_TST EQU 0x4000582e
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CMP0_BASE
CYDEV_ANAIF_CFG_CMP0_BASE EQU 0x40005840
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CMP0_SIZE
CYDEV_ANAIF_CFG_CMP0_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CMP0_CR
CYDEV_ANAIF_CFG_CMP0_CR EQU 0x40005840
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CMP1_BASE
CYDEV_ANAIF_CFG_CMP1_BASE EQU 0x40005841
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CMP1_SIZE
CYDEV_ANAIF_CFG_CMP1_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CMP1_CR
CYDEV_ANAIF_CFG_CMP1_CR EQU 0x40005841
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CMP2_BASE
CYDEV_ANAIF_CFG_CMP2_BASE EQU 0x40005842
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CMP2_SIZE
CYDEV_ANAIF_CFG_CMP2_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CMP2_CR
CYDEV_ANAIF_CFG_CMP2_CR EQU 0x40005842
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CMP3_BASE
CYDEV_ANAIF_CFG_CMP3_BASE EQU 0x40005843
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CMP3_SIZE
CYDEV_ANAIF_CFG_CMP3_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CMP3_CR
CYDEV_ANAIF_CFG_CMP3_CR EQU 0x40005843
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT0_BASE
CYDEV_ANAIF_CFG_LUT0_BASE EQU 0x40005848
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT0_SIZE
CYDEV_ANAIF_CFG_LUT0_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT0_CR
CYDEV_ANAIF_CFG_LUT0_CR EQU 0x40005848
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT0_MX
CYDEV_ANAIF_CFG_LUT0_MX EQU 0x40005849
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT1_BASE
CYDEV_ANAIF_CFG_LUT1_BASE EQU 0x4000584a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT1_SIZE
CYDEV_ANAIF_CFG_LUT1_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT1_CR
CYDEV_ANAIF_CFG_LUT1_CR EQU 0x4000584a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT1_MX
CYDEV_ANAIF_CFG_LUT1_MX EQU 0x4000584b
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT2_BASE
CYDEV_ANAIF_CFG_LUT2_BASE EQU 0x4000584c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT2_SIZE
CYDEV_ANAIF_CFG_LUT2_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT2_CR
CYDEV_ANAIF_CFG_LUT2_CR EQU 0x4000584c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT2_MX
CYDEV_ANAIF_CFG_LUT2_MX EQU 0x4000584d
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT3_BASE
CYDEV_ANAIF_CFG_LUT3_BASE EQU 0x4000584e
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT3_SIZE
CYDEV_ANAIF_CFG_LUT3_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT3_CR
CYDEV_ANAIF_CFG_LUT3_CR EQU 0x4000584e
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LUT3_MX
CYDEV_ANAIF_CFG_LUT3_MX EQU 0x4000584f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF0_BASE
CYDEV_ANAIF_CFG_ABUF0_BASE EQU 0x40005858
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF0_SIZE
CYDEV_ANAIF_CFG_ABUF0_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF0_CR
CYDEV_ANAIF_CFG_ABUF0_CR EQU 0x40005858
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF0_RSVD
CYDEV_ANAIF_CFG_ABUF0_RSVD EQU 0x40005859
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF1_BASE
CYDEV_ANAIF_CFG_ABUF1_BASE EQU 0x4000585a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF1_SIZE
CYDEV_ANAIF_CFG_ABUF1_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF1_CR
CYDEV_ANAIF_CFG_ABUF1_CR EQU 0x4000585a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF1_RSVD
CYDEV_ANAIF_CFG_ABUF1_RSVD EQU 0x4000585b
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF2_BASE
CYDEV_ANAIF_CFG_ABUF2_BASE EQU 0x4000585c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF2_SIZE
CYDEV_ANAIF_CFG_ABUF2_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF2_CR
CYDEV_ANAIF_CFG_ABUF2_CR EQU 0x4000585c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF2_RSVD
CYDEV_ANAIF_CFG_ABUF2_RSVD EQU 0x4000585d
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF3_BASE
CYDEV_ANAIF_CFG_ABUF3_BASE EQU 0x4000585e
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF3_SIZE
CYDEV_ANAIF_CFG_ABUF3_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF3_CR
CYDEV_ANAIF_CFG_ABUF3_CR EQU 0x4000585e
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_ABUF3_RSVD
CYDEV_ANAIF_CFG_ABUF3_RSVD EQU 0x4000585f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LCDDAC_BASE
CYDEV_ANAIF_CFG_LCDDAC_BASE EQU 0x40005868
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LCDDAC_SIZE
CYDEV_ANAIF_CFG_LCDDAC_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LCDDAC_CR0
CYDEV_ANAIF_CFG_LCDDAC_CR0 EQU 0x40005868
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LCDDAC_CR1
CYDEV_ANAIF_CFG_LCDDAC_CR1 EQU 0x40005869
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LCDDRV_BASE
CYDEV_ANAIF_CFG_LCDDRV_BASE EQU 0x4000586a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LCDDRV_SIZE
CYDEV_ANAIF_CFG_LCDDRV_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LCDDRV_CR
CYDEV_ANAIF_CFG_LCDDRV_CR EQU 0x4000586a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_BG_BASE
CYDEV_ANAIF_CFG_BG_BASE EQU 0x4000586c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_BG_SIZE
CYDEV_ANAIF_CFG_BG_SIZE EQU 0x00000004
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_BG_CR0
CYDEV_ANAIF_CFG_BG_CR0 EQU 0x4000586c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_BG_RSVD
CYDEV_ANAIF_CFG_BG_RSVD EQU 0x4000586d
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_BG_DFT0
CYDEV_ANAIF_CFG_BG_DFT0 EQU 0x4000586e
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_BG_DFT1
CYDEV_ANAIF_CFG_BG_DFT1 EQU 0x4000586f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CAPSL_BASE
CYDEV_ANAIF_CFG_CAPSL_BASE EQU 0x40005870
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CAPSL_SIZE
CYDEV_ANAIF_CFG_CAPSL_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CAPSL_CFG0
CYDEV_ANAIF_CFG_CAPSL_CFG0 EQU 0x40005870
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CAPSL_CFG1
CYDEV_ANAIF_CFG_CAPSL_CFG1 EQU 0x40005871
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CAPSR_BASE
CYDEV_ANAIF_CFG_CAPSR_BASE EQU 0x40005872
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CAPSR_SIZE
CYDEV_ANAIF_CFG_CAPSR_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CAPSR_CFG0
CYDEV_ANAIF_CFG_CAPSR_CFG0 EQU 0x40005872
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CAPSR_CFG1
CYDEV_ANAIF_CFG_CAPSR_CFG1 EQU 0x40005873
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CAPS_BASE
CYDEV_ANAIF_CFG_CAPS_BASE EQU 0x40005874
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CAPS_SIZE
CYDEV_ANAIF_CFG_CAPS_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_CAPS_DFT
CYDEV_ANAIF_CFG_CAPS_DFT EQU 0x40005874
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_PUMP_BASE
CYDEV_ANAIF_CFG_PUMP_BASE EQU 0x40005876
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_PUMP_SIZE
CYDEV_ANAIF_CFG_PUMP_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_PUMP_CR0
CYDEV_ANAIF_CFG_PUMP_CR0 EQU 0x40005876
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_PUMP_CR1
CYDEV_ANAIF_CFG_PUMP_CR1 EQU 0x40005877
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LPF0_BASE
CYDEV_ANAIF_CFG_LPF0_BASE EQU 0x40005878
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LPF0_SIZE
CYDEV_ANAIF_CFG_LPF0_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LPF0_CR0
CYDEV_ANAIF_CFG_LPF0_CR0 EQU 0x40005878
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LPF0_RSVD
CYDEV_ANAIF_CFG_LPF0_RSVD EQU 0x40005879
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LPF1_BASE
CYDEV_ANAIF_CFG_LPF1_BASE EQU 0x4000587a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LPF1_SIZE
CYDEV_ANAIF_CFG_LPF1_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LPF1_CR0
CYDEV_ANAIF_CFG_LPF1_CR0 EQU 0x4000587a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_LPF1_RSVD
CYDEV_ANAIF_CFG_LPF1_RSVD EQU 0x4000587b
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_MISC_BASE
CYDEV_ANAIF_CFG_MISC_BASE EQU 0x4000587c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_MISC_SIZE
CYDEV_ANAIF_CFG_MISC_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_MISC_CR0
CYDEV_ANAIF_CFG_MISC_CR0 EQU 0x4000587c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_TFAULT_BASE
CYDEV_ANAIF_CFG_TFAULT_BASE EQU 0x4000587e
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_TFAULT_SIZE
CYDEV_ANAIF_CFG_TFAULT_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_TFAULT_CR0
CYDEV_ANAIF_CFG_TFAULT_CR0 EQU 0x4000587e
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_TFAULT_CR1
CYDEV_ANAIF_CFG_TFAULT_CR1 EQU 0x4000587f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_BASE
CYDEV_ANAIF_CFG_DSM0_BASE EQU 0x40005880
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_SIZE
CYDEV_ANAIF_CFG_DSM0_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_CR0
CYDEV_ANAIF_CFG_DSM0_CR0 EQU 0x40005880
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_CR1
CYDEV_ANAIF_CFG_DSM0_CR1 EQU 0x40005881
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_CR2
CYDEV_ANAIF_CFG_DSM0_CR2 EQU 0x40005882
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_CR3
CYDEV_ANAIF_CFG_DSM0_CR3 EQU 0x40005883
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_CR4
CYDEV_ANAIF_CFG_DSM0_CR4 EQU 0x40005884
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_CR5
CYDEV_ANAIF_CFG_DSM0_CR5 EQU 0x40005885
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_CR6
CYDEV_ANAIF_CFG_DSM0_CR6 EQU 0x40005886
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_CR7
CYDEV_ANAIF_CFG_DSM0_CR7 EQU 0x40005887
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_CR8
CYDEV_ANAIF_CFG_DSM0_CR8 EQU 0x40005888
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_CR9
CYDEV_ANAIF_CFG_DSM0_CR9 EQU 0x40005889
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_CR10
CYDEV_ANAIF_CFG_DSM0_CR10 EQU 0x4000588a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_CR11
CYDEV_ANAIF_CFG_DSM0_CR11 EQU 0x4000588b
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_CR12
CYDEV_ANAIF_CFG_DSM0_CR12 EQU 0x4000588c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_CR13
CYDEV_ANAIF_CFG_DSM0_CR13 EQU 0x4000588d
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_CR14
CYDEV_ANAIF_CFG_DSM0_CR14 EQU 0x4000588e
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_CR15
CYDEV_ANAIF_CFG_DSM0_CR15 EQU 0x4000588f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_CR16
CYDEV_ANAIF_CFG_DSM0_CR16 EQU 0x40005890
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_CR17
CYDEV_ANAIF_CFG_DSM0_CR17 EQU 0x40005891
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_REF0
CYDEV_ANAIF_CFG_DSM0_REF0 EQU 0x40005892
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_REF1
CYDEV_ANAIF_CFG_DSM0_REF1 EQU 0x40005893
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_REF2
CYDEV_ANAIF_CFG_DSM0_REF2 EQU 0x40005894
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_REF3
CYDEV_ANAIF_CFG_DSM0_REF3 EQU 0x40005895
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_DEM0
CYDEV_ANAIF_CFG_DSM0_DEM0 EQU 0x40005896
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_DEM1
CYDEV_ANAIF_CFG_DSM0_DEM1 EQU 0x40005897
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_TST0
CYDEV_ANAIF_CFG_DSM0_TST0 EQU 0x40005898
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_TST1
CYDEV_ANAIF_CFG_DSM0_TST1 EQU 0x40005899
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_BUF0
CYDEV_ANAIF_CFG_DSM0_BUF0 EQU 0x4000589a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_BUF1
CYDEV_ANAIF_CFG_DSM0_BUF1 EQU 0x4000589b
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_BUF2
CYDEV_ANAIF_CFG_DSM0_BUF2 EQU 0x4000589c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_BUF3
CYDEV_ANAIF_CFG_DSM0_BUF3 EQU 0x4000589d
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_MISC
CYDEV_ANAIF_CFG_DSM0_MISC EQU 0x4000589e
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_DSM0_RSVD1
CYDEV_ANAIF_CFG_DSM0_RSVD1 EQU 0x4000589f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR0_BASE
CYDEV_ANAIF_CFG_SAR0_BASE EQU 0x40005900
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR0_SIZE
CYDEV_ANAIF_CFG_SAR0_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR0_CSR0
CYDEV_ANAIF_CFG_SAR0_CSR0 EQU 0x40005900
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR0_CSR1
CYDEV_ANAIF_CFG_SAR0_CSR1 EQU 0x40005901
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR0_CSR2
CYDEV_ANAIF_CFG_SAR0_CSR2 EQU 0x40005902
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR0_CSR3
CYDEV_ANAIF_CFG_SAR0_CSR3 EQU 0x40005903
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR0_CSR4
CYDEV_ANAIF_CFG_SAR0_CSR4 EQU 0x40005904
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR0_CSR5
CYDEV_ANAIF_CFG_SAR0_CSR5 EQU 0x40005905
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR0_CSR6
CYDEV_ANAIF_CFG_SAR0_CSR6 EQU 0x40005906
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR0_CSR7
CYDEV_ANAIF_CFG_SAR0_CSR7 EQU 0x40005907
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR1_BASE
CYDEV_ANAIF_CFG_SAR1_BASE EQU 0x40005908
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR1_SIZE
CYDEV_ANAIF_CFG_SAR1_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR1_CSR0
CYDEV_ANAIF_CFG_SAR1_CSR0 EQU 0x40005908
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR1_CSR1
CYDEV_ANAIF_CFG_SAR1_CSR1 EQU 0x40005909
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR1_CSR2
CYDEV_ANAIF_CFG_SAR1_CSR2 EQU 0x4000590a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR1_CSR3
CYDEV_ANAIF_CFG_SAR1_CSR3 EQU 0x4000590b
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR1_CSR4
CYDEV_ANAIF_CFG_SAR1_CSR4 EQU 0x4000590c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR1_CSR5
CYDEV_ANAIF_CFG_SAR1_CSR5 EQU 0x4000590d
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR1_CSR6
CYDEV_ANAIF_CFG_SAR1_CSR6 EQU 0x4000590e
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_CFG_SAR1_CSR7
CYDEV_ANAIF_CFG_SAR1_CSR7 EQU 0x4000590f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_BASE
CYDEV_ANAIF_RT_BASE EQU 0x40005a00
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SIZE
CYDEV_ANAIF_RT_SIZE EQU 0x00000160
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC0_BASE
CYDEV_ANAIF_RT_SC0_BASE EQU 0x40005a00
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC0_SIZE
CYDEV_ANAIF_RT_SC0_SIZE EQU 0x0000000d
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC0_SW0
CYDEV_ANAIF_RT_SC0_SW0 EQU 0x40005a00
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC0_SW2
CYDEV_ANAIF_RT_SC0_SW2 EQU 0x40005a02
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC0_SW3
CYDEV_ANAIF_RT_SC0_SW3 EQU 0x40005a03
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC0_SW4
CYDEV_ANAIF_RT_SC0_SW4 EQU 0x40005a04
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC0_SW6
CYDEV_ANAIF_RT_SC0_SW6 EQU 0x40005a06
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC0_SW7
CYDEV_ANAIF_RT_SC0_SW7 EQU 0x40005a07
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC0_SW8
CYDEV_ANAIF_RT_SC0_SW8 EQU 0x40005a08
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC0_SW10
CYDEV_ANAIF_RT_SC0_SW10 EQU 0x40005a0a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC0_CLK
CYDEV_ANAIF_RT_SC0_CLK EQU 0x40005a0b
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC0_BST
CYDEV_ANAIF_RT_SC0_BST EQU 0x40005a0c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC1_BASE
CYDEV_ANAIF_RT_SC1_BASE EQU 0x40005a10
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC1_SIZE
CYDEV_ANAIF_RT_SC1_SIZE EQU 0x0000000d
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC1_SW0
CYDEV_ANAIF_RT_SC1_SW0 EQU 0x40005a10
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC1_SW2
CYDEV_ANAIF_RT_SC1_SW2 EQU 0x40005a12
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC1_SW3
CYDEV_ANAIF_RT_SC1_SW3 EQU 0x40005a13
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC1_SW4
CYDEV_ANAIF_RT_SC1_SW4 EQU 0x40005a14
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC1_SW6
CYDEV_ANAIF_RT_SC1_SW6 EQU 0x40005a16
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC1_SW7
CYDEV_ANAIF_RT_SC1_SW7 EQU 0x40005a17
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC1_SW8
CYDEV_ANAIF_RT_SC1_SW8 EQU 0x40005a18
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC1_SW10
CYDEV_ANAIF_RT_SC1_SW10 EQU 0x40005a1a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC1_CLK
CYDEV_ANAIF_RT_SC1_CLK EQU 0x40005a1b
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC1_BST
CYDEV_ANAIF_RT_SC1_BST EQU 0x40005a1c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC2_BASE
CYDEV_ANAIF_RT_SC2_BASE EQU 0x40005a20
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC2_SIZE
CYDEV_ANAIF_RT_SC2_SIZE EQU 0x0000000d
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC2_SW0
CYDEV_ANAIF_RT_SC2_SW0 EQU 0x40005a20
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC2_SW2
CYDEV_ANAIF_RT_SC2_SW2 EQU 0x40005a22
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC2_SW3
CYDEV_ANAIF_RT_SC2_SW3 EQU 0x40005a23
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC2_SW4
CYDEV_ANAIF_RT_SC2_SW4 EQU 0x40005a24
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC2_SW6
CYDEV_ANAIF_RT_SC2_SW6 EQU 0x40005a26
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC2_SW7
CYDEV_ANAIF_RT_SC2_SW7 EQU 0x40005a27
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC2_SW8
CYDEV_ANAIF_RT_SC2_SW8 EQU 0x40005a28
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC2_SW10
CYDEV_ANAIF_RT_SC2_SW10 EQU 0x40005a2a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC2_CLK
CYDEV_ANAIF_RT_SC2_CLK EQU 0x40005a2b
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC2_BST
CYDEV_ANAIF_RT_SC2_BST EQU 0x40005a2c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC3_BASE
CYDEV_ANAIF_RT_SC3_BASE EQU 0x40005a30
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC3_SIZE
CYDEV_ANAIF_RT_SC3_SIZE EQU 0x0000000d
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC3_SW0
CYDEV_ANAIF_RT_SC3_SW0 EQU 0x40005a30
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC3_SW2
CYDEV_ANAIF_RT_SC3_SW2 EQU 0x40005a32
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC3_SW3
CYDEV_ANAIF_RT_SC3_SW3 EQU 0x40005a33
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC3_SW4
CYDEV_ANAIF_RT_SC3_SW4 EQU 0x40005a34
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC3_SW6
CYDEV_ANAIF_RT_SC3_SW6 EQU 0x40005a36
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC3_SW7
CYDEV_ANAIF_RT_SC3_SW7 EQU 0x40005a37
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC3_SW8
CYDEV_ANAIF_RT_SC3_SW8 EQU 0x40005a38
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC3_SW10
CYDEV_ANAIF_RT_SC3_SW10 EQU 0x40005a3a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC3_CLK
CYDEV_ANAIF_RT_SC3_CLK EQU 0x40005a3b
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC3_BST
CYDEV_ANAIF_RT_SC3_BST EQU 0x40005a3c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC0_BASE
CYDEV_ANAIF_RT_DAC0_BASE EQU 0x40005a80
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC0_SIZE
CYDEV_ANAIF_RT_DAC0_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC0_SW0
CYDEV_ANAIF_RT_DAC0_SW0 EQU 0x40005a80
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC0_SW2
CYDEV_ANAIF_RT_DAC0_SW2 EQU 0x40005a82
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC0_SW3
CYDEV_ANAIF_RT_DAC0_SW3 EQU 0x40005a83
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC0_SW4
CYDEV_ANAIF_RT_DAC0_SW4 EQU 0x40005a84
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC0_STROBE
CYDEV_ANAIF_RT_DAC0_STROBE EQU 0x40005a87
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC1_BASE
CYDEV_ANAIF_RT_DAC1_BASE EQU 0x40005a88
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC1_SIZE
CYDEV_ANAIF_RT_DAC1_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC1_SW0
CYDEV_ANAIF_RT_DAC1_SW0 EQU 0x40005a88
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC1_SW2
CYDEV_ANAIF_RT_DAC1_SW2 EQU 0x40005a8a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC1_SW3
CYDEV_ANAIF_RT_DAC1_SW3 EQU 0x40005a8b
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC1_SW4
CYDEV_ANAIF_RT_DAC1_SW4 EQU 0x40005a8c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC1_STROBE
CYDEV_ANAIF_RT_DAC1_STROBE EQU 0x40005a8f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC2_BASE
CYDEV_ANAIF_RT_DAC2_BASE EQU 0x40005a90
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC2_SIZE
CYDEV_ANAIF_RT_DAC2_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC2_SW0
CYDEV_ANAIF_RT_DAC2_SW0 EQU 0x40005a90
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC2_SW2
CYDEV_ANAIF_RT_DAC2_SW2 EQU 0x40005a92
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC2_SW3
CYDEV_ANAIF_RT_DAC2_SW3 EQU 0x40005a93
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC2_SW4
CYDEV_ANAIF_RT_DAC2_SW4 EQU 0x40005a94
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC2_STROBE
CYDEV_ANAIF_RT_DAC2_STROBE EQU 0x40005a97
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC3_BASE
CYDEV_ANAIF_RT_DAC3_BASE EQU 0x40005a98
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC3_SIZE
CYDEV_ANAIF_RT_DAC3_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC3_SW0
CYDEV_ANAIF_RT_DAC3_SW0 EQU 0x40005a98
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC3_SW2
CYDEV_ANAIF_RT_DAC3_SW2 EQU 0x40005a9a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC3_SW3
CYDEV_ANAIF_RT_DAC3_SW3 EQU 0x40005a9b
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC3_SW4
CYDEV_ANAIF_RT_DAC3_SW4 EQU 0x40005a9c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DAC3_STROBE
CYDEV_ANAIF_RT_DAC3_STROBE EQU 0x40005a9f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP0_BASE
CYDEV_ANAIF_RT_CMP0_BASE EQU 0x40005ac0
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP0_SIZE
CYDEV_ANAIF_RT_CMP0_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP0_SW0
CYDEV_ANAIF_RT_CMP0_SW0 EQU 0x40005ac0
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP0_SW2
CYDEV_ANAIF_RT_CMP0_SW2 EQU 0x40005ac2
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP0_SW3
CYDEV_ANAIF_RT_CMP0_SW3 EQU 0x40005ac3
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP0_SW4
CYDEV_ANAIF_RT_CMP0_SW4 EQU 0x40005ac4
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP0_SW6
CYDEV_ANAIF_RT_CMP0_SW6 EQU 0x40005ac6
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP0_CLK
CYDEV_ANAIF_RT_CMP0_CLK EQU 0x40005ac7
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP1_BASE
CYDEV_ANAIF_RT_CMP1_BASE EQU 0x40005ac8
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP1_SIZE
CYDEV_ANAIF_RT_CMP1_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP1_SW0
CYDEV_ANAIF_RT_CMP1_SW0 EQU 0x40005ac8
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP1_SW2
CYDEV_ANAIF_RT_CMP1_SW2 EQU 0x40005aca
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP1_SW3
CYDEV_ANAIF_RT_CMP1_SW3 EQU 0x40005acb
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP1_SW4
CYDEV_ANAIF_RT_CMP1_SW4 EQU 0x40005acc
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP1_SW6
CYDEV_ANAIF_RT_CMP1_SW6 EQU 0x40005ace
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP1_CLK
CYDEV_ANAIF_RT_CMP1_CLK EQU 0x40005acf
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP2_BASE
CYDEV_ANAIF_RT_CMP2_BASE EQU 0x40005ad0
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP2_SIZE
CYDEV_ANAIF_RT_CMP2_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP2_SW0
CYDEV_ANAIF_RT_CMP2_SW0 EQU 0x40005ad0
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP2_SW2
CYDEV_ANAIF_RT_CMP2_SW2 EQU 0x40005ad2
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP2_SW3
CYDEV_ANAIF_RT_CMP2_SW3 EQU 0x40005ad3
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP2_SW4
CYDEV_ANAIF_RT_CMP2_SW4 EQU 0x40005ad4
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP2_SW6
CYDEV_ANAIF_RT_CMP2_SW6 EQU 0x40005ad6
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP2_CLK
CYDEV_ANAIF_RT_CMP2_CLK EQU 0x40005ad7
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP3_BASE
CYDEV_ANAIF_RT_CMP3_BASE EQU 0x40005ad8
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP3_SIZE
CYDEV_ANAIF_RT_CMP3_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP3_SW0
CYDEV_ANAIF_RT_CMP3_SW0 EQU 0x40005ad8
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP3_SW2
CYDEV_ANAIF_RT_CMP3_SW2 EQU 0x40005ada
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP3_SW3
CYDEV_ANAIF_RT_CMP3_SW3 EQU 0x40005adb
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP3_SW4
CYDEV_ANAIF_RT_CMP3_SW4 EQU 0x40005adc
