MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv.inc
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP3_SW6
CYDEV_ANAIF_RT_CMP3_SW6 EQU 0x40005ade
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_CMP3_CLK
CYDEV_ANAIF_RT_CMP3_CLK EQU 0x40005adf
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DSM0_BASE
CYDEV_ANAIF_RT_DSM0_BASE EQU 0x40005b00
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DSM0_SIZE
CYDEV_ANAIF_RT_DSM0_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DSM0_SW0
CYDEV_ANAIF_RT_DSM0_SW0 EQU 0x40005b00
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DSM0_SW2
CYDEV_ANAIF_RT_DSM0_SW2 EQU 0x40005b02
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DSM0_SW3
CYDEV_ANAIF_RT_DSM0_SW3 EQU 0x40005b03
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DSM0_SW4
CYDEV_ANAIF_RT_DSM0_SW4 EQU 0x40005b04
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DSM0_SW6
CYDEV_ANAIF_RT_DSM0_SW6 EQU 0x40005b06
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DSM0_CLK
CYDEV_ANAIF_RT_DSM0_CLK EQU 0x40005b07
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SAR0_BASE
CYDEV_ANAIF_RT_SAR0_BASE EQU 0x40005b20
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SAR0_SIZE
CYDEV_ANAIF_RT_SAR0_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SAR0_SW0
CYDEV_ANAIF_RT_SAR0_SW0 EQU 0x40005b20
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SAR0_SW2
CYDEV_ANAIF_RT_SAR0_SW2 EQU 0x40005b22
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SAR0_SW3
CYDEV_ANAIF_RT_SAR0_SW3 EQU 0x40005b23
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SAR0_SW4
CYDEV_ANAIF_RT_SAR0_SW4 EQU 0x40005b24
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SAR0_SW6
CYDEV_ANAIF_RT_SAR0_SW6 EQU 0x40005b26
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SAR0_CLK
CYDEV_ANAIF_RT_SAR0_CLK EQU 0x40005b27
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SAR1_BASE
CYDEV_ANAIF_RT_SAR1_BASE EQU 0x40005b28
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SAR1_SIZE
CYDEV_ANAIF_RT_SAR1_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SAR1_SW0
CYDEV_ANAIF_RT_SAR1_SW0 EQU 0x40005b28
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SAR1_SW2
CYDEV_ANAIF_RT_SAR1_SW2 EQU 0x40005b2a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SAR1_SW3
CYDEV_ANAIF_RT_SAR1_SW3 EQU 0x40005b2b
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SAR1_SW4
CYDEV_ANAIF_RT_SAR1_SW4 EQU 0x40005b2c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SAR1_SW6
CYDEV_ANAIF_RT_SAR1_SW6 EQU 0x40005b2e
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SAR1_CLK
CYDEV_ANAIF_RT_SAR1_CLK EQU 0x40005b2f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF0_BASE
CYDEV_ANAIF_RT_ABUF0_BASE EQU 0x40005b40
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF0_SIZE
CYDEV_ANAIF_RT_ABUF0_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF0_MX
CYDEV_ANAIF_RT_ABUF0_MX EQU 0x40005b40
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF0_SW
CYDEV_ANAIF_RT_ABUF0_SW EQU 0x40005b41
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF1_BASE
CYDEV_ANAIF_RT_ABUF1_BASE EQU 0x40005b42
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF1_SIZE
CYDEV_ANAIF_RT_ABUF1_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF1_MX
CYDEV_ANAIF_RT_ABUF1_MX EQU 0x40005b42
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF1_SW
CYDEV_ANAIF_RT_ABUF1_SW EQU 0x40005b43
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF2_BASE
CYDEV_ANAIF_RT_ABUF2_BASE EQU 0x40005b44
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF2_SIZE
CYDEV_ANAIF_RT_ABUF2_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF2_MX
CYDEV_ANAIF_RT_ABUF2_MX EQU 0x40005b44
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF2_SW
CYDEV_ANAIF_RT_ABUF2_SW EQU 0x40005b45
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF3_BASE
CYDEV_ANAIF_RT_ABUF3_BASE EQU 0x40005b46
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF3_SIZE
CYDEV_ANAIF_RT_ABUF3_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF3_MX
CYDEV_ANAIF_RT_ABUF3_MX EQU 0x40005b46
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_ABUF3_SW
CYDEV_ANAIF_RT_ABUF3_SW EQU 0x40005b47
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_LCDDAC_BASE
CYDEV_ANAIF_RT_LCDDAC_BASE EQU 0x40005b50
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_LCDDAC_SIZE
CYDEV_ANAIF_RT_LCDDAC_SIZE EQU 0x00000005
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_LCDDAC_SW0
CYDEV_ANAIF_RT_LCDDAC_SW0 EQU 0x40005b50
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_LCDDAC_SW1
CYDEV_ANAIF_RT_LCDDAC_SW1 EQU 0x40005b51
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_LCDDAC_SW2
CYDEV_ANAIF_RT_LCDDAC_SW2 EQU 0x40005b52
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_LCDDAC_SW3
CYDEV_ANAIF_RT_LCDDAC_SW3 EQU 0x40005b53
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_LCDDAC_SW4
CYDEV_ANAIF_RT_LCDDAC_SW4 EQU 0x40005b54
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC_BASE
CYDEV_ANAIF_RT_SC_BASE EQU 0x40005b56
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC_SIZE
CYDEV_ANAIF_RT_SC_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_SC_MISC
CYDEV_ANAIF_RT_SC_MISC EQU 0x40005b56
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_BUS_BASE
CYDEV_ANAIF_RT_BUS_BASE EQU 0x40005b58
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_BUS_SIZE
CYDEV_ANAIF_RT_BUS_SIZE EQU 0x00000004
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_BUS_SW0
CYDEV_ANAIF_RT_BUS_SW0 EQU 0x40005b58
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_BUS_SW2
CYDEV_ANAIF_RT_BUS_SW2 EQU 0x40005b5a
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_BUS_SW3
CYDEV_ANAIF_RT_BUS_SW3 EQU 0x40005b5b
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DFT_BASE
CYDEV_ANAIF_RT_DFT_BASE EQU 0x40005b5c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DFT_SIZE
CYDEV_ANAIF_RT_DFT_SIZE EQU 0x00000004
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DFT_CR0
CYDEV_ANAIF_RT_DFT_CR0 EQU 0x40005b5c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DFT_CR1
CYDEV_ANAIF_RT_DFT_CR1 EQU 0x40005b5d
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DFT_CR2
CYDEV_ANAIF_RT_DFT_CR2 EQU 0x40005b5e
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_RT_DFT_CR3
CYDEV_ANAIF_RT_DFT_CR3 EQU 0x40005b5f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_BASE
CYDEV_ANAIF_WRK_BASE EQU 0x40005b80
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SIZE
CYDEV_ANAIF_WRK_SIZE EQU 0x00000029
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DAC0_BASE
CYDEV_ANAIF_WRK_DAC0_BASE EQU 0x40005b80
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DAC0_SIZE
CYDEV_ANAIF_WRK_DAC0_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DAC0_D
CYDEV_ANAIF_WRK_DAC0_D EQU 0x40005b80
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DAC1_BASE
CYDEV_ANAIF_WRK_DAC1_BASE EQU 0x40005b81
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DAC1_SIZE
CYDEV_ANAIF_WRK_DAC1_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DAC1_D
CYDEV_ANAIF_WRK_DAC1_D EQU 0x40005b81
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DAC2_BASE
CYDEV_ANAIF_WRK_DAC2_BASE EQU 0x40005b82
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DAC2_SIZE
CYDEV_ANAIF_WRK_DAC2_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DAC2_D
CYDEV_ANAIF_WRK_DAC2_D EQU 0x40005b82
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DAC3_BASE
CYDEV_ANAIF_WRK_DAC3_BASE EQU 0x40005b83
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DAC3_SIZE
CYDEV_ANAIF_WRK_DAC3_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DAC3_D
CYDEV_ANAIF_WRK_DAC3_D EQU 0x40005b83
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DSM0_BASE
CYDEV_ANAIF_WRK_DSM0_BASE EQU 0x40005b88
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DSM0_SIZE
CYDEV_ANAIF_WRK_DSM0_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DSM0_OUT0
CYDEV_ANAIF_WRK_DSM0_OUT0 EQU 0x40005b88
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_DSM0_OUT1
CYDEV_ANAIF_WRK_DSM0_OUT1 EQU 0x40005b89
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SC_BASE
CYDEV_ANAIF_WRK_SC_BASE EQU 0x40005b8c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SC_SIZE
CYDEV_ANAIF_WRK_SC_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SC_SR
CYDEV_ANAIF_WRK_SC_SR EQU 0x40005b8c
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SC_MSK
CYDEV_ANAIF_WRK_SC_MSK EQU 0x40005b8d
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_LUT_BASE
CYDEV_ANAIF_WRK_LUT_BASE EQU 0x40005b8e
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_LUT_SIZE
CYDEV_ANAIF_WRK_LUT_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_LUT_SR
CYDEV_ANAIF_WRK_LUT_SR EQU 0x40005b8e
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_LUT_MSK
CYDEV_ANAIF_WRK_LUT_MSK EQU 0x40005b8f
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_CMP_BASE
CYDEV_ANAIF_WRK_CMP_BASE EQU 0x40005b90
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_CMP_SIZE
CYDEV_ANAIF_WRK_CMP_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_CMP_WRK
CYDEV_ANAIF_WRK_CMP_WRK EQU 0x40005b90
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_CMP_LTRI
CYDEV_ANAIF_WRK_CMP_LTRI EQU 0x40005b91
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_TFAULT_BASE
CYDEV_ANAIF_WRK_TFAULT_BASE EQU 0x40005b92
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_TFAULT_SIZE
CYDEV_ANAIF_WRK_TFAULT_SIZE EQU 0x00000004
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_TFAULT_WRK0
CYDEV_ANAIF_WRK_TFAULT_WRK0 EQU 0x40005b92
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_TFAULT_WRK1
CYDEV_ANAIF_WRK_TFAULT_WRK1 EQU 0x40005b93
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_TFAULT_WRK2
CYDEV_ANAIF_WRK_TFAULT_WRK2 EQU 0x40005b94
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_TFAULT_WRK3
CYDEV_ANAIF_WRK_TFAULT_WRK3 EQU 0x40005b95
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SAR0_BASE
CYDEV_ANAIF_WRK_SAR0_BASE EQU 0x40005ba0
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SAR0_SIZE
CYDEV_ANAIF_WRK_SAR0_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SAR0_WRK0
CYDEV_ANAIF_WRK_SAR0_WRK0 EQU 0x40005ba0
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SAR0_WRK1
CYDEV_ANAIF_WRK_SAR0_WRK1 EQU 0x40005ba1
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SAR1_BASE
CYDEV_ANAIF_WRK_SAR1_BASE EQU 0x40005ba2
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SAR1_SIZE
CYDEV_ANAIF_WRK_SAR1_SIZE EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SAR1_WRK0
CYDEV_ANAIF_WRK_SAR1_WRK0 EQU 0x40005ba2
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SAR1_WRK1
CYDEV_ANAIF_WRK_SAR1_WRK1 EQU 0x40005ba3
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SARS_BASE
CYDEV_ANAIF_WRK_SARS_BASE EQU 0x40005ba8
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SARS_SIZE
CYDEV_ANAIF_WRK_SARS_SIZE EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYDEV_ANAIF_WRK_SARS_SOF
CYDEV_ANAIF_WRK_SARS_SOF EQU 0x40005ba8
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_BASE
CYDEV_USB_BASE EQU 0x40006000
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIZE
CYDEV_USB_SIZE EQU 0x00000300
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_EP0_DR0
CYDEV_USB_EP0_DR0 EQU 0x40006000
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_EP0_DR1
CYDEV_USB_EP0_DR1 EQU 0x40006001
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_EP0_DR2
CYDEV_USB_EP0_DR2 EQU 0x40006002
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_EP0_DR3
CYDEV_USB_EP0_DR3 EQU 0x40006003
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_EP0_DR4
CYDEV_USB_EP0_DR4 EQU 0x40006004
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_EP0_DR5
CYDEV_USB_EP0_DR5 EQU 0x40006005
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_EP0_DR6
CYDEV_USB_EP0_DR6 EQU 0x40006006
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_EP0_DR7
CYDEV_USB_EP0_DR7 EQU 0x40006007
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_CR0
CYDEV_USB_CR0 EQU 0x40006008
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_CR1
CYDEV_USB_CR1 EQU 0x40006009
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP_INT_EN
CYDEV_USB_SIE_EP_INT_EN EQU 0x4000600a
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP_INT_SR
CYDEV_USB_SIE_EP_INT_SR EQU 0x4000600b
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP1_BASE
CYDEV_USB_SIE_EP1_BASE EQU 0x4000600c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP1_SIZE
CYDEV_USB_SIE_EP1_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP1_CNT0
CYDEV_USB_SIE_EP1_CNT0 EQU 0x4000600c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP1_CNT1
CYDEV_USB_SIE_EP1_CNT1 EQU 0x4000600d
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP1_CR0
CYDEV_USB_SIE_EP1_CR0 EQU 0x4000600e
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_USBIO_CR0
CYDEV_USB_USBIO_CR0 EQU 0x40006010
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_USBIO_CR2
CYDEV_USB_USBIO_CR2 EQU 0x40006011
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_USBIO_CR1
CYDEV_USB_USBIO_CR1 EQU 0x40006012
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SOF0
CYDEV_USB_SOF0 EQU 0x40006018
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SOF1
CYDEV_USB_SOF1 EQU 0x40006019
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP2_BASE
CYDEV_USB_SIE_EP2_BASE EQU 0x4000601c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP2_SIZE
CYDEV_USB_SIE_EP2_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP2_CNT0
CYDEV_USB_SIE_EP2_CNT0 EQU 0x4000601c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP2_CNT1
CYDEV_USB_SIE_EP2_CNT1 EQU 0x4000601d
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP2_CR0
CYDEV_USB_SIE_EP2_CR0 EQU 0x4000601e
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_OSCLK_DR0
CYDEV_USB_OSCLK_DR0 EQU 0x40006020
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_OSCLK_DR1
CYDEV_USB_OSCLK_DR1 EQU 0x40006021
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_EP0_CR
CYDEV_USB_EP0_CR EQU 0x40006028
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_EP0_CNT
CYDEV_USB_EP0_CNT EQU 0x40006029
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP3_BASE
CYDEV_USB_SIE_EP3_BASE EQU 0x4000602c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP3_SIZE
CYDEV_USB_SIE_EP3_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP3_CNT0
CYDEV_USB_SIE_EP3_CNT0 EQU 0x4000602c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP3_CNT1
CYDEV_USB_SIE_EP3_CNT1 EQU 0x4000602d
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP3_CR0
CYDEV_USB_SIE_EP3_CR0 EQU 0x4000602e
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP4_BASE
CYDEV_USB_SIE_EP4_BASE EQU 0x4000603c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP4_SIZE
CYDEV_USB_SIE_EP4_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP4_CNT0
CYDEV_USB_SIE_EP4_CNT0 EQU 0x4000603c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP4_CNT1
CYDEV_USB_SIE_EP4_CNT1 EQU 0x4000603d
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP4_CR0
CYDEV_USB_SIE_EP4_CR0 EQU 0x4000603e
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP5_BASE
CYDEV_USB_SIE_EP5_BASE EQU 0x4000604c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP5_SIZE
CYDEV_USB_SIE_EP5_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP5_CNT0
CYDEV_USB_SIE_EP5_CNT0 EQU 0x4000604c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP5_CNT1
CYDEV_USB_SIE_EP5_CNT1 EQU 0x4000604d
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP5_CR0
CYDEV_USB_SIE_EP5_CR0 EQU 0x4000604e
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP6_BASE
CYDEV_USB_SIE_EP6_BASE EQU 0x4000605c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP6_SIZE
CYDEV_USB_SIE_EP6_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP6_CNT0
CYDEV_USB_SIE_EP6_CNT0 EQU 0x4000605c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP6_CNT1
CYDEV_USB_SIE_EP6_CNT1 EQU 0x4000605d
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP6_CR0
CYDEV_USB_SIE_EP6_CR0 EQU 0x4000605e
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP7_BASE
CYDEV_USB_SIE_EP7_BASE EQU 0x4000606c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP7_SIZE
CYDEV_USB_SIE_EP7_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP7_CNT0
CYDEV_USB_SIE_EP7_CNT0 EQU 0x4000606c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP7_CNT1
CYDEV_USB_SIE_EP7_CNT1 EQU 0x4000606d
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP7_CR0
CYDEV_USB_SIE_EP7_CR0 EQU 0x4000606e
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP8_BASE
CYDEV_USB_SIE_EP8_BASE EQU 0x4000607c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP8_SIZE
CYDEV_USB_SIE_EP8_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP8_CNT0
CYDEV_USB_SIE_EP8_CNT0 EQU 0x4000607c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP8_CNT1
CYDEV_USB_SIE_EP8_CNT1 EQU 0x4000607d
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_SIE_EP8_CR0
CYDEV_USB_SIE_EP8_CR0 EQU 0x4000607e
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP1_BASE
CYDEV_USB_ARB_EP1_BASE EQU 0x40006080
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP1_SIZE
CYDEV_USB_ARB_EP1_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP1_CFG
CYDEV_USB_ARB_EP1_CFG EQU 0x40006080
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP1_INT_EN
CYDEV_USB_ARB_EP1_INT_EN EQU 0x40006081
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP1_SR
CYDEV_USB_ARB_EP1_SR EQU 0x40006082
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW1_BASE
CYDEV_USB_ARB_RW1_BASE EQU 0x40006084
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW1_SIZE
CYDEV_USB_ARB_RW1_SIZE EQU 0x00000005
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW1_WA
CYDEV_USB_ARB_RW1_WA EQU 0x40006084
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW1_WA_MSB
CYDEV_USB_ARB_RW1_WA_MSB EQU 0x40006085
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW1_RA
CYDEV_USB_ARB_RW1_RA EQU 0x40006086
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW1_RA_MSB
CYDEV_USB_ARB_RW1_RA_MSB EQU 0x40006087
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW1_DR
CYDEV_USB_ARB_RW1_DR EQU 0x40006088
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_BUF_SIZE
CYDEV_USB_BUF_SIZE EQU 0x4000608c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_EP_ACTIVE
CYDEV_USB_EP_ACTIVE EQU 0x4000608e
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_EP_TYPE
CYDEV_USB_EP_TYPE EQU 0x4000608f
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP2_BASE
CYDEV_USB_ARB_EP2_BASE EQU 0x40006090
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP2_SIZE
CYDEV_USB_ARB_EP2_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP2_CFG
CYDEV_USB_ARB_EP2_CFG EQU 0x40006090
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP2_INT_EN
CYDEV_USB_ARB_EP2_INT_EN EQU 0x40006091
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP2_SR
CYDEV_USB_ARB_EP2_SR EQU 0x40006092
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW2_BASE
CYDEV_USB_ARB_RW2_BASE EQU 0x40006094
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW2_SIZE
CYDEV_USB_ARB_RW2_SIZE EQU 0x00000005
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW2_WA
CYDEV_USB_ARB_RW2_WA EQU 0x40006094
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW2_WA_MSB
CYDEV_USB_ARB_RW2_WA_MSB EQU 0x40006095
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW2_RA
CYDEV_USB_ARB_RW2_RA EQU 0x40006096
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW2_RA_MSB
CYDEV_USB_ARB_RW2_RA_MSB EQU 0x40006097
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW2_DR
CYDEV_USB_ARB_RW2_DR EQU 0x40006098
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_CFG
CYDEV_USB_ARB_CFG EQU 0x4000609c
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_USB_CLK_EN
CYDEV_USB_USB_CLK_EN EQU 0x4000609d
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_INT_EN
CYDEV_USB_ARB_INT_EN EQU 0x4000609e
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_INT_SR
CYDEV_USB_ARB_INT_SR EQU 0x4000609f
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP3_BASE
CYDEV_USB_ARB_EP3_BASE EQU 0x400060a0
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP3_SIZE
CYDEV_USB_ARB_EP3_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP3_CFG
CYDEV_USB_ARB_EP3_CFG EQU 0x400060a0
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP3_INT_EN
CYDEV_USB_ARB_EP3_INT_EN EQU 0x400060a1
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP3_SR
CYDEV_USB_ARB_EP3_SR EQU 0x400060a2
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW3_BASE
CYDEV_USB_ARB_RW3_BASE EQU 0x400060a4
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW3_SIZE
CYDEV_USB_ARB_RW3_SIZE EQU 0x00000005
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW3_WA
CYDEV_USB_ARB_RW3_WA EQU 0x400060a4
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW3_WA_MSB
CYDEV_USB_ARB_RW3_WA_MSB EQU 0x400060a5
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW3_RA
CYDEV_USB_ARB_RW3_RA EQU 0x400060a6
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW3_RA_MSB
CYDEV_USB_ARB_RW3_RA_MSB EQU 0x400060a7
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW3_DR
CYDEV_USB_ARB_RW3_DR EQU 0x400060a8
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_CWA
CYDEV_USB_CWA EQU 0x400060ac
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_CWA_MSB
CYDEV_USB_CWA_MSB EQU 0x400060ad
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP4_BASE
CYDEV_USB_ARB_EP4_BASE EQU 0x400060b0
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP4_SIZE
CYDEV_USB_ARB_EP4_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP4_CFG
CYDEV_USB_ARB_EP4_CFG EQU 0x400060b0
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP4_INT_EN
CYDEV_USB_ARB_EP4_INT_EN EQU 0x400060b1
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP4_SR
CYDEV_USB_ARB_EP4_SR EQU 0x400060b2
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW4_BASE
CYDEV_USB_ARB_RW4_BASE EQU 0x400060b4
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW4_SIZE
CYDEV_USB_ARB_RW4_SIZE EQU 0x00000005
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW4_WA
CYDEV_USB_ARB_RW4_WA EQU 0x400060b4
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW4_WA_MSB
CYDEV_USB_ARB_RW4_WA_MSB EQU 0x400060b5
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW4_RA
CYDEV_USB_ARB_RW4_RA EQU 0x400060b6
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW4_RA_MSB
CYDEV_USB_ARB_RW4_RA_MSB EQU 0x400060b7
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW4_DR
CYDEV_USB_ARB_RW4_DR EQU 0x400060b8
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_DMA_THRES
CYDEV_USB_DMA_THRES EQU 0x400060bc
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_DMA_THRES_MSB
CYDEV_USB_DMA_THRES_MSB EQU 0x400060bd
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP5_BASE
CYDEV_USB_ARB_EP5_BASE EQU 0x400060c0
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP5_SIZE
CYDEV_USB_ARB_EP5_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP5_CFG
CYDEV_USB_ARB_EP5_CFG EQU 0x400060c0
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP5_INT_EN
CYDEV_USB_ARB_EP5_INT_EN EQU 0x400060c1
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP5_SR
CYDEV_USB_ARB_EP5_SR EQU 0x400060c2
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW5_BASE
CYDEV_USB_ARB_RW5_BASE EQU 0x400060c4
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW5_SIZE
CYDEV_USB_ARB_RW5_SIZE EQU 0x00000005
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW5_WA
CYDEV_USB_ARB_RW5_WA EQU 0x400060c4
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW5_WA_MSB
CYDEV_USB_ARB_RW5_WA_MSB EQU 0x400060c5
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW5_RA
CYDEV_USB_ARB_RW5_RA EQU 0x400060c6
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW5_RA_MSB
CYDEV_USB_ARB_RW5_RA_MSB EQU 0x400060c7
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW5_DR
CYDEV_USB_ARB_RW5_DR EQU 0x400060c8
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_BUS_RST_CNT
CYDEV_USB_BUS_RST_CNT EQU 0x400060cc
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP6_BASE
CYDEV_USB_ARB_EP6_BASE EQU 0x400060d0
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP6_SIZE
CYDEV_USB_ARB_EP6_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP6_CFG
CYDEV_USB_ARB_EP6_CFG EQU 0x400060d0
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP6_INT_EN
CYDEV_USB_ARB_EP6_INT_EN EQU 0x400060d1
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP6_SR
CYDEV_USB_ARB_EP6_SR EQU 0x400060d2
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW6_BASE
CYDEV_USB_ARB_RW6_BASE EQU 0x400060d4
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW6_SIZE
CYDEV_USB_ARB_RW6_SIZE EQU 0x00000005
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW6_WA
CYDEV_USB_ARB_RW6_WA EQU 0x400060d4
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW6_WA_MSB
CYDEV_USB_ARB_RW6_WA_MSB EQU 0x400060d5
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW6_RA
CYDEV_USB_ARB_RW6_RA EQU 0x400060d6
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW6_RA_MSB
CYDEV_USB_ARB_RW6_RA_MSB EQU 0x400060d7
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW6_DR
CYDEV_USB_ARB_RW6_DR EQU 0x400060d8
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP7_BASE
CYDEV_USB_ARB_EP7_BASE EQU 0x400060e0
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP7_SIZE
CYDEV_USB_ARB_EP7_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP7_CFG
CYDEV_USB_ARB_EP7_CFG EQU 0x400060e0
    ENDIF
