MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv.inc
    IF :LNOT::DEF:CYDEV_USB_ARB_EP7_INT_EN
CYDEV_USB_ARB_EP7_INT_EN EQU 0x400060e1
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP7_SR
CYDEV_USB_ARB_EP7_SR EQU 0x400060e2
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW7_BASE
CYDEV_USB_ARB_RW7_BASE EQU 0x400060e4
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW7_SIZE
CYDEV_USB_ARB_RW7_SIZE EQU 0x00000005
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW7_WA
CYDEV_USB_ARB_RW7_WA EQU 0x400060e4
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW7_WA_MSB
CYDEV_USB_ARB_RW7_WA_MSB EQU 0x400060e5
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW7_RA
CYDEV_USB_ARB_RW7_RA EQU 0x400060e6
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW7_RA_MSB
CYDEV_USB_ARB_RW7_RA_MSB EQU 0x400060e7
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW7_DR
CYDEV_USB_ARB_RW7_DR EQU 0x400060e8
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP8_BASE
CYDEV_USB_ARB_EP8_BASE EQU 0x400060f0
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP8_SIZE
CYDEV_USB_ARB_EP8_SIZE EQU 0x00000003
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP8_CFG
CYDEV_USB_ARB_EP8_CFG EQU 0x400060f0
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP8_INT_EN
CYDEV_USB_ARB_EP8_INT_EN EQU 0x400060f1
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_EP8_SR
CYDEV_USB_ARB_EP8_SR EQU 0x400060f2
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW8_BASE
CYDEV_USB_ARB_RW8_BASE EQU 0x400060f4
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW8_SIZE
CYDEV_USB_ARB_RW8_SIZE EQU 0x00000005
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW8_WA
CYDEV_USB_ARB_RW8_WA EQU 0x400060f4
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW8_WA_MSB
CYDEV_USB_ARB_RW8_WA_MSB EQU 0x400060f5
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW8_RA
CYDEV_USB_ARB_RW8_RA EQU 0x400060f6
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW8_RA_MSB
CYDEV_USB_ARB_RW8_RA_MSB EQU 0x400060f7
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_ARB_RW8_DR
CYDEV_USB_ARB_RW8_DR EQU 0x400060f8
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_MEM_BASE
CYDEV_USB_MEM_BASE EQU 0x40006100
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_MEM_SIZE
CYDEV_USB_MEM_SIZE EQU 0x00000200
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_MEM_DATA_MBASE
CYDEV_USB_MEM_DATA_MBASE EQU 0x40006100
    ENDIF
    IF :LNOT::DEF:CYDEV_USB_MEM_DATA_MSIZE
CYDEV_USB_MEM_DATA_MSIZE EQU 0x00000200
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_BASE
CYDEV_UWRK_BASE EQU 0x40006400
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_SIZE
CYDEV_UWRK_SIZE EQU 0x00000b60
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_BASE
CYDEV_UWRK_UWRK8_BASE EQU 0x40006400
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_SIZE
CYDEV_UWRK_UWRK8_SIZE EQU 0x000003b0
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_BASE
CYDEV_UWRK_UWRK8_B0_BASE EQU 0x40006400
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_SIZE
CYDEV_UWRK_UWRK8_B0_SIZE EQU 0x000000b0
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB00_A0
CYDEV_UWRK_UWRK8_B0_UDB00_A0 EQU 0x40006400
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB01_A0
CYDEV_UWRK_UWRK8_B0_UDB01_A0 EQU 0x40006401
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB02_A0
CYDEV_UWRK_UWRK8_B0_UDB02_A0 EQU 0x40006402
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB03_A0
CYDEV_UWRK_UWRK8_B0_UDB03_A0 EQU 0x40006403
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB04_A0
CYDEV_UWRK_UWRK8_B0_UDB04_A0 EQU 0x40006404
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB05_A0
CYDEV_UWRK_UWRK8_B0_UDB05_A0 EQU 0x40006405
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB06_A0
CYDEV_UWRK_UWRK8_B0_UDB06_A0 EQU 0x40006406
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB07_A0
CYDEV_UWRK_UWRK8_B0_UDB07_A0 EQU 0x40006407
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB08_A0
CYDEV_UWRK_UWRK8_B0_UDB08_A0 EQU 0x40006408
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB09_A0
CYDEV_UWRK_UWRK8_B0_UDB09_A0 EQU 0x40006409
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB10_A0
CYDEV_UWRK_UWRK8_B0_UDB10_A0 EQU 0x4000640a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB11_A0
CYDEV_UWRK_UWRK8_B0_UDB11_A0 EQU 0x4000640b
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB12_A0
CYDEV_UWRK_UWRK8_B0_UDB12_A0 EQU 0x4000640c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB13_A0
CYDEV_UWRK_UWRK8_B0_UDB13_A0 EQU 0x4000640d
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB14_A0
CYDEV_UWRK_UWRK8_B0_UDB14_A0 EQU 0x4000640e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB15_A0
CYDEV_UWRK_UWRK8_B0_UDB15_A0 EQU 0x4000640f
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB00_A1
CYDEV_UWRK_UWRK8_B0_UDB00_A1 EQU 0x40006410
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB01_A1
CYDEV_UWRK_UWRK8_B0_UDB01_A1 EQU 0x40006411
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB02_A1
CYDEV_UWRK_UWRK8_B0_UDB02_A1 EQU 0x40006412
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB03_A1
CYDEV_UWRK_UWRK8_B0_UDB03_A1 EQU 0x40006413
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB04_A1
CYDEV_UWRK_UWRK8_B0_UDB04_A1 EQU 0x40006414
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB05_A1
CYDEV_UWRK_UWRK8_B0_UDB05_A1 EQU 0x40006415
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB06_A1
CYDEV_UWRK_UWRK8_B0_UDB06_A1 EQU 0x40006416
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB07_A1
CYDEV_UWRK_UWRK8_B0_UDB07_A1 EQU 0x40006417
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB08_A1
CYDEV_UWRK_UWRK8_B0_UDB08_A1 EQU 0x40006418
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB09_A1
CYDEV_UWRK_UWRK8_B0_UDB09_A1 EQU 0x40006419
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB10_A1
CYDEV_UWRK_UWRK8_B0_UDB10_A1 EQU 0x4000641a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB11_A1
CYDEV_UWRK_UWRK8_B0_UDB11_A1 EQU 0x4000641b
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB12_A1
CYDEV_UWRK_UWRK8_B0_UDB12_A1 EQU 0x4000641c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB13_A1
CYDEV_UWRK_UWRK8_B0_UDB13_A1 EQU 0x4000641d
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB14_A1
CYDEV_UWRK_UWRK8_B0_UDB14_A1 EQU 0x4000641e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB15_A1
CYDEV_UWRK_UWRK8_B0_UDB15_A1 EQU 0x4000641f
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB00_D0
CYDEV_UWRK_UWRK8_B0_UDB00_D0 EQU 0x40006420
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB01_D0
CYDEV_UWRK_UWRK8_B0_UDB01_D0 EQU 0x40006421
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB02_D0
CYDEV_UWRK_UWRK8_B0_UDB02_D0 EQU 0x40006422
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB03_D0
CYDEV_UWRK_UWRK8_B0_UDB03_D0 EQU 0x40006423
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB04_D0
CYDEV_UWRK_UWRK8_B0_UDB04_D0 EQU 0x40006424
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB05_D0
CYDEV_UWRK_UWRK8_B0_UDB05_D0 EQU 0x40006425
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB06_D0
CYDEV_UWRK_UWRK8_B0_UDB06_D0 EQU 0x40006426
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB07_D0
CYDEV_UWRK_UWRK8_B0_UDB07_D0 EQU 0x40006427
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB08_D0
CYDEV_UWRK_UWRK8_B0_UDB08_D0 EQU 0x40006428
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB09_D0
CYDEV_UWRK_UWRK8_B0_UDB09_D0 EQU 0x40006429
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB10_D0
CYDEV_UWRK_UWRK8_B0_UDB10_D0 EQU 0x4000642a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB11_D0
CYDEV_UWRK_UWRK8_B0_UDB11_D0 EQU 0x4000642b
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB12_D0
CYDEV_UWRK_UWRK8_B0_UDB12_D0 EQU 0x4000642c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB13_D0
CYDEV_UWRK_UWRK8_B0_UDB13_D0 EQU 0x4000642d
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB14_D0
CYDEV_UWRK_UWRK8_B0_UDB14_D0 EQU 0x4000642e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB15_D0
CYDEV_UWRK_UWRK8_B0_UDB15_D0 EQU 0x4000642f
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB00_D1
CYDEV_UWRK_UWRK8_B0_UDB00_D1 EQU 0x40006430
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB01_D1
CYDEV_UWRK_UWRK8_B0_UDB01_D1 EQU 0x40006431
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB02_D1
CYDEV_UWRK_UWRK8_B0_UDB02_D1 EQU 0x40006432
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB03_D1
CYDEV_UWRK_UWRK8_B0_UDB03_D1 EQU 0x40006433
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB04_D1
CYDEV_UWRK_UWRK8_B0_UDB04_D1 EQU 0x40006434
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB05_D1
CYDEV_UWRK_UWRK8_B0_UDB05_D1 EQU 0x40006435
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB06_D1
CYDEV_UWRK_UWRK8_B0_UDB06_D1 EQU 0x40006436
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB07_D1
CYDEV_UWRK_UWRK8_B0_UDB07_D1 EQU 0x40006437
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB08_D1
CYDEV_UWRK_UWRK8_B0_UDB08_D1 EQU 0x40006438
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB09_D1
CYDEV_UWRK_UWRK8_B0_UDB09_D1 EQU 0x40006439
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB10_D1
CYDEV_UWRK_UWRK8_B0_UDB10_D1 EQU 0x4000643a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB11_D1
CYDEV_UWRK_UWRK8_B0_UDB11_D1 EQU 0x4000643b
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB12_D1
CYDEV_UWRK_UWRK8_B0_UDB12_D1 EQU 0x4000643c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB13_D1
CYDEV_UWRK_UWRK8_B0_UDB13_D1 EQU 0x4000643d
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB14_D1
CYDEV_UWRK_UWRK8_B0_UDB14_D1 EQU 0x4000643e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB15_D1
CYDEV_UWRK_UWRK8_B0_UDB15_D1 EQU 0x4000643f
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB00_F0
CYDEV_UWRK_UWRK8_B0_UDB00_F0 EQU 0x40006440
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB01_F0
CYDEV_UWRK_UWRK8_B0_UDB01_F0 EQU 0x40006441
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB02_F0
CYDEV_UWRK_UWRK8_B0_UDB02_F0 EQU 0x40006442
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB03_F0
CYDEV_UWRK_UWRK8_B0_UDB03_F0 EQU 0x40006443
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB04_F0
CYDEV_UWRK_UWRK8_B0_UDB04_F0 EQU 0x40006444
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB05_F0
CYDEV_UWRK_UWRK8_B0_UDB05_F0 EQU 0x40006445
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB06_F0
CYDEV_UWRK_UWRK8_B0_UDB06_F0 EQU 0x40006446
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB07_F0
CYDEV_UWRK_UWRK8_B0_UDB07_F0 EQU 0x40006447
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB08_F0
CYDEV_UWRK_UWRK8_B0_UDB08_F0 EQU 0x40006448
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB09_F0
CYDEV_UWRK_UWRK8_B0_UDB09_F0 EQU 0x40006449
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB10_F0
CYDEV_UWRK_UWRK8_B0_UDB10_F0 EQU 0x4000644a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB11_F0
CYDEV_UWRK_UWRK8_B0_UDB11_F0 EQU 0x4000644b
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB12_F0
CYDEV_UWRK_UWRK8_B0_UDB12_F0 EQU 0x4000644c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB13_F0
CYDEV_UWRK_UWRK8_B0_UDB13_F0 EQU 0x4000644d
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB14_F0
CYDEV_UWRK_UWRK8_B0_UDB14_F0 EQU 0x4000644e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB15_F0
CYDEV_UWRK_UWRK8_B0_UDB15_F0 EQU 0x4000644f
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB00_F1
CYDEV_UWRK_UWRK8_B0_UDB00_F1 EQU 0x40006450
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB01_F1
CYDEV_UWRK_UWRK8_B0_UDB01_F1 EQU 0x40006451
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB02_F1
CYDEV_UWRK_UWRK8_B0_UDB02_F1 EQU 0x40006452
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB03_F1
CYDEV_UWRK_UWRK8_B0_UDB03_F1 EQU 0x40006453
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB04_F1
CYDEV_UWRK_UWRK8_B0_UDB04_F1 EQU 0x40006454
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB05_F1
CYDEV_UWRK_UWRK8_B0_UDB05_F1 EQU 0x40006455
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB06_F1
CYDEV_UWRK_UWRK8_B0_UDB06_F1 EQU 0x40006456
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB07_F1
CYDEV_UWRK_UWRK8_B0_UDB07_F1 EQU 0x40006457
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB08_F1
CYDEV_UWRK_UWRK8_B0_UDB08_F1 EQU 0x40006458
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB09_F1
CYDEV_UWRK_UWRK8_B0_UDB09_F1 EQU 0x40006459
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB10_F1
CYDEV_UWRK_UWRK8_B0_UDB10_F1 EQU 0x4000645a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB11_F1
CYDEV_UWRK_UWRK8_B0_UDB11_F1 EQU 0x4000645b
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB12_F1
CYDEV_UWRK_UWRK8_B0_UDB12_F1 EQU 0x4000645c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB13_F1
CYDEV_UWRK_UWRK8_B0_UDB13_F1 EQU 0x4000645d
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB14_F1
CYDEV_UWRK_UWRK8_B0_UDB14_F1 EQU 0x4000645e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB15_F1
CYDEV_UWRK_UWRK8_B0_UDB15_F1 EQU 0x4000645f
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB00_ST
CYDEV_UWRK_UWRK8_B0_UDB00_ST EQU 0x40006460
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB01_ST
CYDEV_UWRK_UWRK8_B0_UDB01_ST EQU 0x40006461
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB02_ST
CYDEV_UWRK_UWRK8_B0_UDB02_ST EQU 0x40006462
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB03_ST
CYDEV_UWRK_UWRK8_B0_UDB03_ST EQU 0x40006463
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB04_ST
CYDEV_UWRK_UWRK8_B0_UDB04_ST EQU 0x40006464
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB05_ST
CYDEV_UWRK_UWRK8_B0_UDB05_ST EQU 0x40006465
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB06_ST
CYDEV_UWRK_UWRK8_B0_UDB06_ST EQU 0x40006466
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB07_ST
CYDEV_UWRK_UWRK8_B0_UDB07_ST EQU 0x40006467
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB08_ST
CYDEV_UWRK_UWRK8_B0_UDB08_ST EQU 0x40006468
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB09_ST
CYDEV_UWRK_UWRK8_B0_UDB09_ST EQU 0x40006469
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB10_ST
CYDEV_UWRK_UWRK8_B0_UDB10_ST EQU 0x4000646a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB11_ST
CYDEV_UWRK_UWRK8_B0_UDB11_ST EQU 0x4000646b
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB12_ST
CYDEV_UWRK_UWRK8_B0_UDB12_ST EQU 0x4000646c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB13_ST
CYDEV_UWRK_UWRK8_B0_UDB13_ST EQU 0x4000646d
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB14_ST
CYDEV_UWRK_UWRK8_B0_UDB14_ST EQU 0x4000646e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB15_ST
CYDEV_UWRK_UWRK8_B0_UDB15_ST EQU 0x4000646f
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB00_CTL
CYDEV_UWRK_UWRK8_B0_UDB00_CTL EQU 0x40006470
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB01_CTL
CYDEV_UWRK_UWRK8_B0_UDB01_CTL EQU 0x40006471
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB02_CTL
CYDEV_UWRK_UWRK8_B0_UDB02_CTL EQU 0x40006472
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB03_CTL
CYDEV_UWRK_UWRK8_B0_UDB03_CTL EQU 0x40006473
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB04_CTL
CYDEV_UWRK_UWRK8_B0_UDB04_CTL EQU 0x40006474
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB05_CTL
CYDEV_UWRK_UWRK8_B0_UDB05_CTL EQU 0x40006475
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB06_CTL
CYDEV_UWRK_UWRK8_B0_UDB06_CTL EQU 0x40006476
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB07_CTL
CYDEV_UWRK_UWRK8_B0_UDB07_CTL EQU 0x40006477
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB08_CTL
CYDEV_UWRK_UWRK8_B0_UDB08_CTL EQU 0x40006478
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB09_CTL
CYDEV_UWRK_UWRK8_B0_UDB09_CTL EQU 0x40006479
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB10_CTL
CYDEV_UWRK_UWRK8_B0_UDB10_CTL EQU 0x4000647a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB11_CTL
CYDEV_UWRK_UWRK8_B0_UDB11_CTL EQU 0x4000647b
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB12_CTL
CYDEV_UWRK_UWRK8_B0_UDB12_CTL EQU 0x4000647c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB13_CTL
CYDEV_UWRK_UWRK8_B0_UDB13_CTL EQU 0x4000647d
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB14_CTL
CYDEV_UWRK_UWRK8_B0_UDB14_CTL EQU 0x4000647e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB15_CTL
CYDEV_UWRK_UWRK8_B0_UDB15_CTL EQU 0x4000647f
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB00_MSK
CYDEV_UWRK_UWRK8_B0_UDB00_MSK EQU 0x40006480
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB01_MSK
CYDEV_UWRK_UWRK8_B0_UDB01_MSK EQU 0x40006481
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB02_MSK
CYDEV_UWRK_UWRK8_B0_UDB02_MSK EQU 0x40006482
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB03_MSK
CYDEV_UWRK_UWRK8_B0_UDB03_MSK EQU 0x40006483
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB04_MSK
CYDEV_UWRK_UWRK8_B0_UDB04_MSK EQU 0x40006484
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB05_MSK
CYDEV_UWRK_UWRK8_B0_UDB05_MSK EQU 0x40006485
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB06_MSK
CYDEV_UWRK_UWRK8_B0_UDB06_MSK EQU 0x40006486
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB07_MSK
CYDEV_UWRK_UWRK8_B0_UDB07_MSK EQU 0x40006487
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB08_MSK
CYDEV_UWRK_UWRK8_B0_UDB08_MSK EQU 0x40006488
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB09_MSK
CYDEV_UWRK_UWRK8_B0_UDB09_MSK EQU 0x40006489
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB10_MSK
CYDEV_UWRK_UWRK8_B0_UDB10_MSK EQU 0x4000648a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB11_MSK
CYDEV_UWRK_UWRK8_B0_UDB11_MSK EQU 0x4000648b
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB12_MSK
CYDEV_UWRK_UWRK8_B0_UDB12_MSK EQU 0x4000648c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB13_MSK
CYDEV_UWRK_UWRK8_B0_UDB13_MSK EQU 0x4000648d
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB14_MSK
CYDEV_UWRK_UWRK8_B0_UDB14_MSK EQU 0x4000648e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB15_MSK
CYDEV_UWRK_UWRK8_B0_UDB15_MSK EQU 0x4000648f
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB00_ACTL
CYDEV_UWRK_UWRK8_B0_UDB00_ACTL EQU 0x40006490
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB01_ACTL
CYDEV_UWRK_UWRK8_B0_UDB01_ACTL EQU 0x40006491
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB02_ACTL
CYDEV_UWRK_UWRK8_B0_UDB02_ACTL EQU 0x40006492
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB03_ACTL
CYDEV_UWRK_UWRK8_B0_UDB03_ACTL EQU 0x40006493
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB04_ACTL
CYDEV_UWRK_UWRK8_B0_UDB04_ACTL EQU 0x40006494
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB05_ACTL
CYDEV_UWRK_UWRK8_B0_UDB05_ACTL EQU 0x40006495
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB06_ACTL
CYDEV_UWRK_UWRK8_B0_UDB06_ACTL EQU 0x40006496
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB07_ACTL
CYDEV_UWRK_UWRK8_B0_UDB07_ACTL EQU 0x40006497
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB08_ACTL
CYDEV_UWRK_UWRK8_B0_UDB08_ACTL EQU 0x40006498
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB09_ACTL
CYDEV_UWRK_UWRK8_B0_UDB09_ACTL EQU 0x40006499
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB10_ACTL
CYDEV_UWRK_UWRK8_B0_UDB10_ACTL EQU 0x4000649a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB11_ACTL
CYDEV_UWRK_UWRK8_B0_UDB11_ACTL EQU 0x4000649b
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB12_ACTL
CYDEV_UWRK_UWRK8_B0_UDB12_ACTL EQU 0x4000649c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB13_ACTL
CYDEV_UWRK_UWRK8_B0_UDB13_ACTL EQU 0x4000649d
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB14_ACTL
CYDEV_UWRK_UWRK8_B0_UDB14_ACTL EQU 0x4000649e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB15_ACTL
CYDEV_UWRK_UWRK8_B0_UDB15_ACTL EQU 0x4000649f
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB00_MC
CYDEV_UWRK_UWRK8_B0_UDB00_MC EQU 0x400064a0
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB01_MC
CYDEV_UWRK_UWRK8_B0_UDB01_MC EQU 0x400064a1
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB02_MC
CYDEV_UWRK_UWRK8_B0_UDB02_MC EQU 0x400064a2
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB03_MC
CYDEV_UWRK_UWRK8_B0_UDB03_MC EQU 0x400064a3
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB04_MC
CYDEV_UWRK_UWRK8_B0_UDB04_MC EQU 0x400064a4
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB05_MC
CYDEV_UWRK_UWRK8_B0_UDB05_MC EQU 0x400064a5
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB06_MC
CYDEV_UWRK_UWRK8_B0_UDB06_MC EQU 0x400064a6
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB07_MC
CYDEV_UWRK_UWRK8_B0_UDB07_MC EQU 0x400064a7
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB08_MC
CYDEV_UWRK_UWRK8_B0_UDB08_MC EQU 0x400064a8
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB09_MC
CYDEV_UWRK_UWRK8_B0_UDB09_MC EQU 0x400064a9
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB10_MC
CYDEV_UWRK_UWRK8_B0_UDB10_MC EQU 0x400064aa
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB11_MC
CYDEV_UWRK_UWRK8_B0_UDB11_MC EQU 0x400064ab
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB12_MC
CYDEV_UWRK_UWRK8_B0_UDB12_MC EQU 0x400064ac
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB13_MC
CYDEV_UWRK_UWRK8_B0_UDB13_MC EQU 0x400064ad
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB14_MC
CYDEV_UWRK_UWRK8_B0_UDB14_MC EQU 0x400064ae
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B0_UDB15_MC
CYDEV_UWRK_UWRK8_B0_UDB15_MC EQU 0x400064af
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_BASE
CYDEV_UWRK_UWRK8_B1_BASE EQU 0x40006500
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_SIZE
CYDEV_UWRK_UWRK8_B1_SIZE EQU 0x000000b0
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB04_A0
CYDEV_UWRK_UWRK8_B1_UDB04_A0 EQU 0x40006504
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB05_A0
CYDEV_UWRK_UWRK8_B1_UDB05_A0 EQU 0x40006505
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB06_A0
CYDEV_UWRK_UWRK8_B1_UDB06_A0 EQU 0x40006506
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB07_A0
CYDEV_UWRK_UWRK8_B1_UDB07_A0 EQU 0x40006507
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB08_A0
CYDEV_UWRK_UWRK8_B1_UDB08_A0 EQU 0x40006508
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB09_A0
CYDEV_UWRK_UWRK8_B1_UDB09_A0 EQU 0x40006509
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB10_A0
CYDEV_UWRK_UWRK8_B1_UDB10_A0 EQU 0x4000650a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB11_A0
CYDEV_UWRK_UWRK8_B1_UDB11_A0 EQU 0x4000650b
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB04_A1
CYDEV_UWRK_UWRK8_B1_UDB04_A1 EQU 0x40006514
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB05_A1
CYDEV_UWRK_UWRK8_B1_UDB05_A1 EQU 0x40006515
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB06_A1
CYDEV_UWRK_UWRK8_B1_UDB06_A1 EQU 0x40006516
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB07_A1
CYDEV_UWRK_UWRK8_B1_UDB07_A1 EQU 0x40006517
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB08_A1
CYDEV_UWRK_UWRK8_B1_UDB08_A1 EQU 0x40006518
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB09_A1
CYDEV_UWRK_UWRK8_B1_UDB09_A1 EQU 0x40006519
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB10_A1
CYDEV_UWRK_UWRK8_B1_UDB10_A1 EQU 0x4000651a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB11_A1
CYDEV_UWRK_UWRK8_B1_UDB11_A1 EQU 0x4000651b
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB04_D0
CYDEV_UWRK_UWRK8_B1_UDB04_D0 EQU 0x40006524
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB05_D0
CYDEV_UWRK_UWRK8_B1_UDB05_D0 EQU 0x40006525
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB06_D0
CYDEV_UWRK_UWRK8_B1_UDB06_D0 EQU 0x40006526
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB07_D0
CYDEV_UWRK_UWRK8_B1_UDB07_D0 EQU 0x40006527
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB08_D0
CYDEV_UWRK_UWRK8_B1_UDB08_D0 EQU 0x40006528
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB09_D0
CYDEV_UWRK_UWRK8_B1_UDB09_D0 EQU 0x40006529
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB10_D0
CYDEV_UWRK_UWRK8_B1_UDB10_D0 EQU 0x4000652a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB11_D0
CYDEV_UWRK_UWRK8_B1_UDB11_D0 EQU 0x4000652b
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB04_D1
