MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv.inc
CYDEV_UWRK_UWRK8_B1_UDB04_D1 EQU 0x40006534
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB05_D1
CYDEV_UWRK_UWRK8_B1_UDB05_D1 EQU 0x40006535
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB06_D1
CYDEV_UWRK_UWRK8_B1_UDB06_D1 EQU 0x40006536
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB07_D1
CYDEV_UWRK_UWRK8_B1_UDB07_D1 EQU 0x40006537
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB08_D1
CYDEV_UWRK_UWRK8_B1_UDB08_D1 EQU 0x40006538
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB09_D1
CYDEV_UWRK_UWRK8_B1_UDB09_D1 EQU 0x40006539
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB10_D1
CYDEV_UWRK_UWRK8_B1_UDB10_D1 EQU 0x4000653a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB11_D1
CYDEV_UWRK_UWRK8_B1_UDB11_D1 EQU 0x4000653b
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB04_F0
CYDEV_UWRK_UWRK8_B1_UDB04_F0 EQU 0x40006544
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB05_F0
CYDEV_UWRK_UWRK8_B1_UDB05_F0 EQU 0x40006545
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB06_F0
CYDEV_UWRK_UWRK8_B1_UDB06_F0 EQU 0x40006546
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB07_F0
CYDEV_UWRK_UWRK8_B1_UDB07_F0 EQU 0x40006547
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB08_F0
CYDEV_UWRK_UWRK8_B1_UDB08_F0 EQU 0x40006548
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB09_F0
CYDEV_UWRK_UWRK8_B1_UDB09_F0 EQU 0x40006549
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB10_F0
CYDEV_UWRK_UWRK8_B1_UDB10_F0 EQU 0x4000654a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB11_F0
CYDEV_UWRK_UWRK8_B1_UDB11_F0 EQU 0x4000654b
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB04_F1
CYDEV_UWRK_UWRK8_B1_UDB04_F1 EQU 0x40006554
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB05_F1
CYDEV_UWRK_UWRK8_B1_UDB05_F1 EQU 0x40006555
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB06_F1
CYDEV_UWRK_UWRK8_B1_UDB06_F1 EQU 0x40006556
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB07_F1
CYDEV_UWRK_UWRK8_B1_UDB07_F1 EQU 0x40006557
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB08_F1
CYDEV_UWRK_UWRK8_B1_UDB08_F1 EQU 0x40006558
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB09_F1
CYDEV_UWRK_UWRK8_B1_UDB09_F1 EQU 0x40006559
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB10_F1
CYDEV_UWRK_UWRK8_B1_UDB10_F1 EQU 0x4000655a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB11_F1
CYDEV_UWRK_UWRK8_B1_UDB11_F1 EQU 0x4000655b
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB04_ST
CYDEV_UWRK_UWRK8_B1_UDB04_ST EQU 0x40006564
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB05_ST
CYDEV_UWRK_UWRK8_B1_UDB05_ST EQU 0x40006565
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB06_ST
CYDEV_UWRK_UWRK8_B1_UDB06_ST EQU 0x40006566
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB07_ST
CYDEV_UWRK_UWRK8_B1_UDB07_ST EQU 0x40006567
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB08_ST
CYDEV_UWRK_UWRK8_B1_UDB08_ST EQU 0x40006568
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB09_ST
CYDEV_UWRK_UWRK8_B1_UDB09_ST EQU 0x40006569
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB10_ST
CYDEV_UWRK_UWRK8_B1_UDB10_ST EQU 0x4000656a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB11_ST
CYDEV_UWRK_UWRK8_B1_UDB11_ST EQU 0x4000656b
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB04_CTL
CYDEV_UWRK_UWRK8_B1_UDB04_CTL EQU 0x40006574
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB05_CTL
CYDEV_UWRK_UWRK8_B1_UDB05_CTL EQU 0x40006575
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB06_CTL
CYDEV_UWRK_UWRK8_B1_UDB06_CTL EQU 0x40006576
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB07_CTL
CYDEV_UWRK_UWRK8_B1_UDB07_CTL EQU 0x40006577
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB08_CTL
CYDEV_UWRK_UWRK8_B1_UDB08_CTL EQU 0x40006578
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB09_CTL
CYDEV_UWRK_UWRK8_B1_UDB09_CTL EQU 0x40006579
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB10_CTL
CYDEV_UWRK_UWRK8_B1_UDB10_CTL EQU 0x4000657a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB11_CTL
CYDEV_UWRK_UWRK8_B1_UDB11_CTL EQU 0x4000657b
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB04_MSK
CYDEV_UWRK_UWRK8_B1_UDB04_MSK EQU 0x40006584
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB05_MSK
CYDEV_UWRK_UWRK8_B1_UDB05_MSK EQU 0x40006585
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB06_MSK
CYDEV_UWRK_UWRK8_B1_UDB06_MSK EQU 0x40006586
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB07_MSK
CYDEV_UWRK_UWRK8_B1_UDB07_MSK EQU 0x40006587
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB08_MSK
CYDEV_UWRK_UWRK8_B1_UDB08_MSK EQU 0x40006588
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB09_MSK
CYDEV_UWRK_UWRK8_B1_UDB09_MSK EQU 0x40006589
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB10_MSK
CYDEV_UWRK_UWRK8_B1_UDB10_MSK EQU 0x4000658a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB11_MSK
CYDEV_UWRK_UWRK8_B1_UDB11_MSK EQU 0x4000658b
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB04_ACTL
CYDEV_UWRK_UWRK8_B1_UDB04_ACTL EQU 0x40006594
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB05_ACTL
CYDEV_UWRK_UWRK8_B1_UDB05_ACTL EQU 0x40006595
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB06_ACTL
CYDEV_UWRK_UWRK8_B1_UDB06_ACTL EQU 0x40006596
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB07_ACTL
CYDEV_UWRK_UWRK8_B1_UDB07_ACTL EQU 0x40006597
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB08_ACTL
CYDEV_UWRK_UWRK8_B1_UDB08_ACTL EQU 0x40006598
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB09_ACTL
CYDEV_UWRK_UWRK8_B1_UDB09_ACTL EQU 0x40006599
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB10_ACTL
CYDEV_UWRK_UWRK8_B1_UDB10_ACTL EQU 0x4000659a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB11_ACTL
CYDEV_UWRK_UWRK8_B1_UDB11_ACTL EQU 0x4000659b
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB04_MC
CYDEV_UWRK_UWRK8_B1_UDB04_MC EQU 0x400065a4
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB05_MC
CYDEV_UWRK_UWRK8_B1_UDB05_MC EQU 0x400065a5
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB06_MC
CYDEV_UWRK_UWRK8_B1_UDB06_MC EQU 0x400065a6
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB07_MC
CYDEV_UWRK_UWRK8_B1_UDB07_MC EQU 0x400065a7
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB08_MC
CYDEV_UWRK_UWRK8_B1_UDB08_MC EQU 0x400065a8
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB09_MC
CYDEV_UWRK_UWRK8_B1_UDB09_MC EQU 0x400065a9
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB10_MC
CYDEV_UWRK_UWRK8_B1_UDB10_MC EQU 0x400065aa
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK8_B1_UDB11_MC
CYDEV_UWRK_UWRK8_B1_UDB11_MC EQU 0x400065ab
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_BASE
CYDEV_UWRK_UWRK16_BASE EQU 0x40006800
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_SIZE
CYDEV_UWRK_UWRK16_SIZE EQU 0x00000760
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_BASE
CYDEV_UWRK_UWRK16_CAT_BASE EQU 0x40006800
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_SIZE
CYDEV_UWRK_UWRK16_CAT_SIZE EQU 0x00000760
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_BASE
CYDEV_UWRK_UWRK16_CAT_B0_BASE EQU 0x40006800
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_SIZE
CYDEV_UWRK_UWRK16_CAT_B0_SIZE EQU 0x00000160
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB00_A0_A1
CYDEV_UWRK_UWRK16_CAT_B0_UDB00_A0_A1 EQU 0x40006800
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB01_A0_A1
CYDEV_UWRK_UWRK16_CAT_B0_UDB01_A0_A1 EQU 0x40006802
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB02_A0_A1
CYDEV_UWRK_UWRK16_CAT_B0_UDB02_A0_A1 EQU 0x40006804
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB03_A0_A1
CYDEV_UWRK_UWRK16_CAT_B0_UDB03_A0_A1 EQU 0x40006806
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB04_A0_A1
CYDEV_UWRK_UWRK16_CAT_B0_UDB04_A0_A1 EQU 0x40006808
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB05_A0_A1
CYDEV_UWRK_UWRK16_CAT_B0_UDB05_A0_A1 EQU 0x4000680a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB06_A0_A1
CYDEV_UWRK_UWRK16_CAT_B0_UDB06_A0_A1 EQU 0x4000680c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB07_A0_A1
CYDEV_UWRK_UWRK16_CAT_B0_UDB07_A0_A1 EQU 0x4000680e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB08_A0_A1
CYDEV_UWRK_UWRK16_CAT_B0_UDB08_A0_A1 EQU 0x40006810
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB09_A0_A1
CYDEV_UWRK_UWRK16_CAT_B0_UDB09_A0_A1 EQU 0x40006812
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB10_A0_A1
CYDEV_UWRK_UWRK16_CAT_B0_UDB10_A0_A1 EQU 0x40006814
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB11_A0_A1
CYDEV_UWRK_UWRK16_CAT_B0_UDB11_A0_A1 EQU 0x40006816
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB12_A0_A1
CYDEV_UWRK_UWRK16_CAT_B0_UDB12_A0_A1 EQU 0x40006818
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB13_A0_A1
CYDEV_UWRK_UWRK16_CAT_B0_UDB13_A0_A1 EQU 0x4000681a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB14_A0_A1
CYDEV_UWRK_UWRK16_CAT_B0_UDB14_A0_A1 EQU 0x4000681c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB15_A0_A1
CYDEV_UWRK_UWRK16_CAT_B0_UDB15_A0_A1 EQU 0x4000681e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB00_D0_D1
CYDEV_UWRK_UWRK16_CAT_B0_UDB00_D0_D1 EQU 0x40006840
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB01_D0_D1
CYDEV_UWRK_UWRK16_CAT_B0_UDB01_D0_D1 EQU 0x40006842
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB02_D0_D1
CYDEV_UWRK_UWRK16_CAT_B0_UDB02_D0_D1 EQU 0x40006844
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB03_D0_D1
CYDEV_UWRK_UWRK16_CAT_B0_UDB03_D0_D1 EQU 0x40006846
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB04_D0_D1
CYDEV_UWRK_UWRK16_CAT_B0_UDB04_D0_D1 EQU 0x40006848
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB05_D0_D1
CYDEV_UWRK_UWRK16_CAT_B0_UDB05_D0_D1 EQU 0x4000684a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB06_D0_D1
CYDEV_UWRK_UWRK16_CAT_B0_UDB06_D0_D1 EQU 0x4000684c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB07_D0_D1
CYDEV_UWRK_UWRK16_CAT_B0_UDB07_D0_D1 EQU 0x4000684e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB08_D0_D1
CYDEV_UWRK_UWRK16_CAT_B0_UDB08_D0_D1 EQU 0x40006850
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB09_D0_D1
CYDEV_UWRK_UWRK16_CAT_B0_UDB09_D0_D1 EQU 0x40006852
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB10_D0_D1
CYDEV_UWRK_UWRK16_CAT_B0_UDB10_D0_D1 EQU 0x40006854
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB11_D0_D1
CYDEV_UWRK_UWRK16_CAT_B0_UDB11_D0_D1 EQU 0x40006856
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB12_D0_D1
CYDEV_UWRK_UWRK16_CAT_B0_UDB12_D0_D1 EQU 0x40006858
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB13_D0_D1
CYDEV_UWRK_UWRK16_CAT_B0_UDB13_D0_D1 EQU 0x4000685a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB14_D0_D1
CYDEV_UWRK_UWRK16_CAT_B0_UDB14_D0_D1 EQU 0x4000685c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB15_D0_D1
CYDEV_UWRK_UWRK16_CAT_B0_UDB15_D0_D1 EQU 0x4000685e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB00_F0_F1
CYDEV_UWRK_UWRK16_CAT_B0_UDB00_F0_F1 EQU 0x40006880
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB01_F0_F1
CYDEV_UWRK_UWRK16_CAT_B0_UDB01_F0_F1 EQU 0x40006882
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB02_F0_F1
CYDEV_UWRK_UWRK16_CAT_B0_UDB02_F0_F1 EQU 0x40006884
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB03_F0_F1
CYDEV_UWRK_UWRK16_CAT_B0_UDB03_F0_F1 EQU 0x40006886
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB04_F0_F1
CYDEV_UWRK_UWRK16_CAT_B0_UDB04_F0_F1 EQU 0x40006888
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB05_F0_F1
CYDEV_UWRK_UWRK16_CAT_B0_UDB05_F0_F1 EQU 0x4000688a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB06_F0_F1
CYDEV_UWRK_UWRK16_CAT_B0_UDB06_F0_F1 EQU 0x4000688c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB07_F0_F1
CYDEV_UWRK_UWRK16_CAT_B0_UDB07_F0_F1 EQU 0x4000688e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB08_F0_F1
CYDEV_UWRK_UWRK16_CAT_B0_UDB08_F0_F1 EQU 0x40006890
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB09_F0_F1
CYDEV_UWRK_UWRK16_CAT_B0_UDB09_F0_F1 EQU 0x40006892
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB10_F0_F1
CYDEV_UWRK_UWRK16_CAT_B0_UDB10_F0_F1 EQU 0x40006894
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB11_F0_F1
CYDEV_UWRK_UWRK16_CAT_B0_UDB11_F0_F1 EQU 0x40006896
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB12_F0_F1
CYDEV_UWRK_UWRK16_CAT_B0_UDB12_F0_F1 EQU 0x40006898
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB13_F0_F1
CYDEV_UWRK_UWRK16_CAT_B0_UDB13_F0_F1 EQU 0x4000689a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB14_F0_F1
CYDEV_UWRK_UWRK16_CAT_B0_UDB14_F0_F1 EQU 0x4000689c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB15_F0_F1
CYDEV_UWRK_UWRK16_CAT_B0_UDB15_F0_F1 EQU 0x4000689e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB00_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB00_ST_CTL EQU 0x400068c0
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB01_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB01_ST_CTL EQU 0x400068c2
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB02_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB02_ST_CTL EQU 0x400068c4
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB03_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB03_ST_CTL EQU 0x400068c6
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB04_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB04_ST_CTL EQU 0x400068c8
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB05_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB05_ST_CTL EQU 0x400068ca
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB06_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB06_ST_CTL EQU 0x400068cc
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB07_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB07_ST_CTL EQU 0x400068ce
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB08_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB08_ST_CTL EQU 0x400068d0
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB09_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB09_ST_CTL EQU 0x400068d2
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB10_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB10_ST_CTL EQU 0x400068d4
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB11_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB11_ST_CTL EQU 0x400068d6
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB12_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB12_ST_CTL EQU 0x400068d8
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB13_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB13_ST_CTL EQU 0x400068da
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB14_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB14_ST_CTL EQU 0x400068dc
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB15_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB15_ST_CTL EQU 0x400068de
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB00_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB00_MSK_ACTL EQU 0x40006900
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB01_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB01_MSK_ACTL EQU 0x40006902
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB02_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB02_MSK_ACTL EQU 0x40006904
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB03_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB03_MSK_ACTL EQU 0x40006906
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB04_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB04_MSK_ACTL EQU 0x40006908
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB05_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB05_MSK_ACTL EQU 0x4000690a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB06_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB06_MSK_ACTL EQU 0x4000690c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB07_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB07_MSK_ACTL EQU 0x4000690e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB08_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB08_MSK_ACTL EQU 0x40006910
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB09_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB09_MSK_ACTL EQU 0x40006912
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB10_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB10_MSK_ACTL EQU 0x40006914
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB11_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB11_MSK_ACTL EQU 0x40006916
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB12_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB12_MSK_ACTL EQU 0x40006918
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB13_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB13_MSK_ACTL EQU 0x4000691a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB14_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB14_MSK_ACTL EQU 0x4000691c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB15_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B0_UDB15_MSK_ACTL EQU 0x4000691e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB00_MC_00
CYDEV_UWRK_UWRK16_CAT_B0_UDB00_MC_00 EQU 0x40006940
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB01_MC_00
CYDEV_UWRK_UWRK16_CAT_B0_UDB01_MC_00 EQU 0x40006942
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB02_MC_00
CYDEV_UWRK_UWRK16_CAT_B0_UDB02_MC_00 EQU 0x40006944
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB03_MC_00
CYDEV_UWRK_UWRK16_CAT_B0_UDB03_MC_00 EQU 0x40006946
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB04_MC_00
CYDEV_UWRK_UWRK16_CAT_B0_UDB04_MC_00 EQU 0x40006948
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB05_MC_00
CYDEV_UWRK_UWRK16_CAT_B0_UDB05_MC_00 EQU 0x4000694a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB06_MC_00
CYDEV_UWRK_UWRK16_CAT_B0_UDB06_MC_00 EQU 0x4000694c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB07_MC_00
CYDEV_UWRK_UWRK16_CAT_B0_UDB07_MC_00 EQU 0x4000694e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB08_MC_00
CYDEV_UWRK_UWRK16_CAT_B0_UDB08_MC_00 EQU 0x40006950
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB09_MC_00
CYDEV_UWRK_UWRK16_CAT_B0_UDB09_MC_00 EQU 0x40006952
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB10_MC_00
CYDEV_UWRK_UWRK16_CAT_B0_UDB10_MC_00 EQU 0x40006954
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB11_MC_00
CYDEV_UWRK_UWRK16_CAT_B0_UDB11_MC_00 EQU 0x40006956
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB12_MC_00
CYDEV_UWRK_UWRK16_CAT_B0_UDB12_MC_00 EQU 0x40006958
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB13_MC_00
CYDEV_UWRK_UWRK16_CAT_B0_UDB13_MC_00 EQU 0x4000695a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB14_MC_00
CYDEV_UWRK_UWRK16_CAT_B0_UDB14_MC_00 EQU 0x4000695c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B0_UDB15_MC_00
CYDEV_UWRK_UWRK16_CAT_B0_UDB15_MC_00 EQU 0x4000695e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_BASE
CYDEV_UWRK_UWRK16_CAT_B1_BASE EQU 0x40006a00
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_SIZE
CYDEV_UWRK_UWRK16_CAT_B1_SIZE EQU 0x00000160
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB04_A0_A1
CYDEV_UWRK_UWRK16_CAT_B1_UDB04_A0_A1 EQU 0x40006a08
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB05_A0_A1
CYDEV_UWRK_UWRK16_CAT_B1_UDB05_A0_A1 EQU 0x40006a0a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB06_A0_A1
CYDEV_UWRK_UWRK16_CAT_B1_UDB06_A0_A1 EQU 0x40006a0c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB07_A0_A1
CYDEV_UWRK_UWRK16_CAT_B1_UDB07_A0_A1 EQU 0x40006a0e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB08_A0_A1
CYDEV_UWRK_UWRK16_CAT_B1_UDB08_A0_A1 EQU 0x40006a10
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB09_A0_A1
CYDEV_UWRK_UWRK16_CAT_B1_UDB09_A0_A1 EQU 0x40006a12
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB10_A0_A1
CYDEV_UWRK_UWRK16_CAT_B1_UDB10_A0_A1 EQU 0x40006a14
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB11_A0_A1
CYDEV_UWRK_UWRK16_CAT_B1_UDB11_A0_A1 EQU 0x40006a16
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB04_D0_D1
CYDEV_UWRK_UWRK16_CAT_B1_UDB04_D0_D1 EQU 0x40006a48
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB05_D0_D1
CYDEV_UWRK_UWRK16_CAT_B1_UDB05_D0_D1 EQU 0x40006a4a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB06_D0_D1
CYDEV_UWRK_UWRK16_CAT_B1_UDB06_D0_D1 EQU 0x40006a4c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB07_D0_D1
CYDEV_UWRK_UWRK16_CAT_B1_UDB07_D0_D1 EQU 0x40006a4e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB08_D0_D1
CYDEV_UWRK_UWRK16_CAT_B1_UDB08_D0_D1 EQU 0x40006a50
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB09_D0_D1
CYDEV_UWRK_UWRK16_CAT_B1_UDB09_D0_D1 EQU 0x40006a52
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB10_D0_D1
CYDEV_UWRK_UWRK16_CAT_B1_UDB10_D0_D1 EQU 0x40006a54
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB11_D0_D1
CYDEV_UWRK_UWRK16_CAT_B1_UDB11_D0_D1 EQU 0x40006a56
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB04_F0_F1
CYDEV_UWRK_UWRK16_CAT_B1_UDB04_F0_F1 EQU 0x40006a88
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB05_F0_F1
CYDEV_UWRK_UWRK16_CAT_B1_UDB05_F0_F1 EQU 0x40006a8a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB06_F0_F1
CYDEV_UWRK_UWRK16_CAT_B1_UDB06_F0_F1 EQU 0x40006a8c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB07_F0_F1
CYDEV_UWRK_UWRK16_CAT_B1_UDB07_F0_F1 EQU 0x40006a8e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB08_F0_F1
CYDEV_UWRK_UWRK16_CAT_B1_UDB08_F0_F1 EQU 0x40006a90
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB09_F0_F1
CYDEV_UWRK_UWRK16_CAT_B1_UDB09_F0_F1 EQU 0x40006a92
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB10_F0_F1
CYDEV_UWRK_UWRK16_CAT_B1_UDB10_F0_F1 EQU 0x40006a94
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB11_F0_F1
CYDEV_UWRK_UWRK16_CAT_B1_UDB11_F0_F1 EQU 0x40006a96
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB04_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B1_UDB04_ST_CTL EQU 0x40006ac8
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB05_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B1_UDB05_ST_CTL EQU 0x40006aca
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB06_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B1_UDB06_ST_CTL EQU 0x40006acc
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB07_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B1_UDB07_ST_CTL EQU 0x40006ace
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB08_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B1_UDB08_ST_CTL EQU 0x40006ad0
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB09_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B1_UDB09_ST_CTL EQU 0x40006ad2
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB10_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B1_UDB10_ST_CTL EQU 0x40006ad4
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB11_ST_CTL
CYDEV_UWRK_UWRK16_CAT_B1_UDB11_ST_CTL EQU 0x40006ad6
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB04_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B1_UDB04_MSK_ACTL EQU 0x40006b08
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB05_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B1_UDB05_MSK_ACTL EQU 0x40006b0a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB06_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B1_UDB06_MSK_ACTL EQU 0x40006b0c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB07_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B1_UDB07_MSK_ACTL EQU 0x40006b0e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB08_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B1_UDB08_MSK_ACTL EQU 0x40006b10
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB09_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B1_UDB09_MSK_ACTL EQU 0x40006b12
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB10_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B1_UDB10_MSK_ACTL EQU 0x40006b14
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_CAT_B1_UDB11_MSK_ACTL
CYDEV_UWRK_UWRK16_CAT_B1_UDB11_MSK_ACTL EQU 0x40006b16
    ENDIF
