MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv.inc
CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_D0 EQU 0x40006a50
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_D0
CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_D0 EQU 0x40006a52
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_D0
CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_D0 EQU 0x40006a54
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_D0
CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_D0 EQU 0x40006a56
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_D1
CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_D1 EQU 0x40006a68
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_D1
CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_D1 EQU 0x40006a6a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_D1
CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_D1 EQU 0x40006a6c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_D1
CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_D1 EQU 0x40006a6e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_D1
CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_D1 EQU 0x40006a70
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_D1
CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_D1 EQU 0x40006a72
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_D1
CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_D1 EQU 0x40006a74
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_D1
CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_D1 EQU 0x40006a76
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_F0
CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_F0 EQU 0x40006a88
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_F0
CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_F0 EQU 0x40006a8a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_F0
CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_F0 EQU 0x40006a8c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_F0
CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_F0 EQU 0x40006a8e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_F0
CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_F0 EQU 0x40006a90
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_F0
CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_F0 EQU 0x40006a92
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_F0
CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_F0 EQU 0x40006a94
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_F0
CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_F0 EQU 0x40006a96
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_F1
CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_F1 EQU 0x40006aa8
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_F1
CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_F1 EQU 0x40006aaa
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_F1
CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_F1 EQU 0x40006aac
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_F1
CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_F1 EQU 0x40006aae
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_F1
CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_F1 EQU 0x40006ab0
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_F1
CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_F1 EQU 0x40006ab2
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_F1
CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_F1 EQU 0x40006ab4
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_F1
CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_F1 EQU 0x40006ab6
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_ST
CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_ST EQU 0x40006ac8
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_ST
CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_ST EQU 0x40006aca
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_ST
CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_ST EQU 0x40006acc
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_ST
CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_ST EQU 0x40006ace
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_ST
CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_ST EQU 0x40006ad0
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_ST
CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_ST EQU 0x40006ad2
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_ST
CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_ST EQU 0x40006ad4
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_ST
CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_ST EQU 0x40006ad6
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_CTL
CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_CTL EQU 0x40006ae8
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_CTL
CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_CTL EQU 0x40006aea
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_CTL
CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_CTL EQU 0x40006aec
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_CTL
CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_CTL EQU 0x40006aee
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_CTL
CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_CTL EQU 0x40006af0
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_CTL
CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_CTL EQU 0x40006af2
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_CTL
CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_CTL EQU 0x40006af4
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_CTL
CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_CTL EQU 0x40006af6
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_MSK
CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_MSK EQU 0x40006b08
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_MSK
CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_MSK EQU 0x40006b0a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_MSK
CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_MSK EQU 0x40006b0c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_MSK
CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_MSK EQU 0x40006b0e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_MSK
CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_MSK EQU 0x40006b10
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_MSK
CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_MSK EQU 0x40006b12
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_MSK
CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_MSK EQU 0x40006b14
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_MSK
CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_MSK EQU 0x40006b16
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_ACTL
CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_ACTL EQU 0x40006b28
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_ACTL
CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_ACTL EQU 0x40006b2a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_ACTL
CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_ACTL EQU 0x40006b2c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_ACTL
CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_ACTL EQU 0x40006b2e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_ACTL
CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_ACTL EQU 0x40006b30
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_ACTL
CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_ACTL EQU 0x40006b32
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_ACTL
CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_ACTL EQU 0x40006b34
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_ACTL
CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_ACTL EQU 0x40006b36
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_MC
CYDEV_UWRK_UWRK16_DEF_B1_UDB04_05_MC EQU 0x40006b48
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_MC
CYDEV_UWRK_UWRK16_DEF_B1_UDB05_06_MC EQU 0x40006b4a
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_MC
CYDEV_UWRK_UWRK16_DEF_B1_UDB06_07_MC EQU 0x40006b4c
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_MC
CYDEV_UWRK_UWRK16_DEF_B1_UDB07_08_MC EQU 0x40006b4e
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_MC
CYDEV_UWRK_UWRK16_DEF_B1_UDB08_09_MC EQU 0x40006b50
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_MC
CYDEV_UWRK_UWRK16_DEF_B1_UDB09_10_MC EQU 0x40006b52
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_MC
CYDEV_UWRK_UWRK16_DEF_B1_UDB10_11_MC EQU 0x40006b54
    ENDIF
    IF :LNOT::DEF:CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_MC
CYDEV_UWRK_UWRK16_DEF_B1_UDB11_12_MC EQU 0x40006b56
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_BASE
CYDEV_PHUB_BASE EQU 0x40007000
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_SIZE
CYDEV_PHUB_SIZE EQU 0x00000c00
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFG
CYDEV_PHUB_CFG EQU 0x40007000
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_ERR
CYDEV_PHUB_ERR EQU 0x40007004
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_ERR_ADR
CYDEV_PHUB_ERR_ADR EQU 0x40007008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH0_BASE
CYDEV_PHUB_CH0_BASE EQU 0x40007010
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH0_SIZE
CYDEV_PHUB_CH0_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH0_BASIC_CFG
CYDEV_PHUB_CH0_BASIC_CFG EQU 0x40007010
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH0_ACTION
CYDEV_PHUB_CH0_ACTION EQU 0x40007014
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH0_BASIC_STATUS
CYDEV_PHUB_CH0_BASIC_STATUS EQU 0x40007018
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH1_BASE
CYDEV_PHUB_CH1_BASE EQU 0x40007020
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH1_SIZE
CYDEV_PHUB_CH1_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH1_BASIC_CFG
CYDEV_PHUB_CH1_BASIC_CFG EQU 0x40007020
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH1_ACTION
CYDEV_PHUB_CH1_ACTION EQU 0x40007024
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH1_BASIC_STATUS
CYDEV_PHUB_CH1_BASIC_STATUS EQU 0x40007028
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH2_BASE
CYDEV_PHUB_CH2_BASE EQU 0x40007030
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH2_SIZE
CYDEV_PHUB_CH2_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH2_BASIC_CFG
CYDEV_PHUB_CH2_BASIC_CFG EQU 0x40007030
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH2_ACTION
CYDEV_PHUB_CH2_ACTION EQU 0x40007034
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH2_BASIC_STATUS
CYDEV_PHUB_CH2_BASIC_STATUS EQU 0x40007038
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH3_BASE
CYDEV_PHUB_CH3_BASE EQU 0x40007040
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH3_SIZE
CYDEV_PHUB_CH3_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH3_BASIC_CFG
CYDEV_PHUB_CH3_BASIC_CFG EQU 0x40007040
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH3_ACTION
CYDEV_PHUB_CH3_ACTION EQU 0x40007044
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH3_BASIC_STATUS
CYDEV_PHUB_CH3_BASIC_STATUS EQU 0x40007048
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH4_BASE
CYDEV_PHUB_CH4_BASE EQU 0x40007050
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH4_SIZE
CYDEV_PHUB_CH4_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH4_BASIC_CFG
CYDEV_PHUB_CH4_BASIC_CFG EQU 0x40007050
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH4_ACTION
CYDEV_PHUB_CH4_ACTION EQU 0x40007054
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH4_BASIC_STATUS
CYDEV_PHUB_CH4_BASIC_STATUS EQU 0x40007058
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH5_BASE
CYDEV_PHUB_CH5_BASE EQU 0x40007060
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH5_SIZE
CYDEV_PHUB_CH5_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH5_BASIC_CFG
CYDEV_PHUB_CH5_BASIC_CFG EQU 0x40007060
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH5_ACTION
CYDEV_PHUB_CH5_ACTION EQU 0x40007064
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH5_BASIC_STATUS
CYDEV_PHUB_CH5_BASIC_STATUS EQU 0x40007068
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH6_BASE
CYDEV_PHUB_CH6_BASE EQU 0x40007070
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH6_SIZE
CYDEV_PHUB_CH6_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH6_BASIC_CFG
CYDEV_PHUB_CH6_BASIC_CFG EQU 0x40007070
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH6_ACTION
CYDEV_PHUB_CH6_ACTION EQU 0x40007074
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH6_BASIC_STATUS
CYDEV_PHUB_CH6_BASIC_STATUS EQU 0x40007078
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH7_BASE
CYDEV_PHUB_CH7_BASE EQU 0x40007080
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH7_SIZE
CYDEV_PHUB_CH7_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH7_BASIC_CFG
CYDEV_PHUB_CH7_BASIC_CFG EQU 0x40007080
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH7_ACTION
CYDEV_PHUB_CH7_ACTION EQU 0x40007084
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH7_BASIC_STATUS
CYDEV_PHUB_CH7_BASIC_STATUS EQU 0x40007088
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH8_BASE
CYDEV_PHUB_CH8_BASE EQU 0x40007090
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH8_SIZE
CYDEV_PHUB_CH8_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH8_BASIC_CFG
CYDEV_PHUB_CH8_BASIC_CFG EQU 0x40007090
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH8_ACTION
CYDEV_PHUB_CH8_ACTION EQU 0x40007094
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH8_BASIC_STATUS
CYDEV_PHUB_CH8_BASIC_STATUS EQU 0x40007098
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH9_BASE
CYDEV_PHUB_CH9_BASE EQU 0x400070a0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH9_SIZE
CYDEV_PHUB_CH9_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH9_BASIC_CFG
CYDEV_PHUB_CH9_BASIC_CFG EQU 0x400070a0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH9_ACTION
CYDEV_PHUB_CH9_ACTION EQU 0x400070a4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH9_BASIC_STATUS
CYDEV_PHUB_CH9_BASIC_STATUS EQU 0x400070a8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH10_BASE
CYDEV_PHUB_CH10_BASE EQU 0x400070b0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH10_SIZE
CYDEV_PHUB_CH10_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH10_BASIC_CFG
CYDEV_PHUB_CH10_BASIC_CFG EQU 0x400070b0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH10_ACTION
CYDEV_PHUB_CH10_ACTION EQU 0x400070b4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH10_BASIC_STATUS
CYDEV_PHUB_CH10_BASIC_STATUS EQU 0x400070b8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH11_BASE
CYDEV_PHUB_CH11_BASE EQU 0x400070c0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH11_SIZE
CYDEV_PHUB_CH11_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH11_BASIC_CFG
CYDEV_PHUB_CH11_BASIC_CFG EQU 0x400070c0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH11_ACTION
CYDEV_PHUB_CH11_ACTION EQU 0x400070c4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH11_BASIC_STATUS
CYDEV_PHUB_CH11_BASIC_STATUS EQU 0x400070c8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH12_BASE
CYDEV_PHUB_CH12_BASE EQU 0x400070d0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH12_SIZE
CYDEV_PHUB_CH12_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH12_BASIC_CFG
CYDEV_PHUB_CH12_BASIC_CFG EQU 0x400070d0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH12_ACTION
CYDEV_PHUB_CH12_ACTION EQU 0x400070d4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH12_BASIC_STATUS
CYDEV_PHUB_CH12_BASIC_STATUS EQU 0x400070d8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH13_BASE
CYDEV_PHUB_CH13_BASE EQU 0x400070e0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH13_SIZE
CYDEV_PHUB_CH13_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH13_BASIC_CFG
CYDEV_PHUB_CH13_BASIC_CFG EQU 0x400070e0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH13_ACTION
CYDEV_PHUB_CH13_ACTION EQU 0x400070e4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH13_BASIC_STATUS
CYDEV_PHUB_CH13_BASIC_STATUS EQU 0x400070e8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH14_BASE
CYDEV_PHUB_CH14_BASE EQU 0x400070f0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH14_SIZE
CYDEV_PHUB_CH14_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH14_BASIC_CFG
CYDEV_PHUB_CH14_BASIC_CFG EQU 0x400070f0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH14_ACTION
CYDEV_PHUB_CH14_ACTION EQU 0x400070f4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH14_BASIC_STATUS
CYDEV_PHUB_CH14_BASIC_STATUS EQU 0x400070f8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH15_BASE
CYDEV_PHUB_CH15_BASE EQU 0x40007100
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH15_SIZE
CYDEV_PHUB_CH15_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH15_BASIC_CFG
CYDEV_PHUB_CH15_BASIC_CFG EQU 0x40007100
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH15_ACTION
CYDEV_PHUB_CH15_ACTION EQU 0x40007104
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH15_BASIC_STATUS
CYDEV_PHUB_CH15_BASIC_STATUS EQU 0x40007108
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH16_BASE
CYDEV_PHUB_CH16_BASE EQU 0x40007110
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH16_SIZE
CYDEV_PHUB_CH16_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH16_BASIC_CFG
CYDEV_PHUB_CH16_BASIC_CFG EQU 0x40007110
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH16_ACTION
CYDEV_PHUB_CH16_ACTION EQU 0x40007114
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH16_BASIC_STATUS
CYDEV_PHUB_CH16_BASIC_STATUS EQU 0x40007118
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH17_BASE
CYDEV_PHUB_CH17_BASE EQU 0x40007120
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH17_SIZE
CYDEV_PHUB_CH17_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH17_BASIC_CFG
CYDEV_PHUB_CH17_BASIC_CFG EQU 0x40007120
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH17_ACTION
CYDEV_PHUB_CH17_ACTION EQU 0x40007124
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH17_BASIC_STATUS
CYDEV_PHUB_CH17_BASIC_STATUS EQU 0x40007128
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH18_BASE
CYDEV_PHUB_CH18_BASE EQU 0x40007130
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH18_SIZE
CYDEV_PHUB_CH18_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH18_BASIC_CFG
CYDEV_PHUB_CH18_BASIC_CFG EQU 0x40007130
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH18_ACTION
CYDEV_PHUB_CH18_ACTION EQU 0x40007134
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH18_BASIC_STATUS
CYDEV_PHUB_CH18_BASIC_STATUS EQU 0x40007138
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH19_BASE
CYDEV_PHUB_CH19_BASE EQU 0x40007140
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH19_SIZE
CYDEV_PHUB_CH19_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH19_BASIC_CFG
CYDEV_PHUB_CH19_BASIC_CFG EQU 0x40007140
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH19_ACTION
CYDEV_PHUB_CH19_ACTION EQU 0x40007144
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH19_BASIC_STATUS
CYDEV_PHUB_CH19_BASIC_STATUS EQU 0x40007148
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH20_BASE
CYDEV_PHUB_CH20_BASE EQU 0x40007150
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH20_SIZE
CYDEV_PHUB_CH20_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH20_BASIC_CFG
CYDEV_PHUB_CH20_BASIC_CFG EQU 0x40007150
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH20_ACTION
CYDEV_PHUB_CH20_ACTION EQU 0x40007154
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH20_BASIC_STATUS
CYDEV_PHUB_CH20_BASIC_STATUS EQU 0x40007158
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH21_BASE
CYDEV_PHUB_CH21_BASE EQU 0x40007160
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH21_SIZE
CYDEV_PHUB_CH21_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH21_BASIC_CFG
CYDEV_PHUB_CH21_BASIC_CFG EQU 0x40007160
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH21_ACTION
CYDEV_PHUB_CH21_ACTION EQU 0x40007164
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH21_BASIC_STATUS
CYDEV_PHUB_CH21_BASIC_STATUS EQU 0x40007168
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH22_BASE
CYDEV_PHUB_CH22_BASE EQU 0x40007170
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH22_SIZE
CYDEV_PHUB_CH22_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH22_BASIC_CFG
CYDEV_PHUB_CH22_BASIC_CFG EQU 0x40007170
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH22_ACTION
CYDEV_PHUB_CH22_ACTION EQU 0x40007174
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH22_BASIC_STATUS
CYDEV_PHUB_CH22_BASIC_STATUS EQU 0x40007178
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH23_BASE
CYDEV_PHUB_CH23_BASE EQU 0x40007180
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH23_SIZE
CYDEV_PHUB_CH23_SIZE EQU 0x0000000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH23_BASIC_CFG
CYDEV_PHUB_CH23_BASIC_CFG EQU 0x40007180
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH23_ACTION
CYDEV_PHUB_CH23_ACTION EQU 0x40007184
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CH23_BASIC_STATUS
CYDEV_PHUB_CH23_BASIC_STATUS EQU 0x40007188
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM0_BASE
CYDEV_PHUB_CFGMEM0_BASE EQU 0x40007600
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM0_SIZE
CYDEV_PHUB_CFGMEM0_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM0_CFG0
CYDEV_PHUB_CFGMEM0_CFG0 EQU 0x40007600
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM0_CFG1
CYDEV_PHUB_CFGMEM0_CFG1 EQU 0x40007604
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM1_BASE
CYDEV_PHUB_CFGMEM1_BASE EQU 0x40007608
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM1_SIZE
CYDEV_PHUB_CFGMEM1_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM1_CFG0
CYDEV_PHUB_CFGMEM1_CFG0 EQU 0x40007608
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM1_CFG1
CYDEV_PHUB_CFGMEM1_CFG1 EQU 0x4000760c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM2_BASE
CYDEV_PHUB_CFGMEM2_BASE EQU 0x40007610
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM2_SIZE
CYDEV_PHUB_CFGMEM2_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM2_CFG0
CYDEV_PHUB_CFGMEM2_CFG0 EQU 0x40007610
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM2_CFG1
CYDEV_PHUB_CFGMEM2_CFG1 EQU 0x40007614
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM3_BASE
CYDEV_PHUB_CFGMEM3_BASE EQU 0x40007618
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM3_SIZE
CYDEV_PHUB_CFGMEM3_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM3_CFG0
CYDEV_PHUB_CFGMEM3_CFG0 EQU 0x40007618
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM3_CFG1
CYDEV_PHUB_CFGMEM3_CFG1 EQU 0x4000761c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM4_BASE
CYDEV_PHUB_CFGMEM4_BASE EQU 0x40007620
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM4_SIZE
CYDEV_PHUB_CFGMEM4_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM4_CFG0
CYDEV_PHUB_CFGMEM4_CFG0 EQU 0x40007620
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM4_CFG1
CYDEV_PHUB_CFGMEM4_CFG1 EQU 0x40007624
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM5_BASE
CYDEV_PHUB_CFGMEM5_BASE EQU 0x40007628
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM5_SIZE
CYDEV_PHUB_CFGMEM5_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM5_CFG0
CYDEV_PHUB_CFGMEM5_CFG0 EQU 0x40007628
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM5_CFG1
CYDEV_PHUB_CFGMEM5_CFG1 EQU 0x4000762c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM6_BASE
CYDEV_PHUB_CFGMEM6_BASE EQU 0x40007630
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM6_SIZE
CYDEV_PHUB_CFGMEM6_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM6_CFG0
CYDEV_PHUB_CFGMEM6_CFG0 EQU 0x40007630
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM6_CFG1
CYDEV_PHUB_CFGMEM6_CFG1 EQU 0x40007634
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM7_BASE
CYDEV_PHUB_CFGMEM7_BASE EQU 0x40007638
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM7_SIZE
CYDEV_PHUB_CFGMEM7_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM7_CFG0
CYDEV_PHUB_CFGMEM7_CFG0 EQU 0x40007638
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM7_CFG1
CYDEV_PHUB_CFGMEM7_CFG1 EQU 0x4000763c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM8_BASE
CYDEV_PHUB_CFGMEM8_BASE EQU 0x40007640
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM8_SIZE
CYDEV_PHUB_CFGMEM8_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM8_CFG0
CYDEV_PHUB_CFGMEM8_CFG0 EQU 0x40007640
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM8_CFG1
CYDEV_PHUB_CFGMEM8_CFG1 EQU 0x40007644
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM9_BASE
CYDEV_PHUB_CFGMEM9_BASE EQU 0x40007648
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM9_SIZE
CYDEV_PHUB_CFGMEM9_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM9_CFG0
CYDEV_PHUB_CFGMEM9_CFG0 EQU 0x40007648
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM9_CFG1
CYDEV_PHUB_CFGMEM9_CFG1 EQU 0x4000764c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM10_BASE
CYDEV_PHUB_CFGMEM10_BASE EQU 0x40007650
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM10_SIZE
CYDEV_PHUB_CFGMEM10_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM10_CFG0
CYDEV_PHUB_CFGMEM10_CFG0 EQU 0x40007650
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM10_CFG1
CYDEV_PHUB_CFGMEM10_CFG1 EQU 0x40007654
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_CFGMEM11_BASE
CYDEV_PHUB_CFGMEM11_BASE EQU 0x40007658
    ENDIF
