MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv.inc
CYDEV_PHUB_TDMEM48_ORIG_TD1 EQU 0x40007984
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM49_BASE
CYDEV_PHUB_TDMEM49_BASE EQU 0x40007988
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM49_SIZE
CYDEV_PHUB_TDMEM49_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM49_ORIG_TD0
CYDEV_PHUB_TDMEM49_ORIG_TD0 EQU 0x40007988
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM49_ORIG_TD1
CYDEV_PHUB_TDMEM49_ORIG_TD1 EQU 0x4000798c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM50_BASE
CYDEV_PHUB_TDMEM50_BASE EQU 0x40007990
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM50_SIZE
CYDEV_PHUB_TDMEM50_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM50_ORIG_TD0
CYDEV_PHUB_TDMEM50_ORIG_TD0 EQU 0x40007990
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM50_ORIG_TD1
CYDEV_PHUB_TDMEM50_ORIG_TD1 EQU 0x40007994
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM51_BASE
CYDEV_PHUB_TDMEM51_BASE EQU 0x40007998
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM51_SIZE
CYDEV_PHUB_TDMEM51_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM51_ORIG_TD0
CYDEV_PHUB_TDMEM51_ORIG_TD0 EQU 0x40007998
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM51_ORIG_TD1
CYDEV_PHUB_TDMEM51_ORIG_TD1 EQU 0x4000799c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM52_BASE
CYDEV_PHUB_TDMEM52_BASE EQU 0x400079a0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM52_SIZE
CYDEV_PHUB_TDMEM52_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM52_ORIG_TD0
CYDEV_PHUB_TDMEM52_ORIG_TD0 EQU 0x400079a0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM52_ORIG_TD1
CYDEV_PHUB_TDMEM52_ORIG_TD1 EQU 0x400079a4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM53_BASE
CYDEV_PHUB_TDMEM53_BASE EQU 0x400079a8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM53_SIZE
CYDEV_PHUB_TDMEM53_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM53_ORIG_TD0
CYDEV_PHUB_TDMEM53_ORIG_TD0 EQU 0x400079a8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM53_ORIG_TD1
CYDEV_PHUB_TDMEM53_ORIG_TD1 EQU 0x400079ac
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM54_BASE
CYDEV_PHUB_TDMEM54_BASE EQU 0x400079b0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM54_SIZE
CYDEV_PHUB_TDMEM54_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM54_ORIG_TD0
CYDEV_PHUB_TDMEM54_ORIG_TD0 EQU 0x400079b0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM54_ORIG_TD1
CYDEV_PHUB_TDMEM54_ORIG_TD1 EQU 0x400079b4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM55_BASE
CYDEV_PHUB_TDMEM55_BASE EQU 0x400079b8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM55_SIZE
CYDEV_PHUB_TDMEM55_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM55_ORIG_TD0
CYDEV_PHUB_TDMEM55_ORIG_TD0 EQU 0x400079b8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM55_ORIG_TD1
CYDEV_PHUB_TDMEM55_ORIG_TD1 EQU 0x400079bc
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM56_BASE
CYDEV_PHUB_TDMEM56_BASE EQU 0x400079c0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM56_SIZE
CYDEV_PHUB_TDMEM56_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM56_ORIG_TD0
CYDEV_PHUB_TDMEM56_ORIG_TD0 EQU 0x400079c0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM56_ORIG_TD1
CYDEV_PHUB_TDMEM56_ORIG_TD1 EQU 0x400079c4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM57_BASE
CYDEV_PHUB_TDMEM57_BASE EQU 0x400079c8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM57_SIZE
CYDEV_PHUB_TDMEM57_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM57_ORIG_TD0
CYDEV_PHUB_TDMEM57_ORIG_TD0 EQU 0x400079c8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM57_ORIG_TD1
CYDEV_PHUB_TDMEM57_ORIG_TD1 EQU 0x400079cc
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM58_BASE
CYDEV_PHUB_TDMEM58_BASE EQU 0x400079d0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM58_SIZE
CYDEV_PHUB_TDMEM58_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM58_ORIG_TD0
CYDEV_PHUB_TDMEM58_ORIG_TD0 EQU 0x400079d0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM58_ORIG_TD1
CYDEV_PHUB_TDMEM58_ORIG_TD1 EQU 0x400079d4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM59_BASE
CYDEV_PHUB_TDMEM59_BASE EQU 0x400079d8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM59_SIZE
CYDEV_PHUB_TDMEM59_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM59_ORIG_TD0
CYDEV_PHUB_TDMEM59_ORIG_TD0 EQU 0x400079d8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM59_ORIG_TD1
CYDEV_PHUB_TDMEM59_ORIG_TD1 EQU 0x400079dc
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM60_BASE
CYDEV_PHUB_TDMEM60_BASE EQU 0x400079e0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM60_SIZE
CYDEV_PHUB_TDMEM60_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM60_ORIG_TD0
CYDEV_PHUB_TDMEM60_ORIG_TD0 EQU 0x400079e0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM60_ORIG_TD1
CYDEV_PHUB_TDMEM60_ORIG_TD1 EQU 0x400079e4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM61_BASE
CYDEV_PHUB_TDMEM61_BASE EQU 0x400079e8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM61_SIZE
CYDEV_PHUB_TDMEM61_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM61_ORIG_TD0
CYDEV_PHUB_TDMEM61_ORIG_TD0 EQU 0x400079e8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM61_ORIG_TD1
CYDEV_PHUB_TDMEM61_ORIG_TD1 EQU 0x400079ec
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM62_BASE
CYDEV_PHUB_TDMEM62_BASE EQU 0x400079f0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM62_SIZE
CYDEV_PHUB_TDMEM62_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM62_ORIG_TD0
CYDEV_PHUB_TDMEM62_ORIG_TD0 EQU 0x400079f0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM62_ORIG_TD1
CYDEV_PHUB_TDMEM62_ORIG_TD1 EQU 0x400079f4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM63_BASE
CYDEV_PHUB_TDMEM63_BASE EQU 0x400079f8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM63_SIZE
CYDEV_PHUB_TDMEM63_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM63_ORIG_TD0
CYDEV_PHUB_TDMEM63_ORIG_TD0 EQU 0x400079f8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM63_ORIG_TD1
CYDEV_PHUB_TDMEM63_ORIG_TD1 EQU 0x400079fc
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM64_BASE
CYDEV_PHUB_TDMEM64_BASE EQU 0x40007a00
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM64_SIZE
CYDEV_PHUB_TDMEM64_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM64_ORIG_TD0
CYDEV_PHUB_TDMEM64_ORIG_TD0 EQU 0x40007a00
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM64_ORIG_TD1
CYDEV_PHUB_TDMEM64_ORIG_TD1 EQU 0x40007a04
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM65_BASE
CYDEV_PHUB_TDMEM65_BASE EQU 0x40007a08
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM65_SIZE
CYDEV_PHUB_TDMEM65_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM65_ORIG_TD0
CYDEV_PHUB_TDMEM65_ORIG_TD0 EQU 0x40007a08
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM65_ORIG_TD1
CYDEV_PHUB_TDMEM65_ORIG_TD1 EQU 0x40007a0c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM66_BASE
CYDEV_PHUB_TDMEM66_BASE EQU 0x40007a10
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM66_SIZE
CYDEV_PHUB_TDMEM66_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM66_ORIG_TD0
CYDEV_PHUB_TDMEM66_ORIG_TD0 EQU 0x40007a10
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM66_ORIG_TD1
CYDEV_PHUB_TDMEM66_ORIG_TD1 EQU 0x40007a14
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM67_BASE
CYDEV_PHUB_TDMEM67_BASE EQU 0x40007a18
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM67_SIZE
CYDEV_PHUB_TDMEM67_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM67_ORIG_TD0
CYDEV_PHUB_TDMEM67_ORIG_TD0 EQU 0x40007a18
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM67_ORIG_TD1
CYDEV_PHUB_TDMEM67_ORIG_TD1 EQU 0x40007a1c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM68_BASE
CYDEV_PHUB_TDMEM68_BASE EQU 0x40007a20
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM68_SIZE
CYDEV_PHUB_TDMEM68_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM68_ORIG_TD0
CYDEV_PHUB_TDMEM68_ORIG_TD0 EQU 0x40007a20
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM68_ORIG_TD1
CYDEV_PHUB_TDMEM68_ORIG_TD1 EQU 0x40007a24
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM69_BASE
CYDEV_PHUB_TDMEM69_BASE EQU 0x40007a28
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM69_SIZE
CYDEV_PHUB_TDMEM69_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM69_ORIG_TD0
CYDEV_PHUB_TDMEM69_ORIG_TD0 EQU 0x40007a28
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM69_ORIG_TD1
CYDEV_PHUB_TDMEM69_ORIG_TD1 EQU 0x40007a2c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM70_BASE
CYDEV_PHUB_TDMEM70_BASE EQU 0x40007a30
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM70_SIZE
CYDEV_PHUB_TDMEM70_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM70_ORIG_TD0
CYDEV_PHUB_TDMEM70_ORIG_TD0 EQU 0x40007a30
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM70_ORIG_TD1
CYDEV_PHUB_TDMEM70_ORIG_TD1 EQU 0x40007a34
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM71_BASE
CYDEV_PHUB_TDMEM71_BASE EQU 0x40007a38
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM71_SIZE
CYDEV_PHUB_TDMEM71_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM71_ORIG_TD0
CYDEV_PHUB_TDMEM71_ORIG_TD0 EQU 0x40007a38
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM71_ORIG_TD1
CYDEV_PHUB_TDMEM71_ORIG_TD1 EQU 0x40007a3c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM72_BASE
CYDEV_PHUB_TDMEM72_BASE EQU 0x40007a40
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM72_SIZE
CYDEV_PHUB_TDMEM72_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM72_ORIG_TD0
CYDEV_PHUB_TDMEM72_ORIG_TD0 EQU 0x40007a40
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM72_ORIG_TD1
CYDEV_PHUB_TDMEM72_ORIG_TD1 EQU 0x40007a44
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM73_BASE
CYDEV_PHUB_TDMEM73_BASE EQU 0x40007a48
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM73_SIZE
CYDEV_PHUB_TDMEM73_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM73_ORIG_TD0
CYDEV_PHUB_TDMEM73_ORIG_TD0 EQU 0x40007a48
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM73_ORIG_TD1
CYDEV_PHUB_TDMEM73_ORIG_TD1 EQU 0x40007a4c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM74_BASE
CYDEV_PHUB_TDMEM74_BASE EQU 0x40007a50
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM74_SIZE
CYDEV_PHUB_TDMEM74_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM74_ORIG_TD0
CYDEV_PHUB_TDMEM74_ORIG_TD0 EQU 0x40007a50
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM74_ORIG_TD1
CYDEV_PHUB_TDMEM74_ORIG_TD1 EQU 0x40007a54
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM75_BASE
CYDEV_PHUB_TDMEM75_BASE EQU 0x40007a58
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM75_SIZE
CYDEV_PHUB_TDMEM75_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM75_ORIG_TD0
CYDEV_PHUB_TDMEM75_ORIG_TD0 EQU 0x40007a58
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM75_ORIG_TD1
CYDEV_PHUB_TDMEM75_ORIG_TD1 EQU 0x40007a5c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM76_BASE
CYDEV_PHUB_TDMEM76_BASE EQU 0x40007a60
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM76_SIZE
CYDEV_PHUB_TDMEM76_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM76_ORIG_TD0
CYDEV_PHUB_TDMEM76_ORIG_TD0 EQU 0x40007a60
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM76_ORIG_TD1
CYDEV_PHUB_TDMEM76_ORIG_TD1 EQU 0x40007a64
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM77_BASE
CYDEV_PHUB_TDMEM77_BASE EQU 0x40007a68
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM77_SIZE
CYDEV_PHUB_TDMEM77_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM77_ORIG_TD0
CYDEV_PHUB_TDMEM77_ORIG_TD0 EQU 0x40007a68
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM77_ORIG_TD1
CYDEV_PHUB_TDMEM77_ORIG_TD1 EQU 0x40007a6c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM78_BASE
CYDEV_PHUB_TDMEM78_BASE EQU 0x40007a70
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM78_SIZE
CYDEV_PHUB_TDMEM78_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM78_ORIG_TD0
CYDEV_PHUB_TDMEM78_ORIG_TD0 EQU 0x40007a70
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM78_ORIG_TD1
CYDEV_PHUB_TDMEM78_ORIG_TD1 EQU 0x40007a74
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM79_BASE
CYDEV_PHUB_TDMEM79_BASE EQU 0x40007a78
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM79_SIZE
CYDEV_PHUB_TDMEM79_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM79_ORIG_TD0
CYDEV_PHUB_TDMEM79_ORIG_TD0 EQU 0x40007a78
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM79_ORIG_TD1
CYDEV_PHUB_TDMEM79_ORIG_TD1 EQU 0x40007a7c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM80_BASE
CYDEV_PHUB_TDMEM80_BASE EQU 0x40007a80
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM80_SIZE
CYDEV_PHUB_TDMEM80_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM80_ORIG_TD0
CYDEV_PHUB_TDMEM80_ORIG_TD0 EQU 0x40007a80
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM80_ORIG_TD1
CYDEV_PHUB_TDMEM80_ORIG_TD1 EQU 0x40007a84
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM81_BASE
CYDEV_PHUB_TDMEM81_BASE EQU 0x40007a88
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM81_SIZE
CYDEV_PHUB_TDMEM81_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM81_ORIG_TD0
CYDEV_PHUB_TDMEM81_ORIG_TD0 EQU 0x40007a88
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM81_ORIG_TD1
CYDEV_PHUB_TDMEM81_ORIG_TD1 EQU 0x40007a8c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM82_BASE
CYDEV_PHUB_TDMEM82_BASE EQU 0x40007a90
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM82_SIZE
CYDEV_PHUB_TDMEM82_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM82_ORIG_TD0
CYDEV_PHUB_TDMEM82_ORIG_TD0 EQU 0x40007a90
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM82_ORIG_TD1
CYDEV_PHUB_TDMEM82_ORIG_TD1 EQU 0x40007a94
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM83_BASE
CYDEV_PHUB_TDMEM83_BASE EQU 0x40007a98
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM83_SIZE
CYDEV_PHUB_TDMEM83_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM83_ORIG_TD0
CYDEV_PHUB_TDMEM83_ORIG_TD0 EQU 0x40007a98
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM83_ORIG_TD1
CYDEV_PHUB_TDMEM83_ORIG_TD1 EQU 0x40007a9c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM84_BASE
CYDEV_PHUB_TDMEM84_BASE EQU 0x40007aa0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM84_SIZE
CYDEV_PHUB_TDMEM84_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM84_ORIG_TD0
CYDEV_PHUB_TDMEM84_ORIG_TD0 EQU 0x40007aa0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM84_ORIG_TD1
CYDEV_PHUB_TDMEM84_ORIG_TD1 EQU 0x40007aa4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM85_BASE
CYDEV_PHUB_TDMEM85_BASE EQU 0x40007aa8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM85_SIZE
CYDEV_PHUB_TDMEM85_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM85_ORIG_TD0
CYDEV_PHUB_TDMEM85_ORIG_TD0 EQU 0x40007aa8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM85_ORIG_TD1
CYDEV_PHUB_TDMEM85_ORIG_TD1 EQU 0x40007aac
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM86_BASE
CYDEV_PHUB_TDMEM86_BASE EQU 0x40007ab0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM86_SIZE
CYDEV_PHUB_TDMEM86_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM86_ORIG_TD0
CYDEV_PHUB_TDMEM86_ORIG_TD0 EQU 0x40007ab0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM86_ORIG_TD1
CYDEV_PHUB_TDMEM86_ORIG_TD1 EQU 0x40007ab4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM87_BASE
CYDEV_PHUB_TDMEM87_BASE EQU 0x40007ab8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM87_SIZE
CYDEV_PHUB_TDMEM87_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM87_ORIG_TD0
CYDEV_PHUB_TDMEM87_ORIG_TD0 EQU 0x40007ab8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM87_ORIG_TD1
CYDEV_PHUB_TDMEM87_ORIG_TD1 EQU 0x40007abc
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM88_BASE
CYDEV_PHUB_TDMEM88_BASE EQU 0x40007ac0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM88_SIZE
CYDEV_PHUB_TDMEM88_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM88_ORIG_TD0
CYDEV_PHUB_TDMEM88_ORIG_TD0 EQU 0x40007ac0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM88_ORIG_TD1
CYDEV_PHUB_TDMEM88_ORIG_TD1 EQU 0x40007ac4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM89_BASE
CYDEV_PHUB_TDMEM89_BASE EQU 0x40007ac8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM89_SIZE
CYDEV_PHUB_TDMEM89_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM89_ORIG_TD0
CYDEV_PHUB_TDMEM89_ORIG_TD0 EQU 0x40007ac8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM89_ORIG_TD1
CYDEV_PHUB_TDMEM89_ORIG_TD1 EQU 0x40007acc
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM90_BASE
CYDEV_PHUB_TDMEM90_BASE EQU 0x40007ad0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM90_SIZE
CYDEV_PHUB_TDMEM90_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM90_ORIG_TD0
CYDEV_PHUB_TDMEM90_ORIG_TD0 EQU 0x40007ad0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM90_ORIG_TD1
CYDEV_PHUB_TDMEM90_ORIG_TD1 EQU 0x40007ad4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM91_BASE
CYDEV_PHUB_TDMEM91_BASE EQU 0x40007ad8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM91_SIZE
CYDEV_PHUB_TDMEM91_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM91_ORIG_TD0
CYDEV_PHUB_TDMEM91_ORIG_TD0 EQU 0x40007ad8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM91_ORIG_TD1
CYDEV_PHUB_TDMEM91_ORIG_TD1 EQU 0x40007adc
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM92_BASE
CYDEV_PHUB_TDMEM92_BASE EQU 0x40007ae0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM92_SIZE
CYDEV_PHUB_TDMEM92_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM92_ORIG_TD0
CYDEV_PHUB_TDMEM92_ORIG_TD0 EQU 0x40007ae0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM92_ORIG_TD1
CYDEV_PHUB_TDMEM92_ORIG_TD1 EQU 0x40007ae4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM93_BASE
CYDEV_PHUB_TDMEM93_BASE EQU 0x40007ae8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM93_SIZE
CYDEV_PHUB_TDMEM93_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM93_ORIG_TD0
CYDEV_PHUB_TDMEM93_ORIG_TD0 EQU 0x40007ae8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM93_ORIG_TD1
CYDEV_PHUB_TDMEM93_ORIG_TD1 EQU 0x40007aec
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM94_BASE
CYDEV_PHUB_TDMEM94_BASE EQU 0x40007af0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM94_SIZE
CYDEV_PHUB_TDMEM94_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM94_ORIG_TD0
CYDEV_PHUB_TDMEM94_ORIG_TD0 EQU 0x40007af0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM94_ORIG_TD1
CYDEV_PHUB_TDMEM94_ORIG_TD1 EQU 0x40007af4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM95_BASE
CYDEV_PHUB_TDMEM95_BASE EQU 0x40007af8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM95_SIZE
CYDEV_PHUB_TDMEM95_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM95_ORIG_TD0
CYDEV_PHUB_TDMEM95_ORIG_TD0 EQU 0x40007af8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM95_ORIG_TD1
CYDEV_PHUB_TDMEM95_ORIG_TD1 EQU 0x40007afc
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM96_BASE
CYDEV_PHUB_TDMEM96_BASE EQU 0x40007b00
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM96_SIZE
CYDEV_PHUB_TDMEM96_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM96_ORIG_TD0
CYDEV_PHUB_TDMEM96_ORIG_TD0 EQU 0x40007b00
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM96_ORIG_TD1
CYDEV_PHUB_TDMEM96_ORIG_TD1 EQU 0x40007b04
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM97_BASE
CYDEV_PHUB_TDMEM97_BASE EQU 0x40007b08
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM97_SIZE
CYDEV_PHUB_TDMEM97_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM97_ORIG_TD0
CYDEV_PHUB_TDMEM97_ORIG_TD0 EQU 0x40007b08
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM97_ORIG_TD1
CYDEV_PHUB_TDMEM97_ORIG_TD1 EQU 0x40007b0c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM98_BASE
CYDEV_PHUB_TDMEM98_BASE EQU 0x40007b10
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM98_SIZE
CYDEV_PHUB_TDMEM98_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM98_ORIG_TD0
CYDEV_PHUB_TDMEM98_ORIG_TD0 EQU 0x40007b10
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM98_ORIG_TD1
CYDEV_PHUB_TDMEM98_ORIG_TD1 EQU 0x40007b14
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM99_BASE
CYDEV_PHUB_TDMEM99_BASE EQU 0x40007b18
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM99_SIZE
CYDEV_PHUB_TDMEM99_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM99_ORIG_TD0
CYDEV_PHUB_TDMEM99_ORIG_TD0 EQU 0x40007b18
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM99_ORIG_TD1
CYDEV_PHUB_TDMEM99_ORIG_TD1 EQU 0x40007b1c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM100_BASE
CYDEV_PHUB_TDMEM100_BASE EQU 0x40007b20
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM100_SIZE
CYDEV_PHUB_TDMEM100_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM100_ORIG_TD0
CYDEV_PHUB_TDMEM100_ORIG_TD0 EQU 0x40007b20
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM100_ORIG_TD1
CYDEV_PHUB_TDMEM100_ORIG_TD1 EQU 0x40007b24
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM101_BASE
CYDEV_PHUB_TDMEM101_BASE EQU 0x40007b28
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM101_SIZE
CYDEV_PHUB_TDMEM101_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM101_ORIG_TD0
CYDEV_PHUB_TDMEM101_ORIG_TD0 EQU 0x40007b28
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM101_ORIG_TD1
CYDEV_PHUB_TDMEM101_ORIG_TD1 EQU 0x40007b2c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM102_BASE
CYDEV_PHUB_TDMEM102_BASE EQU 0x40007b30
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM102_SIZE
CYDEV_PHUB_TDMEM102_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM102_ORIG_TD0
CYDEV_PHUB_TDMEM102_ORIG_TD0 EQU 0x40007b30
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM102_ORIG_TD1
CYDEV_PHUB_TDMEM102_ORIG_TD1 EQU 0x40007b34
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM103_BASE
CYDEV_PHUB_TDMEM103_BASE EQU 0x40007b38
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM103_SIZE
CYDEV_PHUB_TDMEM103_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM103_ORIG_TD0
CYDEV_PHUB_TDMEM103_ORIG_TD0 EQU 0x40007b38
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM103_ORIG_TD1
CYDEV_PHUB_TDMEM103_ORIG_TD1 EQU 0x40007b3c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM104_BASE
CYDEV_PHUB_TDMEM104_BASE EQU 0x40007b40
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM104_SIZE
CYDEV_PHUB_TDMEM104_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM104_ORIG_TD0
CYDEV_PHUB_TDMEM104_ORIG_TD0 EQU 0x40007b40
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM104_ORIG_TD1
CYDEV_PHUB_TDMEM104_ORIG_TD1 EQU 0x40007b44
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM105_BASE
CYDEV_PHUB_TDMEM105_BASE EQU 0x40007b48
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM105_SIZE
CYDEV_PHUB_TDMEM105_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM105_ORIG_TD0
CYDEV_PHUB_TDMEM105_ORIG_TD0 EQU 0x40007b48
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM105_ORIG_TD1
CYDEV_PHUB_TDMEM105_ORIG_TD1 EQU 0x40007b4c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM106_BASE
CYDEV_PHUB_TDMEM106_BASE EQU 0x40007b50
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM106_SIZE
CYDEV_PHUB_TDMEM106_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM106_ORIG_TD0
CYDEV_PHUB_TDMEM106_ORIG_TD0 EQU 0x40007b50
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM106_ORIG_TD1
CYDEV_PHUB_TDMEM106_ORIG_TD1 EQU 0x40007b54
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM107_BASE
CYDEV_PHUB_TDMEM107_BASE EQU 0x40007b58
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM107_SIZE
CYDEV_PHUB_TDMEM107_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM107_ORIG_TD0
CYDEV_PHUB_TDMEM107_ORIG_TD0 EQU 0x40007b58
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM107_ORIG_TD1
CYDEV_PHUB_TDMEM107_ORIG_TD1 EQU 0x40007b5c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM108_BASE
CYDEV_PHUB_TDMEM108_BASE EQU 0x40007b60
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM108_SIZE
CYDEV_PHUB_TDMEM108_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM108_ORIG_TD0
CYDEV_PHUB_TDMEM108_ORIG_TD0 EQU 0x40007b60
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM108_ORIG_TD1
CYDEV_PHUB_TDMEM108_ORIG_TD1 EQU 0x40007b64
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM109_BASE
CYDEV_PHUB_TDMEM109_BASE EQU 0x40007b68
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM109_SIZE
CYDEV_PHUB_TDMEM109_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM109_ORIG_TD0
CYDEV_PHUB_TDMEM109_ORIG_TD0 EQU 0x40007b68
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM109_ORIG_TD1
