MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv.inc
CYDEV_PHUB_TDMEM109_ORIG_TD1 EQU 0x40007b6c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM110_BASE
CYDEV_PHUB_TDMEM110_BASE EQU 0x40007b70
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM110_SIZE
CYDEV_PHUB_TDMEM110_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM110_ORIG_TD0
CYDEV_PHUB_TDMEM110_ORIG_TD0 EQU 0x40007b70
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM110_ORIG_TD1
CYDEV_PHUB_TDMEM110_ORIG_TD1 EQU 0x40007b74
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM111_BASE
CYDEV_PHUB_TDMEM111_BASE EQU 0x40007b78
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM111_SIZE
CYDEV_PHUB_TDMEM111_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM111_ORIG_TD0
CYDEV_PHUB_TDMEM111_ORIG_TD0 EQU 0x40007b78
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM111_ORIG_TD1
CYDEV_PHUB_TDMEM111_ORIG_TD1 EQU 0x40007b7c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM112_BASE
CYDEV_PHUB_TDMEM112_BASE EQU 0x40007b80
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM112_SIZE
CYDEV_PHUB_TDMEM112_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM112_ORIG_TD0
CYDEV_PHUB_TDMEM112_ORIG_TD0 EQU 0x40007b80
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM112_ORIG_TD1
CYDEV_PHUB_TDMEM112_ORIG_TD1 EQU 0x40007b84
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM113_BASE
CYDEV_PHUB_TDMEM113_BASE EQU 0x40007b88
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM113_SIZE
CYDEV_PHUB_TDMEM113_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM113_ORIG_TD0
CYDEV_PHUB_TDMEM113_ORIG_TD0 EQU 0x40007b88
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM113_ORIG_TD1
CYDEV_PHUB_TDMEM113_ORIG_TD1 EQU 0x40007b8c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM114_BASE
CYDEV_PHUB_TDMEM114_BASE EQU 0x40007b90
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM114_SIZE
CYDEV_PHUB_TDMEM114_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM114_ORIG_TD0
CYDEV_PHUB_TDMEM114_ORIG_TD0 EQU 0x40007b90
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM114_ORIG_TD1
CYDEV_PHUB_TDMEM114_ORIG_TD1 EQU 0x40007b94
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM115_BASE
CYDEV_PHUB_TDMEM115_BASE EQU 0x40007b98
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM115_SIZE
CYDEV_PHUB_TDMEM115_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM115_ORIG_TD0
CYDEV_PHUB_TDMEM115_ORIG_TD0 EQU 0x40007b98
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM115_ORIG_TD1
CYDEV_PHUB_TDMEM115_ORIG_TD1 EQU 0x40007b9c
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM116_BASE
CYDEV_PHUB_TDMEM116_BASE EQU 0x40007ba0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM116_SIZE
CYDEV_PHUB_TDMEM116_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM116_ORIG_TD0
CYDEV_PHUB_TDMEM116_ORIG_TD0 EQU 0x40007ba0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM116_ORIG_TD1
CYDEV_PHUB_TDMEM116_ORIG_TD1 EQU 0x40007ba4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM117_BASE
CYDEV_PHUB_TDMEM117_BASE EQU 0x40007ba8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM117_SIZE
CYDEV_PHUB_TDMEM117_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM117_ORIG_TD0
CYDEV_PHUB_TDMEM117_ORIG_TD0 EQU 0x40007ba8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM117_ORIG_TD1
CYDEV_PHUB_TDMEM117_ORIG_TD1 EQU 0x40007bac
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM118_BASE
CYDEV_PHUB_TDMEM118_BASE EQU 0x40007bb0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM118_SIZE
CYDEV_PHUB_TDMEM118_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM118_ORIG_TD0
CYDEV_PHUB_TDMEM118_ORIG_TD0 EQU 0x40007bb0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM118_ORIG_TD1
CYDEV_PHUB_TDMEM118_ORIG_TD1 EQU 0x40007bb4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM119_BASE
CYDEV_PHUB_TDMEM119_BASE EQU 0x40007bb8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM119_SIZE
CYDEV_PHUB_TDMEM119_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM119_ORIG_TD0
CYDEV_PHUB_TDMEM119_ORIG_TD0 EQU 0x40007bb8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM119_ORIG_TD1
CYDEV_PHUB_TDMEM119_ORIG_TD1 EQU 0x40007bbc
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM120_BASE
CYDEV_PHUB_TDMEM120_BASE EQU 0x40007bc0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM120_SIZE
CYDEV_PHUB_TDMEM120_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM120_ORIG_TD0
CYDEV_PHUB_TDMEM120_ORIG_TD0 EQU 0x40007bc0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM120_ORIG_TD1
CYDEV_PHUB_TDMEM120_ORIG_TD1 EQU 0x40007bc4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM121_BASE
CYDEV_PHUB_TDMEM121_BASE EQU 0x40007bc8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM121_SIZE
CYDEV_PHUB_TDMEM121_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM121_ORIG_TD0
CYDEV_PHUB_TDMEM121_ORIG_TD0 EQU 0x40007bc8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM121_ORIG_TD1
CYDEV_PHUB_TDMEM121_ORIG_TD1 EQU 0x40007bcc
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM122_BASE
CYDEV_PHUB_TDMEM122_BASE EQU 0x40007bd0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM122_SIZE
CYDEV_PHUB_TDMEM122_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM122_ORIG_TD0
CYDEV_PHUB_TDMEM122_ORIG_TD0 EQU 0x40007bd0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM122_ORIG_TD1
CYDEV_PHUB_TDMEM122_ORIG_TD1 EQU 0x40007bd4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM123_BASE
CYDEV_PHUB_TDMEM123_BASE EQU 0x40007bd8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM123_SIZE
CYDEV_PHUB_TDMEM123_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM123_ORIG_TD0
CYDEV_PHUB_TDMEM123_ORIG_TD0 EQU 0x40007bd8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM123_ORIG_TD1
CYDEV_PHUB_TDMEM123_ORIG_TD1 EQU 0x40007bdc
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM124_BASE
CYDEV_PHUB_TDMEM124_BASE EQU 0x40007be0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM124_SIZE
CYDEV_PHUB_TDMEM124_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM124_ORIG_TD0
CYDEV_PHUB_TDMEM124_ORIG_TD0 EQU 0x40007be0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM124_ORIG_TD1
CYDEV_PHUB_TDMEM124_ORIG_TD1 EQU 0x40007be4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM125_BASE
CYDEV_PHUB_TDMEM125_BASE EQU 0x40007be8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM125_SIZE
CYDEV_PHUB_TDMEM125_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM125_ORIG_TD0
CYDEV_PHUB_TDMEM125_ORIG_TD0 EQU 0x40007be8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM125_ORIG_TD1
CYDEV_PHUB_TDMEM125_ORIG_TD1 EQU 0x40007bec
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM126_BASE
CYDEV_PHUB_TDMEM126_BASE EQU 0x40007bf0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM126_SIZE
CYDEV_PHUB_TDMEM126_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM126_ORIG_TD0
CYDEV_PHUB_TDMEM126_ORIG_TD0 EQU 0x40007bf0
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM126_ORIG_TD1
CYDEV_PHUB_TDMEM126_ORIG_TD1 EQU 0x40007bf4
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM127_BASE
CYDEV_PHUB_TDMEM127_BASE EQU 0x40007bf8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM127_SIZE
CYDEV_PHUB_TDMEM127_SIZE EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM127_ORIG_TD0
CYDEV_PHUB_TDMEM127_ORIG_TD0 EQU 0x40007bf8
    ENDIF
    IF :LNOT::DEF:CYDEV_PHUB_TDMEM127_ORIG_TD1
CYDEV_PHUB_TDMEM127_ORIG_TD1 EQU 0x40007bfc
    ENDIF
    IF :LNOT::DEF:CYDEV_EE_BASE
CYDEV_EE_BASE EQU 0x40008000
    ENDIF
    IF :LNOT::DEF:CYDEV_EE_SIZE
CYDEV_EE_SIZE EQU 0x00000800
    ENDIF
    IF :LNOT::DEF:CYDEV_EE_DATA_MBASE
CYDEV_EE_DATA_MBASE EQU 0x40008000
    ENDIF
    IF :LNOT::DEF:CYDEV_EE_DATA_MSIZE
CYDEV_EE_DATA_MSIZE EQU 0x00000800
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_BASE
CYDEV_CAN0_BASE EQU 0x4000a000
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_SIZE
CYDEV_CAN0_SIZE EQU 0x000002a0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_CSR_BASE
CYDEV_CAN0_CSR_BASE EQU 0x4000a000
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_CSR_SIZE
CYDEV_CAN0_CSR_SIZE EQU 0x00000018
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_CSR_INT_SR
CYDEV_CAN0_CSR_INT_SR EQU 0x4000a000
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_CSR_INT_EN
CYDEV_CAN0_CSR_INT_EN EQU 0x4000a004
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_CSR_BUF_SR
CYDEV_CAN0_CSR_BUF_SR EQU 0x4000a008
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_CSR_ERR_SR
CYDEV_CAN0_CSR_ERR_SR EQU 0x4000a00c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_CSR_CMD
CYDEV_CAN0_CSR_CMD EQU 0x4000a010
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_CSR_CFG
CYDEV_CAN0_CSR_CFG EQU 0x4000a014
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX0_BASE
CYDEV_CAN0_TX0_BASE EQU 0x4000a020
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX0_SIZE
CYDEV_CAN0_TX0_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX0_CMD
CYDEV_CAN0_TX0_CMD EQU 0x4000a020
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX0_ID
CYDEV_CAN0_TX0_ID EQU 0x4000a024
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX0_DH
CYDEV_CAN0_TX0_DH EQU 0x4000a028
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX0_DL
CYDEV_CAN0_TX0_DL EQU 0x4000a02c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX1_BASE
CYDEV_CAN0_TX1_BASE EQU 0x4000a030
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX1_SIZE
CYDEV_CAN0_TX1_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX1_CMD
CYDEV_CAN0_TX1_CMD EQU 0x4000a030
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX1_ID
CYDEV_CAN0_TX1_ID EQU 0x4000a034
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX1_DH
CYDEV_CAN0_TX1_DH EQU 0x4000a038
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX1_DL
CYDEV_CAN0_TX1_DL EQU 0x4000a03c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX2_BASE
CYDEV_CAN0_TX2_BASE EQU 0x4000a040
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX2_SIZE
CYDEV_CAN0_TX2_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX2_CMD
CYDEV_CAN0_TX2_CMD EQU 0x4000a040
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX2_ID
CYDEV_CAN0_TX2_ID EQU 0x4000a044
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX2_DH
CYDEV_CAN0_TX2_DH EQU 0x4000a048
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX2_DL
CYDEV_CAN0_TX2_DL EQU 0x4000a04c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX3_BASE
CYDEV_CAN0_TX3_BASE EQU 0x4000a050
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX3_SIZE
CYDEV_CAN0_TX3_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX3_CMD
CYDEV_CAN0_TX3_CMD EQU 0x4000a050
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX3_ID
CYDEV_CAN0_TX3_ID EQU 0x4000a054
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX3_DH
CYDEV_CAN0_TX3_DH EQU 0x4000a058
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX3_DL
CYDEV_CAN0_TX3_DL EQU 0x4000a05c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX4_BASE
CYDEV_CAN0_TX4_BASE EQU 0x4000a060
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX4_SIZE
CYDEV_CAN0_TX4_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX4_CMD
CYDEV_CAN0_TX4_CMD EQU 0x4000a060
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX4_ID
CYDEV_CAN0_TX4_ID EQU 0x4000a064
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX4_DH
CYDEV_CAN0_TX4_DH EQU 0x4000a068
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX4_DL
CYDEV_CAN0_TX4_DL EQU 0x4000a06c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX5_BASE
CYDEV_CAN0_TX5_BASE EQU 0x4000a070
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX5_SIZE
CYDEV_CAN0_TX5_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX5_CMD
CYDEV_CAN0_TX5_CMD EQU 0x4000a070
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX5_ID
CYDEV_CAN0_TX5_ID EQU 0x4000a074
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX5_DH
CYDEV_CAN0_TX5_DH EQU 0x4000a078
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX5_DL
CYDEV_CAN0_TX5_DL EQU 0x4000a07c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX6_BASE
CYDEV_CAN0_TX6_BASE EQU 0x4000a080
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX6_SIZE
CYDEV_CAN0_TX6_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX6_CMD
CYDEV_CAN0_TX6_CMD EQU 0x4000a080
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX6_ID
CYDEV_CAN0_TX6_ID EQU 0x4000a084
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX6_DH
CYDEV_CAN0_TX6_DH EQU 0x4000a088
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX6_DL
CYDEV_CAN0_TX6_DL EQU 0x4000a08c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX7_BASE
CYDEV_CAN0_TX7_BASE EQU 0x4000a090
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX7_SIZE
CYDEV_CAN0_TX7_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX7_CMD
CYDEV_CAN0_TX7_CMD EQU 0x4000a090
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX7_ID
CYDEV_CAN0_TX7_ID EQU 0x4000a094
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX7_DH
CYDEV_CAN0_TX7_DH EQU 0x4000a098
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_TX7_DL
CYDEV_CAN0_TX7_DL EQU 0x4000a09c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX0_BASE
CYDEV_CAN0_RX0_BASE EQU 0x4000a0a0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX0_SIZE
CYDEV_CAN0_RX0_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX0_CMD
CYDEV_CAN0_RX0_CMD EQU 0x4000a0a0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX0_ID
CYDEV_CAN0_RX0_ID EQU 0x4000a0a4
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX0_DH
CYDEV_CAN0_RX0_DH EQU 0x4000a0a8
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX0_DL
CYDEV_CAN0_RX0_DL EQU 0x4000a0ac
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX0_AMR
CYDEV_CAN0_RX0_AMR EQU 0x4000a0b0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX0_ACR
CYDEV_CAN0_RX0_ACR EQU 0x4000a0b4
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX0_AMRD
CYDEV_CAN0_RX0_AMRD EQU 0x4000a0b8
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX0_ACRD
CYDEV_CAN0_RX0_ACRD EQU 0x4000a0bc
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX1_BASE
CYDEV_CAN0_RX1_BASE EQU 0x4000a0c0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX1_SIZE
CYDEV_CAN0_RX1_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX1_CMD
CYDEV_CAN0_RX1_CMD EQU 0x4000a0c0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX1_ID
CYDEV_CAN0_RX1_ID EQU 0x4000a0c4
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX1_DH
CYDEV_CAN0_RX1_DH EQU 0x4000a0c8
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX1_DL
CYDEV_CAN0_RX1_DL EQU 0x4000a0cc
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX1_AMR
CYDEV_CAN0_RX1_AMR EQU 0x4000a0d0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX1_ACR
CYDEV_CAN0_RX1_ACR EQU 0x4000a0d4
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX1_AMRD
CYDEV_CAN0_RX1_AMRD EQU 0x4000a0d8
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX1_ACRD
CYDEV_CAN0_RX1_ACRD EQU 0x4000a0dc
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX2_BASE
CYDEV_CAN0_RX2_BASE EQU 0x4000a0e0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX2_SIZE
CYDEV_CAN0_RX2_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX2_CMD
CYDEV_CAN0_RX2_CMD EQU 0x4000a0e0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX2_ID
CYDEV_CAN0_RX2_ID EQU 0x4000a0e4
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX2_DH
CYDEV_CAN0_RX2_DH EQU 0x4000a0e8
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX2_DL
CYDEV_CAN0_RX2_DL EQU 0x4000a0ec
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX2_AMR
CYDEV_CAN0_RX2_AMR EQU 0x4000a0f0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX2_ACR
CYDEV_CAN0_RX2_ACR EQU 0x4000a0f4
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX2_AMRD
CYDEV_CAN0_RX2_AMRD EQU 0x4000a0f8
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX2_ACRD
CYDEV_CAN0_RX2_ACRD EQU 0x4000a0fc
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX3_BASE
CYDEV_CAN0_RX3_BASE EQU 0x4000a100
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX3_SIZE
CYDEV_CAN0_RX3_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX3_CMD
CYDEV_CAN0_RX3_CMD EQU 0x4000a100
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX3_ID
CYDEV_CAN0_RX3_ID EQU 0x4000a104
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX3_DH
CYDEV_CAN0_RX3_DH EQU 0x4000a108
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX3_DL
CYDEV_CAN0_RX3_DL EQU 0x4000a10c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX3_AMR
CYDEV_CAN0_RX3_AMR EQU 0x4000a110
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX3_ACR
CYDEV_CAN0_RX3_ACR EQU 0x4000a114
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX3_AMRD
CYDEV_CAN0_RX3_AMRD EQU 0x4000a118
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX3_ACRD
CYDEV_CAN0_RX3_ACRD EQU 0x4000a11c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX4_BASE
CYDEV_CAN0_RX4_BASE EQU 0x4000a120
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX4_SIZE
CYDEV_CAN0_RX4_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX4_CMD
CYDEV_CAN0_RX4_CMD EQU 0x4000a120
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX4_ID
CYDEV_CAN0_RX4_ID EQU 0x4000a124
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX4_DH
CYDEV_CAN0_RX4_DH EQU 0x4000a128
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX4_DL
CYDEV_CAN0_RX4_DL EQU 0x4000a12c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX4_AMR
CYDEV_CAN0_RX4_AMR EQU 0x4000a130
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX4_ACR
CYDEV_CAN0_RX4_ACR EQU 0x4000a134
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX4_AMRD
CYDEV_CAN0_RX4_AMRD EQU 0x4000a138
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX4_ACRD
CYDEV_CAN0_RX4_ACRD EQU 0x4000a13c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX5_BASE
CYDEV_CAN0_RX5_BASE EQU 0x4000a140
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX5_SIZE
CYDEV_CAN0_RX5_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX5_CMD
CYDEV_CAN0_RX5_CMD EQU 0x4000a140
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX5_ID
CYDEV_CAN0_RX5_ID EQU 0x4000a144
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX5_DH
CYDEV_CAN0_RX5_DH EQU 0x4000a148
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX5_DL
CYDEV_CAN0_RX5_DL EQU 0x4000a14c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX5_AMR
CYDEV_CAN0_RX5_AMR EQU 0x4000a150
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX5_ACR
CYDEV_CAN0_RX5_ACR EQU 0x4000a154
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX5_AMRD
CYDEV_CAN0_RX5_AMRD EQU 0x4000a158
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX5_ACRD
CYDEV_CAN0_RX5_ACRD EQU 0x4000a15c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX6_BASE
CYDEV_CAN0_RX6_BASE EQU 0x4000a160
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX6_SIZE
CYDEV_CAN0_RX6_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX6_CMD
CYDEV_CAN0_RX6_CMD EQU 0x4000a160
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX6_ID
CYDEV_CAN0_RX6_ID EQU 0x4000a164
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX6_DH
CYDEV_CAN0_RX6_DH EQU 0x4000a168
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX6_DL
CYDEV_CAN0_RX6_DL EQU 0x4000a16c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX6_AMR
CYDEV_CAN0_RX6_AMR EQU 0x4000a170
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX6_ACR
CYDEV_CAN0_RX6_ACR EQU 0x4000a174
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX6_AMRD
CYDEV_CAN0_RX6_AMRD EQU 0x4000a178
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX6_ACRD
CYDEV_CAN0_RX6_ACRD EQU 0x4000a17c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX7_BASE
CYDEV_CAN0_RX7_BASE EQU 0x4000a180
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX7_SIZE
CYDEV_CAN0_RX7_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX7_CMD
CYDEV_CAN0_RX7_CMD EQU 0x4000a180
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX7_ID
CYDEV_CAN0_RX7_ID EQU 0x4000a184
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX7_DH
CYDEV_CAN0_RX7_DH EQU 0x4000a188
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX7_DL
CYDEV_CAN0_RX7_DL EQU 0x4000a18c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX7_AMR
CYDEV_CAN0_RX7_AMR EQU 0x4000a190
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX7_ACR
CYDEV_CAN0_RX7_ACR EQU 0x4000a194
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX7_AMRD
CYDEV_CAN0_RX7_AMRD EQU 0x4000a198
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX7_ACRD
CYDEV_CAN0_RX7_ACRD EQU 0x4000a19c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX8_BASE
CYDEV_CAN0_RX8_BASE EQU 0x4000a1a0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX8_SIZE
CYDEV_CAN0_RX8_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX8_CMD
CYDEV_CAN0_RX8_CMD EQU 0x4000a1a0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX8_ID
CYDEV_CAN0_RX8_ID EQU 0x4000a1a4
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX8_DH
CYDEV_CAN0_RX8_DH EQU 0x4000a1a8
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX8_DL
CYDEV_CAN0_RX8_DL EQU 0x4000a1ac
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX8_AMR
CYDEV_CAN0_RX8_AMR EQU 0x4000a1b0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX8_ACR
CYDEV_CAN0_RX8_ACR EQU 0x4000a1b4
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX8_AMRD
CYDEV_CAN0_RX8_AMRD EQU 0x4000a1b8
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX8_ACRD
CYDEV_CAN0_RX8_ACRD EQU 0x4000a1bc
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX9_BASE
CYDEV_CAN0_RX9_BASE EQU 0x4000a1c0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX9_SIZE
CYDEV_CAN0_RX9_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX9_CMD
CYDEV_CAN0_RX9_CMD EQU 0x4000a1c0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX9_ID
CYDEV_CAN0_RX9_ID EQU 0x4000a1c4
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX9_DH
CYDEV_CAN0_RX9_DH EQU 0x4000a1c8
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX9_DL
CYDEV_CAN0_RX9_DL EQU 0x4000a1cc
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX9_AMR
CYDEV_CAN0_RX9_AMR EQU 0x4000a1d0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX9_ACR
CYDEV_CAN0_RX9_ACR EQU 0x4000a1d4
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX9_AMRD
CYDEV_CAN0_RX9_AMRD EQU 0x4000a1d8
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX9_ACRD
CYDEV_CAN0_RX9_ACRD EQU 0x4000a1dc
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX10_BASE
CYDEV_CAN0_RX10_BASE EQU 0x4000a1e0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX10_SIZE
CYDEV_CAN0_RX10_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX10_CMD
CYDEV_CAN0_RX10_CMD EQU 0x4000a1e0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX10_ID
CYDEV_CAN0_RX10_ID EQU 0x4000a1e4
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX10_DH
CYDEV_CAN0_RX10_DH EQU 0x4000a1e8
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX10_DL
CYDEV_CAN0_RX10_DL EQU 0x4000a1ec
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX10_AMR
CYDEV_CAN0_RX10_AMR EQU 0x4000a1f0
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX10_ACR
CYDEV_CAN0_RX10_ACR EQU 0x4000a1f4
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX10_AMRD
CYDEV_CAN0_RX10_AMRD EQU 0x4000a1f8
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX10_ACRD
CYDEV_CAN0_RX10_ACRD EQU 0x4000a1fc
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX11_BASE
CYDEV_CAN0_RX11_BASE EQU 0x4000a200
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX11_SIZE
CYDEV_CAN0_RX11_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX11_CMD
CYDEV_CAN0_RX11_CMD EQU 0x4000a200
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX11_ID
CYDEV_CAN0_RX11_ID EQU 0x4000a204
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX11_DH
CYDEV_CAN0_RX11_DH EQU 0x4000a208
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX11_DL
CYDEV_CAN0_RX11_DL EQU 0x4000a20c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX11_AMR
CYDEV_CAN0_RX11_AMR EQU 0x4000a210
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX11_ACR
CYDEV_CAN0_RX11_ACR EQU 0x4000a214
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX11_AMRD
CYDEV_CAN0_RX11_AMRD EQU 0x4000a218
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX11_ACRD
CYDEV_CAN0_RX11_ACRD EQU 0x4000a21c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX12_BASE
CYDEV_CAN0_RX12_BASE EQU 0x4000a220
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX12_SIZE
CYDEV_CAN0_RX12_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX12_CMD
CYDEV_CAN0_RX12_CMD EQU 0x4000a220
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX12_ID
CYDEV_CAN0_RX12_ID EQU 0x4000a224
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX12_DH
CYDEV_CAN0_RX12_DH EQU 0x4000a228
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX12_DL
CYDEV_CAN0_RX12_DL EQU 0x4000a22c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX12_AMR
CYDEV_CAN0_RX12_AMR EQU 0x4000a230
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX12_ACR
CYDEV_CAN0_RX12_ACR EQU 0x4000a234
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX12_AMRD
CYDEV_CAN0_RX12_AMRD EQU 0x4000a238
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX12_ACRD
CYDEV_CAN0_RX12_ACRD EQU 0x4000a23c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX13_BASE
CYDEV_CAN0_RX13_BASE EQU 0x4000a240
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX13_SIZE
CYDEV_CAN0_RX13_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX13_CMD
CYDEV_CAN0_RX13_CMD EQU 0x4000a240
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX13_ID
CYDEV_CAN0_RX13_ID EQU 0x4000a244
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX13_DH
CYDEV_CAN0_RX13_DH EQU 0x4000a248
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX13_DL
CYDEV_CAN0_RX13_DL EQU 0x4000a24c
    ENDIF
