MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv.inc
    IF :LNOT::DEF:CYDEV_CAN0_RX13_AMR
CYDEV_CAN0_RX13_AMR EQU 0x4000a250
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX13_ACR
CYDEV_CAN0_RX13_ACR EQU 0x4000a254
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX13_AMRD
CYDEV_CAN0_RX13_AMRD EQU 0x4000a258
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX13_ACRD
CYDEV_CAN0_RX13_ACRD EQU 0x4000a25c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX14_BASE
CYDEV_CAN0_RX14_BASE EQU 0x4000a260
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX14_SIZE
CYDEV_CAN0_RX14_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX14_CMD
CYDEV_CAN0_RX14_CMD EQU 0x4000a260
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX14_ID
CYDEV_CAN0_RX14_ID EQU 0x4000a264
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX14_DH
CYDEV_CAN0_RX14_DH EQU 0x4000a268
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX14_DL
CYDEV_CAN0_RX14_DL EQU 0x4000a26c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX14_AMR
CYDEV_CAN0_RX14_AMR EQU 0x4000a270
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX14_ACR
CYDEV_CAN0_RX14_ACR EQU 0x4000a274
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX14_AMRD
CYDEV_CAN0_RX14_AMRD EQU 0x4000a278
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX14_ACRD
CYDEV_CAN0_RX14_ACRD EQU 0x4000a27c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX15_BASE
CYDEV_CAN0_RX15_BASE EQU 0x4000a280
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX15_SIZE
CYDEV_CAN0_RX15_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX15_CMD
CYDEV_CAN0_RX15_CMD EQU 0x4000a280
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX15_ID
CYDEV_CAN0_RX15_ID EQU 0x4000a284
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX15_DH
CYDEV_CAN0_RX15_DH EQU 0x4000a288
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX15_DL
CYDEV_CAN0_RX15_DL EQU 0x4000a28c
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX15_AMR
CYDEV_CAN0_RX15_AMR EQU 0x4000a290
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX15_ACR
CYDEV_CAN0_RX15_ACR EQU 0x4000a294
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX15_AMRD
CYDEV_CAN0_RX15_AMRD EQU 0x4000a298
    ENDIF
    IF :LNOT::DEF:CYDEV_CAN0_RX15_ACRD
CYDEV_CAN0_RX15_ACRD EQU 0x4000a29c
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_BASE
CYDEV_DFB0_BASE EQU 0x4000c000
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_SIZE
CYDEV_DFB0_SIZE EQU 0x000007b5
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_DPA_SRAM_BASE
CYDEV_DFB0_DPA_SRAM_BASE EQU 0x4000c000
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_DPA_SRAM_SIZE
CYDEV_DFB0_DPA_SRAM_SIZE EQU 0x00000200
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_DPA_SRAM_DATA_MBASE
CYDEV_DFB0_DPA_SRAM_DATA_MBASE EQU 0x4000c000
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_DPA_SRAM_DATA_MSIZE
CYDEV_DFB0_DPA_SRAM_DATA_MSIZE EQU 0x00000200
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_DPB_SRAM_BASE
CYDEV_DFB0_DPB_SRAM_BASE EQU 0x4000c200
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_DPB_SRAM_SIZE
CYDEV_DFB0_DPB_SRAM_SIZE EQU 0x00000200
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_DPB_SRAM_DATA_MBASE
CYDEV_DFB0_DPB_SRAM_DATA_MBASE EQU 0x4000c200
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_DPB_SRAM_DATA_MSIZE
CYDEV_DFB0_DPB_SRAM_DATA_MSIZE EQU 0x00000200
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_CSA_SRAM_BASE
CYDEV_DFB0_CSA_SRAM_BASE EQU 0x4000c400
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_CSA_SRAM_SIZE
CYDEV_DFB0_CSA_SRAM_SIZE EQU 0x00000100
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_CSA_SRAM_DATA_MBASE
CYDEV_DFB0_CSA_SRAM_DATA_MBASE EQU 0x4000c400
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_CSA_SRAM_DATA_MSIZE
CYDEV_DFB0_CSA_SRAM_DATA_MSIZE EQU 0x00000100
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_CSB_SRAM_BASE
CYDEV_DFB0_CSB_SRAM_BASE EQU 0x4000c500
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_CSB_SRAM_SIZE
CYDEV_DFB0_CSB_SRAM_SIZE EQU 0x00000100
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_CSB_SRAM_DATA_MBASE
CYDEV_DFB0_CSB_SRAM_DATA_MBASE EQU 0x4000c500
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_CSB_SRAM_DATA_MSIZE
CYDEV_DFB0_CSB_SRAM_DATA_MSIZE EQU 0x00000100
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_FSM_SRAM_BASE
CYDEV_DFB0_FSM_SRAM_BASE EQU 0x4000c600
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_FSM_SRAM_SIZE
CYDEV_DFB0_FSM_SRAM_SIZE EQU 0x00000100
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_FSM_SRAM_DATA_MBASE
CYDEV_DFB0_FSM_SRAM_DATA_MBASE EQU 0x4000c600
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_FSM_SRAM_DATA_MSIZE
CYDEV_DFB0_FSM_SRAM_DATA_MSIZE EQU 0x00000100
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_ACU_SRAM_BASE
CYDEV_DFB0_ACU_SRAM_BASE EQU 0x4000c700
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_ACU_SRAM_SIZE
CYDEV_DFB0_ACU_SRAM_SIZE EQU 0x00000040
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_ACU_SRAM_DATA_MBASE
CYDEV_DFB0_ACU_SRAM_DATA_MBASE EQU 0x4000c700
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_ACU_SRAM_DATA_MSIZE
CYDEV_DFB0_ACU_SRAM_DATA_MSIZE EQU 0x00000040
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_CR
CYDEV_DFB0_CR EQU 0x4000c780
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_SR
CYDEV_DFB0_SR EQU 0x4000c784
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_RAM_EN
CYDEV_DFB0_RAM_EN EQU 0x4000c788
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_RAM_DIR
CYDEV_DFB0_RAM_DIR EQU 0x4000c78c
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_SEMA
CYDEV_DFB0_SEMA EQU 0x4000c790
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_DSI_CTRL
CYDEV_DFB0_DSI_CTRL EQU 0x4000c794
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_INT_CTRL
CYDEV_DFB0_INT_CTRL EQU 0x4000c798
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_DMA_CTRL
CYDEV_DFB0_DMA_CTRL EQU 0x4000c79c
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_STAGEA
CYDEV_DFB0_STAGEA EQU 0x4000c7a0
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_STAGEAM
CYDEV_DFB0_STAGEAM EQU 0x4000c7a1
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_STAGEAH
CYDEV_DFB0_STAGEAH EQU 0x4000c7a2
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_STAGEB
CYDEV_DFB0_STAGEB EQU 0x4000c7a4
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_STAGEBM
CYDEV_DFB0_STAGEBM EQU 0x4000c7a5
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_STAGEBH
CYDEV_DFB0_STAGEBH EQU 0x4000c7a6
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_HOLDA
CYDEV_DFB0_HOLDA EQU 0x4000c7a8
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_HOLDAM
CYDEV_DFB0_HOLDAM EQU 0x4000c7a9
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_HOLDAH
CYDEV_DFB0_HOLDAH EQU 0x4000c7aa
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_HOLDAS
CYDEV_DFB0_HOLDAS EQU 0x4000c7ab
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_HOLDB
CYDEV_DFB0_HOLDB EQU 0x4000c7ac
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_HOLDBM
CYDEV_DFB0_HOLDBM EQU 0x4000c7ad
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_HOLDBH
CYDEV_DFB0_HOLDBH EQU 0x4000c7ae
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_HOLDBS
CYDEV_DFB0_HOLDBS EQU 0x4000c7af
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_COHER
CYDEV_DFB0_COHER EQU 0x4000c7b0
    ENDIF
    IF :LNOT::DEF:CYDEV_DFB0_DALIGN
CYDEV_DFB0_DALIGN EQU 0x4000c7b4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BASE
CYDEV_UCFG_BASE EQU 0x40010000
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_SIZE
CYDEV_UCFG_SIZE EQU 0x00005040
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_BASE
CYDEV_UCFG_B0_BASE EQU 0x40010000
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_SIZE
CYDEV_UCFG_B0_SIZE EQU 0x00000fef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_BASE
CYDEV_UCFG_B0_P0_BASE EQU 0x40010000
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_SIZE
CYDEV_UCFG_B0_P0_SIZE EQU 0x000001ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_BASE
CYDEV_UCFG_B0_P0_U0_BASE EQU 0x40010000
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_SIZE
CYDEV_UCFG_B0_P0_U0_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_PLD_IT0
CYDEV_UCFG_B0_P0_U0_PLD_IT0 EQU 0x40010000
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_PLD_IT1
CYDEV_UCFG_B0_P0_U0_PLD_IT1 EQU 0x40010004
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_PLD_IT2
CYDEV_UCFG_B0_P0_U0_PLD_IT2 EQU 0x40010008
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_PLD_IT3
CYDEV_UCFG_B0_P0_U0_PLD_IT3 EQU 0x4001000c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_PLD_IT4
CYDEV_UCFG_B0_P0_U0_PLD_IT4 EQU 0x40010010
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_PLD_IT5
CYDEV_UCFG_B0_P0_U0_PLD_IT5 EQU 0x40010014
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_PLD_IT6
CYDEV_UCFG_B0_P0_U0_PLD_IT6 EQU 0x40010018
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_PLD_IT7
CYDEV_UCFG_B0_P0_U0_PLD_IT7 EQU 0x4001001c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_PLD_IT8
CYDEV_UCFG_B0_P0_U0_PLD_IT8 EQU 0x40010020
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_PLD_IT9
CYDEV_UCFG_B0_P0_U0_PLD_IT9 EQU 0x40010024
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_PLD_IT10
CYDEV_UCFG_B0_P0_U0_PLD_IT10 EQU 0x40010028
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_PLD_IT11
CYDEV_UCFG_B0_P0_U0_PLD_IT11 EQU 0x4001002c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_PLD_ORT0
CYDEV_UCFG_B0_P0_U0_PLD_ORT0 EQU 0x40010030
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_PLD_ORT1
CYDEV_UCFG_B0_P0_U0_PLD_ORT1 EQU 0x40010032
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_PLD_ORT2
CYDEV_UCFG_B0_P0_U0_PLD_ORT2 EQU 0x40010034
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_PLD_ORT3
CYDEV_UCFG_B0_P0_U0_PLD_ORT3 EQU 0x40010036
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_MC_CFG_CEN_CONST
CYDEV_UCFG_B0_P0_U0_MC_CFG_CEN_CONST EQU 0x40010038
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_MC_CFG_XORFB
CYDEV_UCFG_B0_P0_U0_MC_CFG_XORFB EQU 0x4001003a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_MC_CFG_SET_RESET
CYDEV_UCFG_B0_P0_U0_MC_CFG_SET_RESET EQU 0x4001003c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_MC_CFG_BYPASS
CYDEV_UCFG_B0_P0_U0_MC_CFG_BYPASS EQU 0x4001003e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG0
CYDEV_UCFG_B0_P0_U0_CFG0 EQU 0x40010040
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG1
CYDEV_UCFG_B0_P0_U0_CFG1 EQU 0x40010041
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG2
CYDEV_UCFG_B0_P0_U0_CFG2 EQU 0x40010042
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG3
CYDEV_UCFG_B0_P0_U0_CFG3 EQU 0x40010043
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG4
CYDEV_UCFG_B0_P0_U0_CFG4 EQU 0x40010044
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG5
CYDEV_UCFG_B0_P0_U0_CFG5 EQU 0x40010045
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG6
CYDEV_UCFG_B0_P0_U0_CFG6 EQU 0x40010046
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG7
CYDEV_UCFG_B0_P0_U0_CFG7 EQU 0x40010047
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG8
CYDEV_UCFG_B0_P0_U0_CFG8 EQU 0x40010048
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG9
CYDEV_UCFG_B0_P0_U0_CFG9 EQU 0x40010049
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG10
CYDEV_UCFG_B0_P0_U0_CFG10 EQU 0x4001004a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG11
CYDEV_UCFG_B0_P0_U0_CFG11 EQU 0x4001004b
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG12
CYDEV_UCFG_B0_P0_U0_CFG12 EQU 0x4001004c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG13
CYDEV_UCFG_B0_P0_U0_CFG13 EQU 0x4001004d
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG14
CYDEV_UCFG_B0_P0_U0_CFG14 EQU 0x4001004e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG15
CYDEV_UCFG_B0_P0_U0_CFG15 EQU 0x4001004f
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG16
CYDEV_UCFG_B0_P0_U0_CFG16 EQU 0x40010050
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG20
CYDEV_UCFG_B0_P0_U0_CFG20 EQU 0x40010054
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG21
CYDEV_UCFG_B0_P0_U0_CFG21 EQU 0x40010055
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG22
CYDEV_UCFG_B0_P0_U0_CFG22 EQU 0x40010056
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG23
CYDEV_UCFG_B0_P0_U0_CFG23 EQU 0x40010057
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG24
CYDEV_UCFG_B0_P0_U0_CFG24 EQU 0x40010058
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG25
CYDEV_UCFG_B0_P0_U0_CFG25 EQU 0x40010059
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG26
CYDEV_UCFG_B0_P0_U0_CFG26 EQU 0x4001005a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG27
CYDEV_UCFG_B0_P0_U0_CFG27 EQU 0x4001005b
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG28
CYDEV_UCFG_B0_P0_U0_CFG28 EQU 0x4001005c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG29
CYDEV_UCFG_B0_P0_U0_CFG29 EQU 0x4001005d
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG30
CYDEV_UCFG_B0_P0_U0_CFG30 EQU 0x4001005e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_CFG31
CYDEV_UCFG_B0_P0_U0_CFG31 EQU 0x4001005f
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_DCFG0
CYDEV_UCFG_B0_P0_U0_DCFG0 EQU 0x40010060
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_DCFG1
CYDEV_UCFG_B0_P0_U0_DCFG1 EQU 0x40010062
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_DCFG2
CYDEV_UCFG_B0_P0_U0_DCFG2 EQU 0x40010064
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_DCFG3
CYDEV_UCFG_B0_P0_U0_DCFG3 EQU 0x40010066
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_DCFG4
CYDEV_UCFG_B0_P0_U0_DCFG4 EQU 0x40010068
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_DCFG5
CYDEV_UCFG_B0_P0_U0_DCFG5 EQU 0x4001006a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_DCFG6
CYDEV_UCFG_B0_P0_U0_DCFG6 EQU 0x4001006c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U0_DCFG7
CYDEV_UCFG_B0_P0_U0_DCFG7 EQU 0x4001006e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_BASE
CYDEV_UCFG_B0_P0_U1_BASE EQU 0x40010080
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_SIZE
CYDEV_UCFG_B0_P0_U1_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_PLD_IT0
CYDEV_UCFG_B0_P0_U1_PLD_IT0 EQU 0x40010080
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_PLD_IT1
CYDEV_UCFG_B0_P0_U1_PLD_IT1 EQU 0x40010084
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_PLD_IT2
CYDEV_UCFG_B0_P0_U1_PLD_IT2 EQU 0x40010088
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_PLD_IT3
CYDEV_UCFG_B0_P0_U1_PLD_IT3 EQU 0x4001008c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_PLD_IT4
CYDEV_UCFG_B0_P0_U1_PLD_IT4 EQU 0x40010090
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_PLD_IT5
CYDEV_UCFG_B0_P0_U1_PLD_IT5 EQU 0x40010094
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_PLD_IT6
CYDEV_UCFG_B0_P0_U1_PLD_IT6 EQU 0x40010098
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_PLD_IT7
CYDEV_UCFG_B0_P0_U1_PLD_IT7 EQU 0x4001009c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_PLD_IT8
CYDEV_UCFG_B0_P0_U1_PLD_IT8 EQU 0x400100a0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_PLD_IT9
CYDEV_UCFG_B0_P0_U1_PLD_IT9 EQU 0x400100a4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_PLD_IT10
CYDEV_UCFG_B0_P0_U1_PLD_IT10 EQU 0x400100a8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_PLD_IT11
CYDEV_UCFG_B0_P0_U1_PLD_IT11 EQU 0x400100ac
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_PLD_ORT0
CYDEV_UCFG_B0_P0_U1_PLD_ORT0 EQU 0x400100b0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_PLD_ORT1
CYDEV_UCFG_B0_P0_U1_PLD_ORT1 EQU 0x400100b2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_PLD_ORT2
CYDEV_UCFG_B0_P0_U1_PLD_ORT2 EQU 0x400100b4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_PLD_ORT3
CYDEV_UCFG_B0_P0_U1_PLD_ORT3 EQU 0x400100b6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_MC_CFG_CEN_CONST
CYDEV_UCFG_B0_P0_U1_MC_CFG_CEN_CONST EQU 0x400100b8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_MC_CFG_XORFB
CYDEV_UCFG_B0_P0_U1_MC_CFG_XORFB EQU 0x400100ba
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_MC_CFG_SET_RESET
CYDEV_UCFG_B0_P0_U1_MC_CFG_SET_RESET EQU 0x400100bc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_MC_CFG_BYPASS
CYDEV_UCFG_B0_P0_U1_MC_CFG_BYPASS EQU 0x400100be
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG0
CYDEV_UCFG_B0_P0_U1_CFG0 EQU 0x400100c0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG1
CYDEV_UCFG_B0_P0_U1_CFG1 EQU 0x400100c1
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG2
CYDEV_UCFG_B0_P0_U1_CFG2 EQU 0x400100c2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG3
CYDEV_UCFG_B0_P0_U1_CFG3 EQU 0x400100c3
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG4
CYDEV_UCFG_B0_P0_U1_CFG4 EQU 0x400100c4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG5
CYDEV_UCFG_B0_P0_U1_CFG5 EQU 0x400100c5
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG6
CYDEV_UCFG_B0_P0_U1_CFG6 EQU 0x400100c6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG7
CYDEV_UCFG_B0_P0_U1_CFG7 EQU 0x400100c7
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG8
CYDEV_UCFG_B0_P0_U1_CFG8 EQU 0x400100c8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG9
CYDEV_UCFG_B0_P0_U1_CFG9 EQU 0x400100c9
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG10
CYDEV_UCFG_B0_P0_U1_CFG10 EQU 0x400100ca
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG11
CYDEV_UCFG_B0_P0_U1_CFG11 EQU 0x400100cb
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG12
CYDEV_UCFG_B0_P0_U1_CFG12 EQU 0x400100cc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG13
CYDEV_UCFG_B0_P0_U1_CFG13 EQU 0x400100cd
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG14
CYDEV_UCFG_B0_P0_U1_CFG14 EQU 0x400100ce
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG15
CYDEV_UCFG_B0_P0_U1_CFG15 EQU 0x400100cf
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG16
CYDEV_UCFG_B0_P0_U1_CFG16 EQU 0x400100d0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG20
CYDEV_UCFG_B0_P0_U1_CFG20 EQU 0x400100d4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG21
CYDEV_UCFG_B0_P0_U1_CFG21 EQU 0x400100d5
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG22
CYDEV_UCFG_B0_P0_U1_CFG22 EQU 0x400100d6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG23
CYDEV_UCFG_B0_P0_U1_CFG23 EQU 0x400100d7
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG24
CYDEV_UCFG_B0_P0_U1_CFG24 EQU 0x400100d8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG25
CYDEV_UCFG_B0_P0_U1_CFG25 EQU 0x400100d9
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG26
CYDEV_UCFG_B0_P0_U1_CFG26 EQU 0x400100da
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG27
CYDEV_UCFG_B0_P0_U1_CFG27 EQU 0x400100db
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG28
CYDEV_UCFG_B0_P0_U1_CFG28 EQU 0x400100dc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG29
CYDEV_UCFG_B0_P0_U1_CFG29 EQU 0x400100dd
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG30
CYDEV_UCFG_B0_P0_U1_CFG30 EQU 0x400100de
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_CFG31
CYDEV_UCFG_B0_P0_U1_CFG31 EQU 0x400100df
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_DCFG0
CYDEV_UCFG_B0_P0_U1_DCFG0 EQU 0x400100e0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_DCFG1
CYDEV_UCFG_B0_P0_U1_DCFG1 EQU 0x400100e2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_DCFG2
CYDEV_UCFG_B0_P0_U1_DCFG2 EQU 0x400100e4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_DCFG3
CYDEV_UCFG_B0_P0_U1_DCFG3 EQU 0x400100e6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_DCFG4
CYDEV_UCFG_B0_P0_U1_DCFG4 EQU 0x400100e8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_DCFG5
CYDEV_UCFG_B0_P0_U1_DCFG5 EQU 0x400100ea
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_DCFG6
CYDEV_UCFG_B0_P0_U1_DCFG6 EQU 0x400100ec
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_U1_DCFG7
CYDEV_UCFG_B0_P0_U1_DCFG7 EQU 0x400100ee
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_ROUTE_BASE
CYDEV_UCFG_B0_P0_ROUTE_BASE EQU 0x40010100
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P0_ROUTE_SIZE
CYDEV_UCFG_B0_P0_ROUTE_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_BASE
CYDEV_UCFG_B0_P1_BASE EQU 0x40010200
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_SIZE
CYDEV_UCFG_B0_P1_SIZE EQU 0x000001ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_BASE
CYDEV_UCFG_B0_P1_U0_BASE EQU 0x40010200
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_SIZE
CYDEV_UCFG_B0_P1_U0_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_PLD_IT0
CYDEV_UCFG_B0_P1_U0_PLD_IT0 EQU 0x40010200
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_PLD_IT1
CYDEV_UCFG_B0_P1_U0_PLD_IT1 EQU 0x40010204
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_PLD_IT2
CYDEV_UCFG_B0_P1_U0_PLD_IT2 EQU 0x40010208
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_PLD_IT3
CYDEV_UCFG_B0_P1_U0_PLD_IT3 EQU 0x4001020c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_PLD_IT4
CYDEV_UCFG_B0_P1_U0_PLD_IT4 EQU 0x40010210
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_PLD_IT5
CYDEV_UCFG_B0_P1_U0_PLD_IT5 EQU 0x40010214
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_PLD_IT6
CYDEV_UCFG_B0_P1_U0_PLD_IT6 EQU 0x40010218
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_PLD_IT7
CYDEV_UCFG_B0_P1_U0_PLD_IT7 EQU 0x4001021c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_PLD_IT8
CYDEV_UCFG_B0_P1_U0_PLD_IT8 EQU 0x40010220
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_PLD_IT9
CYDEV_UCFG_B0_P1_U0_PLD_IT9 EQU 0x40010224
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_PLD_IT10
CYDEV_UCFG_B0_P1_U0_PLD_IT10 EQU 0x40010228
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_PLD_IT11
CYDEV_UCFG_B0_P1_U0_PLD_IT11 EQU 0x4001022c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_PLD_ORT0
CYDEV_UCFG_B0_P1_U0_PLD_ORT0 EQU 0x40010230
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_PLD_ORT1
CYDEV_UCFG_B0_P1_U0_PLD_ORT1 EQU 0x40010232
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_PLD_ORT2
CYDEV_UCFG_B0_P1_U0_PLD_ORT2 EQU 0x40010234
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_PLD_ORT3
CYDEV_UCFG_B0_P1_U0_PLD_ORT3 EQU 0x40010236
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_MC_CFG_CEN_CONST
CYDEV_UCFG_B0_P1_U0_MC_CFG_CEN_CONST EQU 0x40010238
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_MC_CFG_XORFB
CYDEV_UCFG_B0_P1_U0_MC_CFG_XORFB EQU 0x4001023a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_MC_CFG_SET_RESET
CYDEV_UCFG_B0_P1_U0_MC_CFG_SET_RESET EQU 0x4001023c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_MC_CFG_BYPASS
CYDEV_UCFG_B0_P1_U0_MC_CFG_BYPASS EQU 0x4001023e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG0
CYDEV_UCFG_B0_P1_U0_CFG0 EQU 0x40010240
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG1
CYDEV_UCFG_B0_P1_U0_CFG1 EQU 0x40010241
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG2
CYDEV_UCFG_B0_P1_U0_CFG2 EQU 0x40010242
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG3
CYDEV_UCFG_B0_P1_U0_CFG3 EQU 0x40010243
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG4
CYDEV_UCFG_B0_P1_U0_CFG4 EQU 0x40010244
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG5
CYDEV_UCFG_B0_P1_U0_CFG5 EQU 0x40010245
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG6
CYDEV_UCFG_B0_P1_U0_CFG6 EQU 0x40010246
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG7
CYDEV_UCFG_B0_P1_U0_CFG7 EQU 0x40010247
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG8
CYDEV_UCFG_B0_P1_U0_CFG8 EQU 0x40010248
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG9
CYDEV_UCFG_B0_P1_U0_CFG9 EQU 0x40010249
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG10
CYDEV_UCFG_B0_P1_U0_CFG10 EQU 0x4001024a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG11
CYDEV_UCFG_B0_P1_U0_CFG11 EQU 0x4001024b
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG12
CYDEV_UCFG_B0_P1_U0_CFG12 EQU 0x4001024c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG13
CYDEV_UCFG_B0_P1_U0_CFG13 EQU 0x4001024d
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG14
CYDEV_UCFG_B0_P1_U0_CFG14 EQU 0x4001024e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG15
CYDEV_UCFG_B0_P1_U0_CFG15 EQU 0x4001024f
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG16
CYDEV_UCFG_B0_P1_U0_CFG16 EQU 0x40010250
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG20
CYDEV_UCFG_B0_P1_U0_CFG20 EQU 0x40010254
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG21
CYDEV_UCFG_B0_P1_U0_CFG21 EQU 0x40010255
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG22
CYDEV_UCFG_B0_P1_U0_CFG22 EQU 0x40010256
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG23
CYDEV_UCFG_B0_P1_U0_CFG23 EQU 0x40010257
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG24
CYDEV_UCFG_B0_P1_U0_CFG24 EQU 0x40010258
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG25
CYDEV_UCFG_B0_P1_U0_CFG25 EQU 0x40010259
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG26
CYDEV_UCFG_B0_P1_U0_CFG26 EQU 0x4001025a
    ENDIF
