MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv.inc
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG27
CYDEV_UCFG_B0_P1_U0_CFG27 EQU 0x4001025b
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG28
CYDEV_UCFG_B0_P1_U0_CFG28 EQU 0x4001025c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG29
CYDEV_UCFG_B0_P1_U0_CFG29 EQU 0x4001025d
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG30
CYDEV_UCFG_B0_P1_U0_CFG30 EQU 0x4001025e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_CFG31
CYDEV_UCFG_B0_P1_U0_CFG31 EQU 0x4001025f
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_DCFG0
CYDEV_UCFG_B0_P1_U0_DCFG0 EQU 0x40010260
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_DCFG1
CYDEV_UCFG_B0_P1_U0_DCFG1 EQU 0x40010262
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_DCFG2
CYDEV_UCFG_B0_P1_U0_DCFG2 EQU 0x40010264
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_DCFG3
CYDEV_UCFG_B0_P1_U0_DCFG3 EQU 0x40010266
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_DCFG4
CYDEV_UCFG_B0_P1_U0_DCFG4 EQU 0x40010268
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_DCFG5
CYDEV_UCFG_B0_P1_U0_DCFG5 EQU 0x4001026a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_DCFG6
CYDEV_UCFG_B0_P1_U0_DCFG6 EQU 0x4001026c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U0_DCFG7
CYDEV_UCFG_B0_P1_U0_DCFG7 EQU 0x4001026e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_BASE
CYDEV_UCFG_B0_P1_U1_BASE EQU 0x40010280
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_SIZE
CYDEV_UCFG_B0_P1_U1_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_PLD_IT0
CYDEV_UCFG_B0_P1_U1_PLD_IT0 EQU 0x40010280
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_PLD_IT1
CYDEV_UCFG_B0_P1_U1_PLD_IT1 EQU 0x40010284
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_PLD_IT2
CYDEV_UCFG_B0_P1_U1_PLD_IT2 EQU 0x40010288
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_PLD_IT3
CYDEV_UCFG_B0_P1_U1_PLD_IT3 EQU 0x4001028c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_PLD_IT4
CYDEV_UCFG_B0_P1_U1_PLD_IT4 EQU 0x40010290
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_PLD_IT5
CYDEV_UCFG_B0_P1_U1_PLD_IT5 EQU 0x40010294
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_PLD_IT6
CYDEV_UCFG_B0_P1_U1_PLD_IT6 EQU 0x40010298
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_PLD_IT7
CYDEV_UCFG_B0_P1_U1_PLD_IT7 EQU 0x4001029c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_PLD_IT8
CYDEV_UCFG_B0_P1_U1_PLD_IT8 EQU 0x400102a0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_PLD_IT9
CYDEV_UCFG_B0_P1_U1_PLD_IT9 EQU 0x400102a4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_PLD_IT10
CYDEV_UCFG_B0_P1_U1_PLD_IT10 EQU 0x400102a8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_PLD_IT11
CYDEV_UCFG_B0_P1_U1_PLD_IT11 EQU 0x400102ac
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_PLD_ORT0
CYDEV_UCFG_B0_P1_U1_PLD_ORT0 EQU 0x400102b0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_PLD_ORT1
CYDEV_UCFG_B0_P1_U1_PLD_ORT1 EQU 0x400102b2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_PLD_ORT2
CYDEV_UCFG_B0_P1_U1_PLD_ORT2 EQU 0x400102b4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_PLD_ORT3
CYDEV_UCFG_B0_P1_U1_PLD_ORT3 EQU 0x400102b6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_MC_CFG_CEN_CONST
CYDEV_UCFG_B0_P1_U1_MC_CFG_CEN_CONST EQU 0x400102b8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_MC_CFG_XORFB
CYDEV_UCFG_B0_P1_U1_MC_CFG_XORFB EQU 0x400102ba
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_MC_CFG_SET_RESET
CYDEV_UCFG_B0_P1_U1_MC_CFG_SET_RESET EQU 0x400102bc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_MC_CFG_BYPASS
CYDEV_UCFG_B0_P1_U1_MC_CFG_BYPASS EQU 0x400102be
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG0
CYDEV_UCFG_B0_P1_U1_CFG0 EQU 0x400102c0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG1
CYDEV_UCFG_B0_P1_U1_CFG1 EQU 0x400102c1
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG2
CYDEV_UCFG_B0_P1_U1_CFG2 EQU 0x400102c2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG3
CYDEV_UCFG_B0_P1_U1_CFG3 EQU 0x400102c3
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG4
CYDEV_UCFG_B0_P1_U1_CFG4 EQU 0x400102c4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG5
CYDEV_UCFG_B0_P1_U1_CFG5 EQU 0x400102c5
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG6
CYDEV_UCFG_B0_P1_U1_CFG6 EQU 0x400102c6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG7
CYDEV_UCFG_B0_P1_U1_CFG7 EQU 0x400102c7
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG8
CYDEV_UCFG_B0_P1_U1_CFG8 EQU 0x400102c8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG9
CYDEV_UCFG_B0_P1_U1_CFG9 EQU 0x400102c9
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG10
CYDEV_UCFG_B0_P1_U1_CFG10 EQU 0x400102ca
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG11
CYDEV_UCFG_B0_P1_U1_CFG11 EQU 0x400102cb
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG12
CYDEV_UCFG_B0_P1_U1_CFG12 EQU 0x400102cc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG13
CYDEV_UCFG_B0_P1_U1_CFG13 EQU 0x400102cd
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG14
CYDEV_UCFG_B0_P1_U1_CFG14 EQU 0x400102ce
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG15
CYDEV_UCFG_B0_P1_U1_CFG15 EQU 0x400102cf
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG16
CYDEV_UCFG_B0_P1_U1_CFG16 EQU 0x400102d0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG20
CYDEV_UCFG_B0_P1_U1_CFG20 EQU 0x400102d4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG21
CYDEV_UCFG_B0_P1_U1_CFG21 EQU 0x400102d5
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG22
CYDEV_UCFG_B0_P1_U1_CFG22 EQU 0x400102d6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG23
CYDEV_UCFG_B0_P1_U1_CFG23 EQU 0x400102d7
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG24
CYDEV_UCFG_B0_P1_U1_CFG24 EQU 0x400102d8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG25
CYDEV_UCFG_B0_P1_U1_CFG25 EQU 0x400102d9
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG26
CYDEV_UCFG_B0_P1_U1_CFG26 EQU 0x400102da
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG27
CYDEV_UCFG_B0_P1_U1_CFG27 EQU 0x400102db
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG28
CYDEV_UCFG_B0_P1_U1_CFG28 EQU 0x400102dc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG29
CYDEV_UCFG_B0_P1_U1_CFG29 EQU 0x400102dd
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG30
CYDEV_UCFG_B0_P1_U1_CFG30 EQU 0x400102de
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_CFG31
CYDEV_UCFG_B0_P1_U1_CFG31 EQU 0x400102df
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_DCFG0
CYDEV_UCFG_B0_P1_U1_DCFG0 EQU 0x400102e0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_DCFG1
CYDEV_UCFG_B0_P1_U1_DCFG1 EQU 0x400102e2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_DCFG2
CYDEV_UCFG_B0_P1_U1_DCFG2 EQU 0x400102e4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_DCFG3
CYDEV_UCFG_B0_P1_U1_DCFG3 EQU 0x400102e6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_DCFG4
CYDEV_UCFG_B0_P1_U1_DCFG4 EQU 0x400102e8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_DCFG5
CYDEV_UCFG_B0_P1_U1_DCFG5 EQU 0x400102ea
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_DCFG6
CYDEV_UCFG_B0_P1_U1_DCFG6 EQU 0x400102ec
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_U1_DCFG7
CYDEV_UCFG_B0_P1_U1_DCFG7 EQU 0x400102ee
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_ROUTE_BASE
CYDEV_UCFG_B0_P1_ROUTE_BASE EQU 0x40010300
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P1_ROUTE_SIZE
CYDEV_UCFG_B0_P1_ROUTE_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_BASE
CYDEV_UCFG_B0_P2_BASE EQU 0x40010400
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_SIZE
CYDEV_UCFG_B0_P2_SIZE EQU 0x000001ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_BASE
CYDEV_UCFG_B0_P2_U0_BASE EQU 0x40010400
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_SIZE
CYDEV_UCFG_B0_P2_U0_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_PLD_IT0
CYDEV_UCFG_B0_P2_U0_PLD_IT0 EQU 0x40010400
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_PLD_IT1
CYDEV_UCFG_B0_P2_U0_PLD_IT1 EQU 0x40010404
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_PLD_IT2
CYDEV_UCFG_B0_P2_U0_PLD_IT2 EQU 0x40010408
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_PLD_IT3
CYDEV_UCFG_B0_P2_U0_PLD_IT3 EQU 0x4001040c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_PLD_IT4
CYDEV_UCFG_B0_P2_U0_PLD_IT4 EQU 0x40010410
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_PLD_IT5
CYDEV_UCFG_B0_P2_U0_PLD_IT5 EQU 0x40010414
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_PLD_IT6
CYDEV_UCFG_B0_P2_U0_PLD_IT6 EQU 0x40010418
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_PLD_IT7
CYDEV_UCFG_B0_P2_U0_PLD_IT7 EQU 0x4001041c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_PLD_IT8
CYDEV_UCFG_B0_P2_U0_PLD_IT8 EQU 0x40010420
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_PLD_IT9
CYDEV_UCFG_B0_P2_U0_PLD_IT9 EQU 0x40010424
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_PLD_IT10
CYDEV_UCFG_B0_P2_U0_PLD_IT10 EQU 0x40010428
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_PLD_IT11
CYDEV_UCFG_B0_P2_U0_PLD_IT11 EQU 0x4001042c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_PLD_ORT0
CYDEV_UCFG_B0_P2_U0_PLD_ORT0 EQU 0x40010430
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_PLD_ORT1
CYDEV_UCFG_B0_P2_U0_PLD_ORT1 EQU 0x40010432
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_PLD_ORT2
CYDEV_UCFG_B0_P2_U0_PLD_ORT2 EQU 0x40010434
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_PLD_ORT3
CYDEV_UCFG_B0_P2_U0_PLD_ORT3 EQU 0x40010436
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_MC_CFG_CEN_CONST
CYDEV_UCFG_B0_P2_U0_MC_CFG_CEN_CONST EQU 0x40010438
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_MC_CFG_XORFB
CYDEV_UCFG_B0_P2_U0_MC_CFG_XORFB EQU 0x4001043a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_MC_CFG_SET_RESET
CYDEV_UCFG_B0_P2_U0_MC_CFG_SET_RESET EQU 0x4001043c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_MC_CFG_BYPASS
CYDEV_UCFG_B0_P2_U0_MC_CFG_BYPASS EQU 0x4001043e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG0
CYDEV_UCFG_B0_P2_U0_CFG0 EQU 0x40010440
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG1
CYDEV_UCFG_B0_P2_U0_CFG1 EQU 0x40010441
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG2
CYDEV_UCFG_B0_P2_U0_CFG2 EQU 0x40010442
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG3
CYDEV_UCFG_B0_P2_U0_CFG3 EQU 0x40010443
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG4
CYDEV_UCFG_B0_P2_U0_CFG4 EQU 0x40010444
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG5
CYDEV_UCFG_B0_P2_U0_CFG5 EQU 0x40010445
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG6
CYDEV_UCFG_B0_P2_U0_CFG6 EQU 0x40010446
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG7
CYDEV_UCFG_B0_P2_U0_CFG7 EQU 0x40010447
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG8
CYDEV_UCFG_B0_P2_U0_CFG8 EQU 0x40010448
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG9
CYDEV_UCFG_B0_P2_U0_CFG9 EQU 0x40010449
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG10
CYDEV_UCFG_B0_P2_U0_CFG10 EQU 0x4001044a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG11
CYDEV_UCFG_B0_P2_U0_CFG11 EQU 0x4001044b
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG12
CYDEV_UCFG_B0_P2_U0_CFG12 EQU 0x4001044c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG13
CYDEV_UCFG_B0_P2_U0_CFG13 EQU 0x4001044d
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG14
CYDEV_UCFG_B0_P2_U0_CFG14 EQU 0x4001044e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG15
CYDEV_UCFG_B0_P2_U0_CFG15 EQU 0x4001044f
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG16
CYDEV_UCFG_B0_P2_U0_CFG16 EQU 0x40010450
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG20
CYDEV_UCFG_B0_P2_U0_CFG20 EQU 0x40010454
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG21
CYDEV_UCFG_B0_P2_U0_CFG21 EQU 0x40010455
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG22
CYDEV_UCFG_B0_P2_U0_CFG22 EQU 0x40010456
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG23
CYDEV_UCFG_B0_P2_U0_CFG23 EQU 0x40010457
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG24
CYDEV_UCFG_B0_P2_U0_CFG24 EQU 0x40010458
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG25
CYDEV_UCFG_B0_P2_U0_CFG25 EQU 0x40010459
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG26
CYDEV_UCFG_B0_P2_U0_CFG26 EQU 0x4001045a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG27
CYDEV_UCFG_B0_P2_U0_CFG27 EQU 0x4001045b
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG28
CYDEV_UCFG_B0_P2_U0_CFG28 EQU 0x4001045c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG29
CYDEV_UCFG_B0_P2_U0_CFG29 EQU 0x4001045d
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG30
CYDEV_UCFG_B0_P2_U0_CFG30 EQU 0x4001045e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_CFG31
CYDEV_UCFG_B0_P2_U0_CFG31 EQU 0x4001045f
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_DCFG0
CYDEV_UCFG_B0_P2_U0_DCFG0 EQU 0x40010460
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_DCFG1
CYDEV_UCFG_B0_P2_U0_DCFG1 EQU 0x40010462
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_DCFG2
CYDEV_UCFG_B0_P2_U0_DCFG2 EQU 0x40010464
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_DCFG3
CYDEV_UCFG_B0_P2_U0_DCFG3 EQU 0x40010466
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_DCFG4
CYDEV_UCFG_B0_P2_U0_DCFG4 EQU 0x40010468
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_DCFG5
CYDEV_UCFG_B0_P2_U0_DCFG5 EQU 0x4001046a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_DCFG6
CYDEV_UCFG_B0_P2_U0_DCFG6 EQU 0x4001046c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U0_DCFG7
CYDEV_UCFG_B0_P2_U0_DCFG7 EQU 0x4001046e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_BASE
CYDEV_UCFG_B0_P2_U1_BASE EQU 0x40010480
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_SIZE
CYDEV_UCFG_B0_P2_U1_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_PLD_IT0
CYDEV_UCFG_B0_P2_U1_PLD_IT0 EQU 0x40010480
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_PLD_IT1
CYDEV_UCFG_B0_P2_U1_PLD_IT1 EQU 0x40010484
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_PLD_IT2
CYDEV_UCFG_B0_P2_U1_PLD_IT2 EQU 0x40010488
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_PLD_IT3
CYDEV_UCFG_B0_P2_U1_PLD_IT3 EQU 0x4001048c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_PLD_IT4
CYDEV_UCFG_B0_P2_U1_PLD_IT4 EQU 0x40010490
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_PLD_IT5
CYDEV_UCFG_B0_P2_U1_PLD_IT5 EQU 0x40010494
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_PLD_IT6
CYDEV_UCFG_B0_P2_U1_PLD_IT6 EQU 0x40010498
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_PLD_IT7
CYDEV_UCFG_B0_P2_U1_PLD_IT7 EQU 0x4001049c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_PLD_IT8
CYDEV_UCFG_B0_P2_U1_PLD_IT8 EQU 0x400104a0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_PLD_IT9
CYDEV_UCFG_B0_P2_U1_PLD_IT9 EQU 0x400104a4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_PLD_IT10
CYDEV_UCFG_B0_P2_U1_PLD_IT10 EQU 0x400104a8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_PLD_IT11
CYDEV_UCFG_B0_P2_U1_PLD_IT11 EQU 0x400104ac
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_PLD_ORT0
CYDEV_UCFG_B0_P2_U1_PLD_ORT0 EQU 0x400104b0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_PLD_ORT1
CYDEV_UCFG_B0_P2_U1_PLD_ORT1 EQU 0x400104b2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_PLD_ORT2
CYDEV_UCFG_B0_P2_U1_PLD_ORT2 EQU 0x400104b4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_PLD_ORT3
CYDEV_UCFG_B0_P2_U1_PLD_ORT3 EQU 0x400104b6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_MC_CFG_CEN_CONST
CYDEV_UCFG_B0_P2_U1_MC_CFG_CEN_CONST EQU 0x400104b8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_MC_CFG_XORFB
CYDEV_UCFG_B0_P2_U1_MC_CFG_XORFB EQU 0x400104ba
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_MC_CFG_SET_RESET
CYDEV_UCFG_B0_P2_U1_MC_CFG_SET_RESET EQU 0x400104bc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_MC_CFG_BYPASS
CYDEV_UCFG_B0_P2_U1_MC_CFG_BYPASS EQU 0x400104be
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG0
CYDEV_UCFG_B0_P2_U1_CFG0 EQU 0x400104c0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG1
CYDEV_UCFG_B0_P2_U1_CFG1 EQU 0x400104c1
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG2
CYDEV_UCFG_B0_P2_U1_CFG2 EQU 0x400104c2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG3
CYDEV_UCFG_B0_P2_U1_CFG3 EQU 0x400104c3
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG4
CYDEV_UCFG_B0_P2_U1_CFG4 EQU 0x400104c4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG5
CYDEV_UCFG_B0_P2_U1_CFG5 EQU 0x400104c5
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG6
CYDEV_UCFG_B0_P2_U1_CFG6 EQU 0x400104c6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG7
CYDEV_UCFG_B0_P2_U1_CFG7 EQU 0x400104c7
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG8
CYDEV_UCFG_B0_P2_U1_CFG8 EQU 0x400104c8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG9
CYDEV_UCFG_B0_P2_U1_CFG9 EQU 0x400104c9
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG10
CYDEV_UCFG_B0_P2_U1_CFG10 EQU 0x400104ca
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG11
CYDEV_UCFG_B0_P2_U1_CFG11 EQU 0x400104cb
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG12
CYDEV_UCFG_B0_P2_U1_CFG12 EQU 0x400104cc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG13
CYDEV_UCFG_B0_P2_U1_CFG13 EQU 0x400104cd
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG14
CYDEV_UCFG_B0_P2_U1_CFG14 EQU 0x400104ce
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG15
CYDEV_UCFG_B0_P2_U1_CFG15 EQU 0x400104cf
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG16
CYDEV_UCFG_B0_P2_U1_CFG16 EQU 0x400104d0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG20
CYDEV_UCFG_B0_P2_U1_CFG20 EQU 0x400104d4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG21
CYDEV_UCFG_B0_P2_U1_CFG21 EQU 0x400104d5
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG22
CYDEV_UCFG_B0_P2_U1_CFG22 EQU 0x400104d6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG23
CYDEV_UCFG_B0_P2_U1_CFG23 EQU 0x400104d7
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG24
CYDEV_UCFG_B0_P2_U1_CFG24 EQU 0x400104d8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG25
CYDEV_UCFG_B0_P2_U1_CFG25 EQU 0x400104d9
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG26
CYDEV_UCFG_B0_P2_U1_CFG26 EQU 0x400104da
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG27
CYDEV_UCFG_B0_P2_U1_CFG27 EQU 0x400104db
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG28
CYDEV_UCFG_B0_P2_U1_CFG28 EQU 0x400104dc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG29
CYDEV_UCFG_B0_P2_U1_CFG29 EQU 0x400104dd
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG30
CYDEV_UCFG_B0_P2_U1_CFG30 EQU 0x400104de
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_CFG31
CYDEV_UCFG_B0_P2_U1_CFG31 EQU 0x400104df
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_DCFG0
CYDEV_UCFG_B0_P2_U1_DCFG0 EQU 0x400104e0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_DCFG1
CYDEV_UCFG_B0_P2_U1_DCFG1 EQU 0x400104e2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_DCFG2
CYDEV_UCFG_B0_P2_U1_DCFG2 EQU 0x400104e4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_DCFG3
CYDEV_UCFG_B0_P2_U1_DCFG3 EQU 0x400104e6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_DCFG4
CYDEV_UCFG_B0_P2_U1_DCFG4 EQU 0x400104e8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_DCFG5
CYDEV_UCFG_B0_P2_U1_DCFG5 EQU 0x400104ea
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_DCFG6
CYDEV_UCFG_B0_P2_U1_DCFG6 EQU 0x400104ec
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_U1_DCFG7
CYDEV_UCFG_B0_P2_U1_DCFG7 EQU 0x400104ee
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_ROUTE_BASE
CYDEV_UCFG_B0_P2_ROUTE_BASE EQU 0x40010500
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P2_ROUTE_SIZE
CYDEV_UCFG_B0_P2_ROUTE_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_BASE
CYDEV_UCFG_B0_P3_BASE EQU 0x40010600
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_SIZE
CYDEV_UCFG_B0_P3_SIZE EQU 0x000001ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_BASE
CYDEV_UCFG_B0_P3_U0_BASE EQU 0x40010600
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_SIZE
CYDEV_UCFG_B0_P3_U0_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_PLD_IT0
CYDEV_UCFG_B0_P3_U0_PLD_IT0 EQU 0x40010600
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_PLD_IT1
CYDEV_UCFG_B0_P3_U0_PLD_IT1 EQU 0x40010604
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_PLD_IT2
CYDEV_UCFG_B0_P3_U0_PLD_IT2 EQU 0x40010608
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_PLD_IT3
CYDEV_UCFG_B0_P3_U0_PLD_IT3 EQU 0x4001060c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_PLD_IT4
CYDEV_UCFG_B0_P3_U0_PLD_IT4 EQU 0x40010610
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_PLD_IT5
CYDEV_UCFG_B0_P3_U0_PLD_IT5 EQU 0x40010614
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_PLD_IT6
CYDEV_UCFG_B0_P3_U0_PLD_IT6 EQU 0x40010618
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_PLD_IT7
CYDEV_UCFG_B0_P3_U0_PLD_IT7 EQU 0x4001061c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_PLD_IT8
CYDEV_UCFG_B0_P3_U0_PLD_IT8 EQU 0x40010620
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_PLD_IT9
CYDEV_UCFG_B0_P3_U0_PLD_IT9 EQU 0x40010624
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_PLD_IT10
CYDEV_UCFG_B0_P3_U0_PLD_IT10 EQU 0x40010628
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_PLD_IT11
CYDEV_UCFG_B0_P3_U0_PLD_IT11 EQU 0x4001062c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_PLD_ORT0
CYDEV_UCFG_B0_P3_U0_PLD_ORT0 EQU 0x40010630
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_PLD_ORT1
CYDEV_UCFG_B0_P3_U0_PLD_ORT1 EQU 0x40010632
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_PLD_ORT2
CYDEV_UCFG_B0_P3_U0_PLD_ORT2 EQU 0x40010634
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_PLD_ORT3
CYDEV_UCFG_B0_P3_U0_PLD_ORT3 EQU 0x40010636
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_MC_CFG_CEN_CONST
CYDEV_UCFG_B0_P3_U0_MC_CFG_CEN_CONST EQU 0x40010638
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_MC_CFG_XORFB
CYDEV_UCFG_B0_P3_U0_MC_CFG_XORFB EQU 0x4001063a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_MC_CFG_SET_RESET
CYDEV_UCFG_B0_P3_U0_MC_CFG_SET_RESET EQU 0x4001063c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_MC_CFG_BYPASS
CYDEV_UCFG_B0_P3_U0_MC_CFG_BYPASS EQU 0x4001063e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG0
CYDEV_UCFG_B0_P3_U0_CFG0 EQU 0x40010640
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG1
CYDEV_UCFG_B0_P3_U0_CFG1 EQU 0x40010641
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG2
CYDEV_UCFG_B0_P3_U0_CFG2 EQU 0x40010642
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG3
CYDEV_UCFG_B0_P3_U0_CFG3 EQU 0x40010643
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG4
CYDEV_UCFG_B0_P3_U0_CFG4 EQU 0x40010644
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG5
CYDEV_UCFG_B0_P3_U0_CFG5 EQU 0x40010645
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG6
CYDEV_UCFG_B0_P3_U0_CFG6 EQU 0x40010646
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG7
CYDEV_UCFG_B0_P3_U0_CFG7 EQU 0x40010647
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG8
CYDEV_UCFG_B0_P3_U0_CFG8 EQU 0x40010648
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG9
CYDEV_UCFG_B0_P3_U0_CFG9 EQU 0x40010649
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG10
CYDEV_UCFG_B0_P3_U0_CFG10 EQU 0x4001064a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG11
CYDEV_UCFG_B0_P3_U0_CFG11 EQU 0x4001064b
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG12
CYDEV_UCFG_B0_P3_U0_CFG12 EQU 0x4001064c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG13
CYDEV_UCFG_B0_P3_U0_CFG13 EQU 0x4001064d
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG14
CYDEV_UCFG_B0_P3_U0_CFG14 EQU 0x4001064e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG15
CYDEV_UCFG_B0_P3_U0_CFG15 EQU 0x4001064f
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG16
CYDEV_UCFG_B0_P3_U0_CFG16 EQU 0x40010650
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG20
CYDEV_UCFG_B0_P3_U0_CFG20 EQU 0x40010654
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG21
CYDEV_UCFG_B0_P3_U0_CFG21 EQU 0x40010655
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG22
CYDEV_UCFG_B0_P3_U0_CFG22 EQU 0x40010656
