MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv.inc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG23
CYDEV_UCFG_B0_P3_U0_CFG23 EQU 0x40010657
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG24
CYDEV_UCFG_B0_P3_U0_CFG24 EQU 0x40010658
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG25
CYDEV_UCFG_B0_P3_U0_CFG25 EQU 0x40010659
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG26
CYDEV_UCFG_B0_P3_U0_CFG26 EQU 0x4001065a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG27
CYDEV_UCFG_B0_P3_U0_CFG27 EQU 0x4001065b
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG28
CYDEV_UCFG_B0_P3_U0_CFG28 EQU 0x4001065c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG29
CYDEV_UCFG_B0_P3_U0_CFG29 EQU 0x4001065d
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG30
CYDEV_UCFG_B0_P3_U0_CFG30 EQU 0x4001065e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_CFG31
CYDEV_UCFG_B0_P3_U0_CFG31 EQU 0x4001065f
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_DCFG0
CYDEV_UCFG_B0_P3_U0_DCFG0 EQU 0x40010660
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_DCFG1
CYDEV_UCFG_B0_P3_U0_DCFG1 EQU 0x40010662
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_DCFG2
CYDEV_UCFG_B0_P3_U0_DCFG2 EQU 0x40010664
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_DCFG3
CYDEV_UCFG_B0_P3_U0_DCFG3 EQU 0x40010666
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_DCFG4
CYDEV_UCFG_B0_P3_U0_DCFG4 EQU 0x40010668
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_DCFG5
CYDEV_UCFG_B0_P3_U0_DCFG5 EQU 0x4001066a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_DCFG6
CYDEV_UCFG_B0_P3_U0_DCFG6 EQU 0x4001066c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U0_DCFG7
CYDEV_UCFG_B0_P3_U0_DCFG7 EQU 0x4001066e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_BASE
CYDEV_UCFG_B0_P3_U1_BASE EQU 0x40010680
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_SIZE
CYDEV_UCFG_B0_P3_U1_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_PLD_IT0
CYDEV_UCFG_B0_P3_U1_PLD_IT0 EQU 0x40010680
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_PLD_IT1
CYDEV_UCFG_B0_P3_U1_PLD_IT1 EQU 0x40010684
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_PLD_IT2
CYDEV_UCFG_B0_P3_U1_PLD_IT2 EQU 0x40010688
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_PLD_IT3
CYDEV_UCFG_B0_P3_U1_PLD_IT3 EQU 0x4001068c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_PLD_IT4
CYDEV_UCFG_B0_P3_U1_PLD_IT4 EQU 0x40010690
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_PLD_IT5
CYDEV_UCFG_B0_P3_U1_PLD_IT5 EQU 0x40010694
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_PLD_IT6
CYDEV_UCFG_B0_P3_U1_PLD_IT6 EQU 0x40010698
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_PLD_IT7
CYDEV_UCFG_B0_P3_U1_PLD_IT7 EQU 0x4001069c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_PLD_IT8
CYDEV_UCFG_B0_P3_U1_PLD_IT8 EQU 0x400106a0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_PLD_IT9
CYDEV_UCFG_B0_P3_U1_PLD_IT9 EQU 0x400106a4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_PLD_IT10
CYDEV_UCFG_B0_P3_U1_PLD_IT10 EQU 0x400106a8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_PLD_IT11
CYDEV_UCFG_B0_P3_U1_PLD_IT11 EQU 0x400106ac
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_PLD_ORT0
CYDEV_UCFG_B0_P3_U1_PLD_ORT0 EQU 0x400106b0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_PLD_ORT1
CYDEV_UCFG_B0_P3_U1_PLD_ORT1 EQU 0x400106b2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_PLD_ORT2
CYDEV_UCFG_B0_P3_U1_PLD_ORT2 EQU 0x400106b4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_PLD_ORT3
CYDEV_UCFG_B0_P3_U1_PLD_ORT3 EQU 0x400106b6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_MC_CFG_CEN_CONST
CYDEV_UCFG_B0_P3_U1_MC_CFG_CEN_CONST EQU 0x400106b8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_MC_CFG_XORFB
CYDEV_UCFG_B0_P3_U1_MC_CFG_XORFB EQU 0x400106ba
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_MC_CFG_SET_RESET
CYDEV_UCFG_B0_P3_U1_MC_CFG_SET_RESET EQU 0x400106bc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_MC_CFG_BYPASS
CYDEV_UCFG_B0_P3_U1_MC_CFG_BYPASS EQU 0x400106be
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG0
CYDEV_UCFG_B0_P3_U1_CFG0 EQU 0x400106c0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG1
CYDEV_UCFG_B0_P3_U1_CFG1 EQU 0x400106c1
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG2
CYDEV_UCFG_B0_P3_U1_CFG2 EQU 0x400106c2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG3
CYDEV_UCFG_B0_P3_U1_CFG3 EQU 0x400106c3
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG4
CYDEV_UCFG_B0_P3_U1_CFG4 EQU 0x400106c4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG5
CYDEV_UCFG_B0_P3_U1_CFG5 EQU 0x400106c5
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG6
CYDEV_UCFG_B0_P3_U1_CFG6 EQU 0x400106c6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG7
CYDEV_UCFG_B0_P3_U1_CFG7 EQU 0x400106c7
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG8
CYDEV_UCFG_B0_P3_U1_CFG8 EQU 0x400106c8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG9
CYDEV_UCFG_B0_P3_U1_CFG9 EQU 0x400106c9
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG10
CYDEV_UCFG_B0_P3_U1_CFG10 EQU 0x400106ca
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG11
CYDEV_UCFG_B0_P3_U1_CFG11 EQU 0x400106cb
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG12
CYDEV_UCFG_B0_P3_U1_CFG12 EQU 0x400106cc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG13
CYDEV_UCFG_B0_P3_U1_CFG13 EQU 0x400106cd
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG14
CYDEV_UCFG_B0_P3_U1_CFG14 EQU 0x400106ce
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG15
CYDEV_UCFG_B0_P3_U1_CFG15 EQU 0x400106cf
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG16
CYDEV_UCFG_B0_P3_U1_CFG16 EQU 0x400106d0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG20
CYDEV_UCFG_B0_P3_U1_CFG20 EQU 0x400106d4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG21
CYDEV_UCFG_B0_P3_U1_CFG21 EQU 0x400106d5
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG22
CYDEV_UCFG_B0_P3_U1_CFG22 EQU 0x400106d6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG23
CYDEV_UCFG_B0_P3_U1_CFG23 EQU 0x400106d7
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG24
CYDEV_UCFG_B0_P3_U1_CFG24 EQU 0x400106d8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG25
CYDEV_UCFG_B0_P3_U1_CFG25 EQU 0x400106d9
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG26
CYDEV_UCFG_B0_P3_U1_CFG26 EQU 0x400106da
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG27
CYDEV_UCFG_B0_P3_U1_CFG27 EQU 0x400106db
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG28
CYDEV_UCFG_B0_P3_U1_CFG28 EQU 0x400106dc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG29
CYDEV_UCFG_B0_P3_U1_CFG29 EQU 0x400106dd
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG30
CYDEV_UCFG_B0_P3_U1_CFG30 EQU 0x400106de
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_CFG31
CYDEV_UCFG_B0_P3_U1_CFG31 EQU 0x400106df
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_DCFG0
CYDEV_UCFG_B0_P3_U1_DCFG0 EQU 0x400106e0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_DCFG1
CYDEV_UCFG_B0_P3_U1_DCFG1 EQU 0x400106e2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_DCFG2
CYDEV_UCFG_B0_P3_U1_DCFG2 EQU 0x400106e4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_DCFG3
CYDEV_UCFG_B0_P3_U1_DCFG3 EQU 0x400106e6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_DCFG4
CYDEV_UCFG_B0_P3_U1_DCFG4 EQU 0x400106e8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_DCFG5
CYDEV_UCFG_B0_P3_U1_DCFG5 EQU 0x400106ea
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_DCFG6
CYDEV_UCFG_B0_P3_U1_DCFG6 EQU 0x400106ec
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_U1_DCFG7
CYDEV_UCFG_B0_P3_U1_DCFG7 EQU 0x400106ee
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_ROUTE_BASE
CYDEV_UCFG_B0_P3_ROUTE_BASE EQU 0x40010700
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P3_ROUTE_SIZE
CYDEV_UCFG_B0_P3_ROUTE_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_BASE
CYDEV_UCFG_B0_P4_BASE EQU 0x40010800
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_SIZE
CYDEV_UCFG_B0_P4_SIZE EQU 0x000001ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_BASE
CYDEV_UCFG_B0_P4_U0_BASE EQU 0x40010800
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_SIZE
CYDEV_UCFG_B0_P4_U0_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_PLD_IT0
CYDEV_UCFG_B0_P4_U0_PLD_IT0 EQU 0x40010800
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_PLD_IT1
CYDEV_UCFG_B0_P4_U0_PLD_IT1 EQU 0x40010804
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_PLD_IT2
CYDEV_UCFG_B0_P4_U0_PLD_IT2 EQU 0x40010808
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_PLD_IT3
CYDEV_UCFG_B0_P4_U0_PLD_IT3 EQU 0x4001080c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_PLD_IT4
CYDEV_UCFG_B0_P4_U0_PLD_IT4 EQU 0x40010810
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_PLD_IT5
CYDEV_UCFG_B0_P4_U0_PLD_IT5 EQU 0x40010814
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_PLD_IT6
CYDEV_UCFG_B0_P4_U0_PLD_IT6 EQU 0x40010818
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_PLD_IT7
CYDEV_UCFG_B0_P4_U0_PLD_IT7 EQU 0x4001081c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_PLD_IT8
CYDEV_UCFG_B0_P4_U0_PLD_IT8 EQU 0x40010820
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_PLD_IT9
CYDEV_UCFG_B0_P4_U0_PLD_IT9 EQU 0x40010824
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_PLD_IT10
CYDEV_UCFG_B0_P4_U0_PLD_IT10 EQU 0x40010828
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_PLD_IT11
CYDEV_UCFG_B0_P4_U0_PLD_IT11 EQU 0x4001082c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_PLD_ORT0
CYDEV_UCFG_B0_P4_U0_PLD_ORT0 EQU 0x40010830
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_PLD_ORT1
CYDEV_UCFG_B0_P4_U0_PLD_ORT1 EQU 0x40010832
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_PLD_ORT2
CYDEV_UCFG_B0_P4_U0_PLD_ORT2 EQU 0x40010834
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_PLD_ORT3
CYDEV_UCFG_B0_P4_U0_PLD_ORT3 EQU 0x40010836
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_MC_CFG_CEN_CONST
CYDEV_UCFG_B0_P4_U0_MC_CFG_CEN_CONST EQU 0x40010838
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_MC_CFG_XORFB
CYDEV_UCFG_B0_P4_U0_MC_CFG_XORFB EQU 0x4001083a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_MC_CFG_SET_RESET
CYDEV_UCFG_B0_P4_U0_MC_CFG_SET_RESET EQU 0x4001083c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_MC_CFG_BYPASS
CYDEV_UCFG_B0_P4_U0_MC_CFG_BYPASS EQU 0x4001083e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG0
CYDEV_UCFG_B0_P4_U0_CFG0 EQU 0x40010840
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG1
CYDEV_UCFG_B0_P4_U0_CFG1 EQU 0x40010841
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG2
CYDEV_UCFG_B0_P4_U0_CFG2 EQU 0x40010842
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG3
CYDEV_UCFG_B0_P4_U0_CFG3 EQU 0x40010843
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG4
CYDEV_UCFG_B0_P4_U0_CFG4 EQU 0x40010844
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG5
CYDEV_UCFG_B0_P4_U0_CFG5 EQU 0x40010845
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG6
CYDEV_UCFG_B0_P4_U0_CFG6 EQU 0x40010846
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG7
CYDEV_UCFG_B0_P4_U0_CFG7 EQU 0x40010847
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG8
CYDEV_UCFG_B0_P4_U0_CFG8 EQU 0x40010848
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG9
CYDEV_UCFG_B0_P4_U0_CFG9 EQU 0x40010849
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG10
CYDEV_UCFG_B0_P4_U0_CFG10 EQU 0x4001084a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG11
CYDEV_UCFG_B0_P4_U0_CFG11 EQU 0x4001084b
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG12
CYDEV_UCFG_B0_P4_U0_CFG12 EQU 0x4001084c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG13
CYDEV_UCFG_B0_P4_U0_CFG13 EQU 0x4001084d
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG14
CYDEV_UCFG_B0_P4_U0_CFG14 EQU 0x4001084e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG15
CYDEV_UCFG_B0_P4_U0_CFG15 EQU 0x4001084f
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG16
CYDEV_UCFG_B0_P4_U0_CFG16 EQU 0x40010850
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG20
CYDEV_UCFG_B0_P4_U0_CFG20 EQU 0x40010854
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG21
CYDEV_UCFG_B0_P4_U0_CFG21 EQU 0x40010855
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG22
CYDEV_UCFG_B0_P4_U0_CFG22 EQU 0x40010856
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG23
CYDEV_UCFG_B0_P4_U0_CFG23 EQU 0x40010857
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG24
CYDEV_UCFG_B0_P4_U0_CFG24 EQU 0x40010858
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG25
CYDEV_UCFG_B0_P4_U0_CFG25 EQU 0x40010859
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG26
CYDEV_UCFG_B0_P4_U0_CFG26 EQU 0x4001085a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG27
CYDEV_UCFG_B0_P4_U0_CFG27 EQU 0x4001085b
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG28
CYDEV_UCFG_B0_P4_U0_CFG28 EQU 0x4001085c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG29
CYDEV_UCFG_B0_P4_U0_CFG29 EQU 0x4001085d
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG30
CYDEV_UCFG_B0_P4_U0_CFG30 EQU 0x4001085e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_CFG31
CYDEV_UCFG_B0_P4_U0_CFG31 EQU 0x4001085f
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_DCFG0
CYDEV_UCFG_B0_P4_U0_DCFG0 EQU 0x40010860
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_DCFG1
CYDEV_UCFG_B0_P4_U0_DCFG1 EQU 0x40010862
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_DCFG2
CYDEV_UCFG_B0_P4_U0_DCFG2 EQU 0x40010864
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_DCFG3
CYDEV_UCFG_B0_P4_U0_DCFG3 EQU 0x40010866
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_DCFG4
CYDEV_UCFG_B0_P4_U0_DCFG4 EQU 0x40010868
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_DCFG5
CYDEV_UCFG_B0_P4_U0_DCFG5 EQU 0x4001086a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_DCFG6
CYDEV_UCFG_B0_P4_U0_DCFG6 EQU 0x4001086c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U0_DCFG7
CYDEV_UCFG_B0_P4_U0_DCFG7 EQU 0x4001086e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_BASE
CYDEV_UCFG_B0_P4_U1_BASE EQU 0x40010880
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_SIZE
CYDEV_UCFG_B0_P4_U1_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_PLD_IT0
CYDEV_UCFG_B0_P4_U1_PLD_IT0 EQU 0x40010880
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_PLD_IT1
CYDEV_UCFG_B0_P4_U1_PLD_IT1 EQU 0x40010884
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_PLD_IT2
CYDEV_UCFG_B0_P4_U1_PLD_IT2 EQU 0x40010888
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_PLD_IT3
CYDEV_UCFG_B0_P4_U1_PLD_IT3 EQU 0x4001088c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_PLD_IT4
CYDEV_UCFG_B0_P4_U1_PLD_IT4 EQU 0x40010890
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_PLD_IT5
CYDEV_UCFG_B0_P4_U1_PLD_IT5 EQU 0x40010894
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_PLD_IT6
CYDEV_UCFG_B0_P4_U1_PLD_IT6 EQU 0x40010898
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_PLD_IT7
CYDEV_UCFG_B0_P4_U1_PLD_IT7 EQU 0x4001089c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_PLD_IT8
CYDEV_UCFG_B0_P4_U1_PLD_IT8 EQU 0x400108a0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_PLD_IT9
CYDEV_UCFG_B0_P4_U1_PLD_IT9 EQU 0x400108a4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_PLD_IT10
CYDEV_UCFG_B0_P4_U1_PLD_IT10 EQU 0x400108a8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_PLD_IT11
CYDEV_UCFG_B0_P4_U1_PLD_IT11 EQU 0x400108ac
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_PLD_ORT0
CYDEV_UCFG_B0_P4_U1_PLD_ORT0 EQU 0x400108b0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_PLD_ORT1
CYDEV_UCFG_B0_P4_U1_PLD_ORT1 EQU 0x400108b2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_PLD_ORT2
CYDEV_UCFG_B0_P4_U1_PLD_ORT2 EQU 0x400108b4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_PLD_ORT3
CYDEV_UCFG_B0_P4_U1_PLD_ORT3 EQU 0x400108b6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_MC_CFG_CEN_CONST
CYDEV_UCFG_B0_P4_U1_MC_CFG_CEN_CONST EQU 0x400108b8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_MC_CFG_XORFB
CYDEV_UCFG_B0_P4_U1_MC_CFG_XORFB EQU 0x400108ba
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_MC_CFG_SET_RESET
CYDEV_UCFG_B0_P4_U1_MC_CFG_SET_RESET EQU 0x400108bc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_MC_CFG_BYPASS
CYDEV_UCFG_B0_P4_U1_MC_CFG_BYPASS EQU 0x400108be
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG0
CYDEV_UCFG_B0_P4_U1_CFG0 EQU 0x400108c0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG1
CYDEV_UCFG_B0_P4_U1_CFG1 EQU 0x400108c1
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG2
CYDEV_UCFG_B0_P4_U1_CFG2 EQU 0x400108c2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG3
CYDEV_UCFG_B0_P4_U1_CFG3 EQU 0x400108c3
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG4
CYDEV_UCFG_B0_P4_U1_CFG4 EQU 0x400108c4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG5
CYDEV_UCFG_B0_P4_U1_CFG5 EQU 0x400108c5
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG6
CYDEV_UCFG_B0_P4_U1_CFG6 EQU 0x400108c6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG7
CYDEV_UCFG_B0_P4_U1_CFG7 EQU 0x400108c7
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG8
CYDEV_UCFG_B0_P4_U1_CFG8 EQU 0x400108c8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG9
CYDEV_UCFG_B0_P4_U1_CFG9 EQU 0x400108c9
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG10
CYDEV_UCFG_B0_P4_U1_CFG10 EQU 0x400108ca
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG11
CYDEV_UCFG_B0_P4_U1_CFG11 EQU 0x400108cb
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG12
CYDEV_UCFG_B0_P4_U1_CFG12 EQU 0x400108cc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG13
CYDEV_UCFG_B0_P4_U1_CFG13 EQU 0x400108cd
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG14
CYDEV_UCFG_B0_P4_U1_CFG14 EQU 0x400108ce
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG15
CYDEV_UCFG_B0_P4_U1_CFG15 EQU 0x400108cf
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG16
CYDEV_UCFG_B0_P4_U1_CFG16 EQU 0x400108d0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG20
CYDEV_UCFG_B0_P4_U1_CFG20 EQU 0x400108d4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG21
CYDEV_UCFG_B0_P4_U1_CFG21 EQU 0x400108d5
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG22
CYDEV_UCFG_B0_P4_U1_CFG22 EQU 0x400108d6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG23
CYDEV_UCFG_B0_P4_U1_CFG23 EQU 0x400108d7
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG24
CYDEV_UCFG_B0_P4_U1_CFG24 EQU 0x400108d8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG25
CYDEV_UCFG_B0_P4_U1_CFG25 EQU 0x400108d9
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG26
CYDEV_UCFG_B0_P4_U1_CFG26 EQU 0x400108da
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG27
CYDEV_UCFG_B0_P4_U1_CFG27 EQU 0x400108db
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG28
CYDEV_UCFG_B0_P4_U1_CFG28 EQU 0x400108dc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG29
CYDEV_UCFG_B0_P4_U1_CFG29 EQU 0x400108dd
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG30
CYDEV_UCFG_B0_P4_U1_CFG30 EQU 0x400108de
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_CFG31
CYDEV_UCFG_B0_P4_U1_CFG31 EQU 0x400108df
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_DCFG0
CYDEV_UCFG_B0_P4_U1_DCFG0 EQU 0x400108e0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_DCFG1
CYDEV_UCFG_B0_P4_U1_DCFG1 EQU 0x400108e2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_DCFG2
CYDEV_UCFG_B0_P4_U1_DCFG2 EQU 0x400108e4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_DCFG3
CYDEV_UCFG_B0_P4_U1_DCFG3 EQU 0x400108e6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_DCFG4
CYDEV_UCFG_B0_P4_U1_DCFG4 EQU 0x400108e8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_DCFG5
CYDEV_UCFG_B0_P4_U1_DCFG5 EQU 0x400108ea
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_DCFG6
CYDEV_UCFG_B0_P4_U1_DCFG6 EQU 0x400108ec
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_U1_DCFG7
CYDEV_UCFG_B0_P4_U1_DCFG7 EQU 0x400108ee
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_ROUTE_BASE
CYDEV_UCFG_B0_P4_ROUTE_BASE EQU 0x40010900
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P4_ROUTE_SIZE
CYDEV_UCFG_B0_P4_ROUTE_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_BASE
CYDEV_UCFG_B0_P5_BASE EQU 0x40010a00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_SIZE
CYDEV_UCFG_B0_P5_SIZE EQU 0x000001ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_BASE
CYDEV_UCFG_B0_P5_U0_BASE EQU 0x40010a00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_SIZE
CYDEV_UCFG_B0_P5_U0_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_PLD_IT0
CYDEV_UCFG_B0_P5_U0_PLD_IT0 EQU 0x40010a00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_PLD_IT1
CYDEV_UCFG_B0_P5_U0_PLD_IT1 EQU 0x40010a04
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_PLD_IT2
CYDEV_UCFG_B0_P5_U0_PLD_IT2 EQU 0x40010a08
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_PLD_IT3
CYDEV_UCFG_B0_P5_U0_PLD_IT3 EQU 0x40010a0c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_PLD_IT4
CYDEV_UCFG_B0_P5_U0_PLD_IT4 EQU 0x40010a10
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_PLD_IT5
CYDEV_UCFG_B0_P5_U0_PLD_IT5 EQU 0x40010a14
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_PLD_IT6
CYDEV_UCFG_B0_P5_U0_PLD_IT6 EQU 0x40010a18
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_PLD_IT7
CYDEV_UCFG_B0_P5_U0_PLD_IT7 EQU 0x40010a1c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_PLD_IT8
CYDEV_UCFG_B0_P5_U0_PLD_IT8 EQU 0x40010a20
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_PLD_IT9
CYDEV_UCFG_B0_P5_U0_PLD_IT9 EQU 0x40010a24
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_PLD_IT10
CYDEV_UCFG_B0_P5_U0_PLD_IT10 EQU 0x40010a28
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_PLD_IT11
CYDEV_UCFG_B0_P5_U0_PLD_IT11 EQU 0x40010a2c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_PLD_ORT0
CYDEV_UCFG_B0_P5_U0_PLD_ORT0 EQU 0x40010a30
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_PLD_ORT1
CYDEV_UCFG_B0_P5_U0_PLD_ORT1 EQU 0x40010a32
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_PLD_ORT2
CYDEV_UCFG_B0_P5_U0_PLD_ORT2 EQU 0x40010a34
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_PLD_ORT3
CYDEV_UCFG_B0_P5_U0_PLD_ORT3 EQU 0x40010a36
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_MC_CFG_CEN_CONST
CYDEV_UCFG_B0_P5_U0_MC_CFG_CEN_CONST EQU 0x40010a38
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_MC_CFG_XORFB
CYDEV_UCFG_B0_P5_U0_MC_CFG_XORFB EQU 0x40010a3a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_MC_CFG_SET_RESET
CYDEV_UCFG_B0_P5_U0_MC_CFG_SET_RESET EQU 0x40010a3c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_MC_CFG_BYPASS
CYDEV_UCFG_B0_P5_U0_MC_CFG_BYPASS EQU 0x40010a3e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG0
CYDEV_UCFG_B0_P5_U0_CFG0 EQU 0x40010a40
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG1
CYDEV_UCFG_B0_P5_U0_CFG1 EQU 0x40010a41
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG2
CYDEV_UCFG_B0_P5_U0_CFG2 EQU 0x40010a42
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG3
CYDEV_UCFG_B0_P5_U0_CFG3 EQU 0x40010a43
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG4
CYDEV_UCFG_B0_P5_U0_CFG4 EQU 0x40010a44
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG5
CYDEV_UCFG_B0_P5_U0_CFG5 EQU 0x40010a45
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG6
CYDEV_UCFG_B0_P5_U0_CFG6 EQU 0x40010a46
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG7
CYDEV_UCFG_B0_P5_U0_CFG7 EQU 0x40010a47
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG8
CYDEV_UCFG_B0_P5_U0_CFG8 EQU 0x40010a48
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG9
CYDEV_UCFG_B0_P5_U0_CFG9 EQU 0x40010a49
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG10
CYDEV_UCFG_B0_P5_U0_CFG10 EQU 0x40010a4a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG11
CYDEV_UCFG_B0_P5_U0_CFG11 EQU 0x40010a4b
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG12
CYDEV_UCFG_B0_P5_U0_CFG12 EQU 0x40010a4c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG13
CYDEV_UCFG_B0_P5_U0_CFG13 EQU 0x40010a4d
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG14
CYDEV_UCFG_B0_P5_U0_CFG14 EQU 0x40010a4e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG15
