MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv.inc
CYDEV_UCFG_B0_P5_U0_CFG15 EQU 0x40010a4f
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG16
CYDEV_UCFG_B0_P5_U0_CFG16 EQU 0x40010a50
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG20
CYDEV_UCFG_B0_P5_U0_CFG20 EQU 0x40010a54
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG21
CYDEV_UCFG_B0_P5_U0_CFG21 EQU 0x40010a55
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG22
CYDEV_UCFG_B0_P5_U0_CFG22 EQU 0x40010a56
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG23
CYDEV_UCFG_B0_P5_U0_CFG23 EQU 0x40010a57
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG24
CYDEV_UCFG_B0_P5_U0_CFG24 EQU 0x40010a58
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG25
CYDEV_UCFG_B0_P5_U0_CFG25 EQU 0x40010a59
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG26
CYDEV_UCFG_B0_P5_U0_CFG26 EQU 0x40010a5a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG27
CYDEV_UCFG_B0_P5_U0_CFG27 EQU 0x40010a5b
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG28
CYDEV_UCFG_B0_P5_U0_CFG28 EQU 0x40010a5c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG29
CYDEV_UCFG_B0_P5_U0_CFG29 EQU 0x40010a5d
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG30
CYDEV_UCFG_B0_P5_U0_CFG30 EQU 0x40010a5e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_CFG31
CYDEV_UCFG_B0_P5_U0_CFG31 EQU 0x40010a5f
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_DCFG0
CYDEV_UCFG_B0_P5_U0_DCFG0 EQU 0x40010a60
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_DCFG1
CYDEV_UCFG_B0_P5_U0_DCFG1 EQU 0x40010a62
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_DCFG2
CYDEV_UCFG_B0_P5_U0_DCFG2 EQU 0x40010a64
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_DCFG3
CYDEV_UCFG_B0_P5_U0_DCFG3 EQU 0x40010a66
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_DCFG4
CYDEV_UCFG_B0_P5_U0_DCFG4 EQU 0x40010a68
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_DCFG5
CYDEV_UCFG_B0_P5_U0_DCFG5 EQU 0x40010a6a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_DCFG6
CYDEV_UCFG_B0_P5_U0_DCFG6 EQU 0x40010a6c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U0_DCFG7
CYDEV_UCFG_B0_P5_U0_DCFG7 EQU 0x40010a6e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_BASE
CYDEV_UCFG_B0_P5_U1_BASE EQU 0x40010a80
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_SIZE
CYDEV_UCFG_B0_P5_U1_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_PLD_IT0
CYDEV_UCFG_B0_P5_U1_PLD_IT0 EQU 0x40010a80
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_PLD_IT1
CYDEV_UCFG_B0_P5_U1_PLD_IT1 EQU 0x40010a84
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_PLD_IT2
CYDEV_UCFG_B0_P5_U1_PLD_IT2 EQU 0x40010a88
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_PLD_IT3
CYDEV_UCFG_B0_P5_U1_PLD_IT3 EQU 0x40010a8c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_PLD_IT4
CYDEV_UCFG_B0_P5_U1_PLD_IT4 EQU 0x40010a90
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_PLD_IT5
CYDEV_UCFG_B0_P5_U1_PLD_IT5 EQU 0x40010a94
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_PLD_IT6
CYDEV_UCFG_B0_P5_U1_PLD_IT6 EQU 0x40010a98
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_PLD_IT7
CYDEV_UCFG_B0_P5_U1_PLD_IT7 EQU 0x40010a9c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_PLD_IT8
CYDEV_UCFG_B0_P5_U1_PLD_IT8 EQU 0x40010aa0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_PLD_IT9
CYDEV_UCFG_B0_P5_U1_PLD_IT9 EQU 0x40010aa4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_PLD_IT10
CYDEV_UCFG_B0_P5_U1_PLD_IT10 EQU 0x40010aa8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_PLD_IT11
CYDEV_UCFG_B0_P5_U1_PLD_IT11 EQU 0x40010aac
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_PLD_ORT0
CYDEV_UCFG_B0_P5_U1_PLD_ORT0 EQU 0x40010ab0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_PLD_ORT1
CYDEV_UCFG_B0_P5_U1_PLD_ORT1 EQU 0x40010ab2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_PLD_ORT2
CYDEV_UCFG_B0_P5_U1_PLD_ORT2 EQU 0x40010ab4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_PLD_ORT3
CYDEV_UCFG_B0_P5_U1_PLD_ORT3 EQU 0x40010ab6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_MC_CFG_CEN_CONST
CYDEV_UCFG_B0_P5_U1_MC_CFG_CEN_CONST EQU 0x40010ab8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_MC_CFG_XORFB
CYDEV_UCFG_B0_P5_U1_MC_CFG_XORFB EQU 0x40010aba
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_MC_CFG_SET_RESET
CYDEV_UCFG_B0_P5_U1_MC_CFG_SET_RESET EQU 0x40010abc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_MC_CFG_BYPASS
CYDEV_UCFG_B0_P5_U1_MC_CFG_BYPASS EQU 0x40010abe
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG0
CYDEV_UCFG_B0_P5_U1_CFG0 EQU 0x40010ac0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG1
CYDEV_UCFG_B0_P5_U1_CFG1 EQU 0x40010ac1
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG2
CYDEV_UCFG_B0_P5_U1_CFG2 EQU 0x40010ac2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG3
CYDEV_UCFG_B0_P5_U1_CFG3 EQU 0x40010ac3
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG4
CYDEV_UCFG_B0_P5_U1_CFG4 EQU 0x40010ac4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG5
CYDEV_UCFG_B0_P5_U1_CFG5 EQU 0x40010ac5
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG6
CYDEV_UCFG_B0_P5_U1_CFG6 EQU 0x40010ac6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG7
CYDEV_UCFG_B0_P5_U1_CFG7 EQU 0x40010ac7
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG8
CYDEV_UCFG_B0_P5_U1_CFG8 EQU 0x40010ac8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG9
CYDEV_UCFG_B0_P5_U1_CFG9 EQU 0x40010ac9
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG10
CYDEV_UCFG_B0_P5_U1_CFG10 EQU 0x40010aca
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG11
CYDEV_UCFG_B0_P5_U1_CFG11 EQU 0x40010acb
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG12
CYDEV_UCFG_B0_P5_U1_CFG12 EQU 0x40010acc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG13
CYDEV_UCFG_B0_P5_U1_CFG13 EQU 0x40010acd
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG14
CYDEV_UCFG_B0_P5_U1_CFG14 EQU 0x40010ace
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG15
CYDEV_UCFG_B0_P5_U1_CFG15 EQU 0x40010acf
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG16
CYDEV_UCFG_B0_P5_U1_CFG16 EQU 0x40010ad0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG20
CYDEV_UCFG_B0_P5_U1_CFG20 EQU 0x40010ad4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG21
CYDEV_UCFG_B0_P5_U1_CFG21 EQU 0x40010ad5
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG22
CYDEV_UCFG_B0_P5_U1_CFG22 EQU 0x40010ad6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG23
CYDEV_UCFG_B0_P5_U1_CFG23 EQU 0x40010ad7
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG24
CYDEV_UCFG_B0_P5_U1_CFG24 EQU 0x40010ad8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG25
CYDEV_UCFG_B0_P5_U1_CFG25 EQU 0x40010ad9
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG26
CYDEV_UCFG_B0_P5_U1_CFG26 EQU 0x40010ada
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG27
CYDEV_UCFG_B0_P5_U1_CFG27 EQU 0x40010adb
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG28
CYDEV_UCFG_B0_P5_U1_CFG28 EQU 0x40010adc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG29
CYDEV_UCFG_B0_P5_U1_CFG29 EQU 0x40010add
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG30
CYDEV_UCFG_B0_P5_U1_CFG30 EQU 0x40010ade
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_CFG31
CYDEV_UCFG_B0_P5_U1_CFG31 EQU 0x40010adf
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_DCFG0
CYDEV_UCFG_B0_P5_U1_DCFG0 EQU 0x40010ae0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_DCFG1
CYDEV_UCFG_B0_P5_U1_DCFG1 EQU 0x40010ae2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_DCFG2
CYDEV_UCFG_B0_P5_U1_DCFG2 EQU 0x40010ae4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_DCFG3
CYDEV_UCFG_B0_P5_U1_DCFG3 EQU 0x40010ae6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_DCFG4
CYDEV_UCFG_B0_P5_U1_DCFG4 EQU 0x40010ae8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_DCFG5
CYDEV_UCFG_B0_P5_U1_DCFG5 EQU 0x40010aea
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_DCFG6
CYDEV_UCFG_B0_P5_U1_DCFG6 EQU 0x40010aec
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_U1_DCFG7
CYDEV_UCFG_B0_P5_U1_DCFG7 EQU 0x40010aee
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_ROUTE_BASE
CYDEV_UCFG_B0_P5_ROUTE_BASE EQU 0x40010b00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P5_ROUTE_SIZE
CYDEV_UCFG_B0_P5_ROUTE_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_BASE
CYDEV_UCFG_B0_P6_BASE EQU 0x40010c00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_SIZE
CYDEV_UCFG_B0_P6_SIZE EQU 0x000001ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_BASE
CYDEV_UCFG_B0_P6_U0_BASE EQU 0x40010c00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_SIZE
CYDEV_UCFG_B0_P6_U0_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_PLD_IT0
CYDEV_UCFG_B0_P6_U0_PLD_IT0 EQU 0x40010c00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_PLD_IT1
CYDEV_UCFG_B0_P6_U0_PLD_IT1 EQU 0x40010c04
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_PLD_IT2
CYDEV_UCFG_B0_P6_U0_PLD_IT2 EQU 0x40010c08
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_PLD_IT3
CYDEV_UCFG_B0_P6_U0_PLD_IT3 EQU 0x40010c0c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_PLD_IT4
CYDEV_UCFG_B0_P6_U0_PLD_IT4 EQU 0x40010c10
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_PLD_IT5
CYDEV_UCFG_B0_P6_U0_PLD_IT5 EQU 0x40010c14
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_PLD_IT6
CYDEV_UCFG_B0_P6_U0_PLD_IT6 EQU 0x40010c18
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_PLD_IT7
CYDEV_UCFG_B0_P6_U0_PLD_IT7 EQU 0x40010c1c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_PLD_IT8
CYDEV_UCFG_B0_P6_U0_PLD_IT8 EQU 0x40010c20
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_PLD_IT9
CYDEV_UCFG_B0_P6_U0_PLD_IT9 EQU 0x40010c24
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_PLD_IT10
CYDEV_UCFG_B0_P6_U0_PLD_IT10 EQU 0x40010c28
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_PLD_IT11
CYDEV_UCFG_B0_P6_U0_PLD_IT11 EQU 0x40010c2c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_PLD_ORT0
CYDEV_UCFG_B0_P6_U0_PLD_ORT0 EQU 0x40010c30
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_PLD_ORT1
CYDEV_UCFG_B0_P6_U0_PLD_ORT1 EQU 0x40010c32
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_PLD_ORT2
CYDEV_UCFG_B0_P6_U0_PLD_ORT2 EQU 0x40010c34
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_PLD_ORT3
CYDEV_UCFG_B0_P6_U0_PLD_ORT3 EQU 0x40010c36
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_MC_CFG_CEN_CONST
CYDEV_UCFG_B0_P6_U0_MC_CFG_CEN_CONST EQU 0x40010c38
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_MC_CFG_XORFB
CYDEV_UCFG_B0_P6_U0_MC_CFG_XORFB EQU 0x40010c3a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_MC_CFG_SET_RESET
CYDEV_UCFG_B0_P6_U0_MC_CFG_SET_RESET EQU 0x40010c3c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_MC_CFG_BYPASS
CYDEV_UCFG_B0_P6_U0_MC_CFG_BYPASS EQU 0x40010c3e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG0
CYDEV_UCFG_B0_P6_U0_CFG0 EQU 0x40010c40
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG1
CYDEV_UCFG_B0_P6_U0_CFG1 EQU 0x40010c41
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG2
CYDEV_UCFG_B0_P6_U0_CFG2 EQU 0x40010c42
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG3
CYDEV_UCFG_B0_P6_U0_CFG3 EQU 0x40010c43
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG4
CYDEV_UCFG_B0_P6_U0_CFG4 EQU 0x40010c44
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG5
CYDEV_UCFG_B0_P6_U0_CFG5 EQU 0x40010c45
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG6
CYDEV_UCFG_B0_P6_U0_CFG6 EQU 0x40010c46
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG7
CYDEV_UCFG_B0_P6_U0_CFG7 EQU 0x40010c47
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG8
CYDEV_UCFG_B0_P6_U0_CFG8 EQU 0x40010c48
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG9
CYDEV_UCFG_B0_P6_U0_CFG9 EQU 0x40010c49
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG10
CYDEV_UCFG_B0_P6_U0_CFG10 EQU 0x40010c4a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG11
CYDEV_UCFG_B0_P6_U0_CFG11 EQU 0x40010c4b
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG12
CYDEV_UCFG_B0_P6_U0_CFG12 EQU 0x40010c4c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG13
CYDEV_UCFG_B0_P6_U0_CFG13 EQU 0x40010c4d
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG14
CYDEV_UCFG_B0_P6_U0_CFG14 EQU 0x40010c4e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG15
CYDEV_UCFG_B0_P6_U0_CFG15 EQU 0x40010c4f
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG16
CYDEV_UCFG_B0_P6_U0_CFG16 EQU 0x40010c50
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG20
CYDEV_UCFG_B0_P6_U0_CFG20 EQU 0x40010c54
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG21
CYDEV_UCFG_B0_P6_U0_CFG21 EQU 0x40010c55
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG22
CYDEV_UCFG_B0_P6_U0_CFG22 EQU 0x40010c56
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG23
CYDEV_UCFG_B0_P6_U0_CFG23 EQU 0x40010c57
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG24
CYDEV_UCFG_B0_P6_U0_CFG24 EQU 0x40010c58
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG25
CYDEV_UCFG_B0_P6_U0_CFG25 EQU 0x40010c59
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG26
CYDEV_UCFG_B0_P6_U0_CFG26 EQU 0x40010c5a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG27
CYDEV_UCFG_B0_P6_U0_CFG27 EQU 0x40010c5b
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG28
CYDEV_UCFG_B0_P6_U0_CFG28 EQU 0x40010c5c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG29
CYDEV_UCFG_B0_P6_U0_CFG29 EQU 0x40010c5d
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG30
CYDEV_UCFG_B0_P6_U0_CFG30 EQU 0x40010c5e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_CFG31
CYDEV_UCFG_B0_P6_U0_CFG31 EQU 0x40010c5f
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_DCFG0
CYDEV_UCFG_B0_P6_U0_DCFG0 EQU 0x40010c60
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_DCFG1
CYDEV_UCFG_B0_P6_U0_DCFG1 EQU 0x40010c62
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_DCFG2
CYDEV_UCFG_B0_P6_U0_DCFG2 EQU 0x40010c64
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_DCFG3
CYDEV_UCFG_B0_P6_U0_DCFG3 EQU 0x40010c66
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_DCFG4
CYDEV_UCFG_B0_P6_U0_DCFG4 EQU 0x40010c68
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_DCFG5
CYDEV_UCFG_B0_P6_U0_DCFG5 EQU 0x40010c6a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_DCFG6
CYDEV_UCFG_B0_P6_U0_DCFG6 EQU 0x40010c6c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U0_DCFG7
CYDEV_UCFG_B0_P6_U0_DCFG7 EQU 0x40010c6e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_BASE
CYDEV_UCFG_B0_P6_U1_BASE EQU 0x40010c80
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_SIZE
CYDEV_UCFG_B0_P6_U1_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_PLD_IT0
CYDEV_UCFG_B0_P6_U1_PLD_IT0 EQU 0x40010c80
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_PLD_IT1
CYDEV_UCFG_B0_P6_U1_PLD_IT1 EQU 0x40010c84
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_PLD_IT2
CYDEV_UCFG_B0_P6_U1_PLD_IT2 EQU 0x40010c88
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_PLD_IT3
CYDEV_UCFG_B0_P6_U1_PLD_IT3 EQU 0x40010c8c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_PLD_IT4
CYDEV_UCFG_B0_P6_U1_PLD_IT4 EQU 0x40010c90
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_PLD_IT5
CYDEV_UCFG_B0_P6_U1_PLD_IT5 EQU 0x40010c94
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_PLD_IT6
CYDEV_UCFG_B0_P6_U1_PLD_IT6 EQU 0x40010c98
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_PLD_IT7
CYDEV_UCFG_B0_P6_U1_PLD_IT7 EQU 0x40010c9c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_PLD_IT8
CYDEV_UCFG_B0_P6_U1_PLD_IT8 EQU 0x40010ca0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_PLD_IT9
CYDEV_UCFG_B0_P6_U1_PLD_IT9 EQU 0x40010ca4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_PLD_IT10
CYDEV_UCFG_B0_P6_U1_PLD_IT10 EQU 0x40010ca8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_PLD_IT11
CYDEV_UCFG_B0_P6_U1_PLD_IT11 EQU 0x40010cac
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_PLD_ORT0
CYDEV_UCFG_B0_P6_U1_PLD_ORT0 EQU 0x40010cb0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_PLD_ORT1
CYDEV_UCFG_B0_P6_U1_PLD_ORT1 EQU 0x40010cb2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_PLD_ORT2
CYDEV_UCFG_B0_P6_U1_PLD_ORT2 EQU 0x40010cb4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_PLD_ORT3
CYDEV_UCFG_B0_P6_U1_PLD_ORT3 EQU 0x40010cb6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_MC_CFG_CEN_CONST
CYDEV_UCFG_B0_P6_U1_MC_CFG_CEN_CONST EQU 0x40010cb8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_MC_CFG_XORFB
CYDEV_UCFG_B0_P6_U1_MC_CFG_XORFB EQU 0x40010cba
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_MC_CFG_SET_RESET
CYDEV_UCFG_B0_P6_U1_MC_CFG_SET_RESET EQU 0x40010cbc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_MC_CFG_BYPASS
CYDEV_UCFG_B0_P6_U1_MC_CFG_BYPASS EQU 0x40010cbe
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG0
CYDEV_UCFG_B0_P6_U1_CFG0 EQU 0x40010cc0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG1
CYDEV_UCFG_B0_P6_U1_CFG1 EQU 0x40010cc1
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG2
CYDEV_UCFG_B0_P6_U1_CFG2 EQU 0x40010cc2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG3
CYDEV_UCFG_B0_P6_U1_CFG3 EQU 0x40010cc3
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG4
CYDEV_UCFG_B0_P6_U1_CFG4 EQU 0x40010cc4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG5
CYDEV_UCFG_B0_P6_U1_CFG5 EQU 0x40010cc5
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG6
CYDEV_UCFG_B0_P6_U1_CFG6 EQU 0x40010cc6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG7
CYDEV_UCFG_B0_P6_U1_CFG7 EQU 0x40010cc7
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG8
CYDEV_UCFG_B0_P6_U1_CFG8 EQU 0x40010cc8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG9
CYDEV_UCFG_B0_P6_U1_CFG9 EQU 0x40010cc9
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG10
CYDEV_UCFG_B0_P6_U1_CFG10 EQU 0x40010cca
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG11
CYDEV_UCFG_B0_P6_U1_CFG11 EQU 0x40010ccb
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG12
CYDEV_UCFG_B0_P6_U1_CFG12 EQU 0x40010ccc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG13
CYDEV_UCFG_B0_P6_U1_CFG13 EQU 0x40010ccd
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG14
CYDEV_UCFG_B0_P6_U1_CFG14 EQU 0x40010cce
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG15
CYDEV_UCFG_B0_P6_U1_CFG15 EQU 0x40010ccf
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG16
CYDEV_UCFG_B0_P6_U1_CFG16 EQU 0x40010cd0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG20
CYDEV_UCFG_B0_P6_U1_CFG20 EQU 0x40010cd4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG21
CYDEV_UCFG_B0_P6_U1_CFG21 EQU 0x40010cd5
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG22
CYDEV_UCFG_B0_P6_U1_CFG22 EQU 0x40010cd6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG23
CYDEV_UCFG_B0_P6_U1_CFG23 EQU 0x40010cd7
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG24
CYDEV_UCFG_B0_P6_U1_CFG24 EQU 0x40010cd8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG25
CYDEV_UCFG_B0_P6_U1_CFG25 EQU 0x40010cd9
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG26
CYDEV_UCFG_B0_P6_U1_CFG26 EQU 0x40010cda
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG27
CYDEV_UCFG_B0_P6_U1_CFG27 EQU 0x40010cdb
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG28
CYDEV_UCFG_B0_P6_U1_CFG28 EQU 0x40010cdc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG29
CYDEV_UCFG_B0_P6_U1_CFG29 EQU 0x40010cdd
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG30
CYDEV_UCFG_B0_P6_U1_CFG30 EQU 0x40010cde
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_CFG31
CYDEV_UCFG_B0_P6_U1_CFG31 EQU 0x40010cdf
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_DCFG0
CYDEV_UCFG_B0_P6_U1_DCFG0 EQU 0x40010ce0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_DCFG1
CYDEV_UCFG_B0_P6_U1_DCFG1 EQU 0x40010ce2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_DCFG2
CYDEV_UCFG_B0_P6_U1_DCFG2 EQU 0x40010ce4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_DCFG3
CYDEV_UCFG_B0_P6_U1_DCFG3 EQU 0x40010ce6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_DCFG4
CYDEV_UCFG_B0_P6_U1_DCFG4 EQU 0x40010ce8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_DCFG5
CYDEV_UCFG_B0_P6_U1_DCFG5 EQU 0x40010cea
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_DCFG6
CYDEV_UCFG_B0_P6_U1_DCFG6 EQU 0x40010cec
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_U1_DCFG7
CYDEV_UCFG_B0_P6_U1_DCFG7 EQU 0x40010cee
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_ROUTE_BASE
CYDEV_UCFG_B0_P6_ROUTE_BASE EQU 0x40010d00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P6_ROUTE_SIZE
CYDEV_UCFG_B0_P6_ROUTE_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_BASE
CYDEV_UCFG_B0_P7_BASE EQU 0x40010e00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_SIZE
CYDEV_UCFG_B0_P7_SIZE EQU 0x000001ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_BASE
CYDEV_UCFG_B0_P7_U0_BASE EQU 0x40010e00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_SIZE
CYDEV_UCFG_B0_P7_U0_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_PLD_IT0
CYDEV_UCFG_B0_P7_U0_PLD_IT0 EQU 0x40010e00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_PLD_IT1
CYDEV_UCFG_B0_P7_U0_PLD_IT1 EQU 0x40010e04
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_PLD_IT2
CYDEV_UCFG_B0_P7_U0_PLD_IT2 EQU 0x40010e08
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_PLD_IT3
CYDEV_UCFG_B0_P7_U0_PLD_IT3 EQU 0x40010e0c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_PLD_IT4
CYDEV_UCFG_B0_P7_U0_PLD_IT4 EQU 0x40010e10
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_PLD_IT5
CYDEV_UCFG_B0_P7_U0_PLD_IT5 EQU 0x40010e14
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_PLD_IT6
CYDEV_UCFG_B0_P7_U0_PLD_IT6 EQU 0x40010e18
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_PLD_IT7
CYDEV_UCFG_B0_P7_U0_PLD_IT7 EQU 0x40010e1c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_PLD_IT8
CYDEV_UCFG_B0_P7_U0_PLD_IT8 EQU 0x40010e20
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_PLD_IT9
CYDEV_UCFG_B0_P7_U0_PLD_IT9 EQU 0x40010e24
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_PLD_IT10
CYDEV_UCFG_B0_P7_U0_PLD_IT10 EQU 0x40010e28
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_PLD_IT11
CYDEV_UCFG_B0_P7_U0_PLD_IT11 EQU 0x40010e2c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_PLD_ORT0
CYDEV_UCFG_B0_P7_U0_PLD_ORT0 EQU 0x40010e30
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_PLD_ORT1
CYDEV_UCFG_B0_P7_U0_PLD_ORT1 EQU 0x40010e32
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_PLD_ORT2
CYDEV_UCFG_B0_P7_U0_PLD_ORT2 EQU 0x40010e34
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_PLD_ORT3
CYDEV_UCFG_B0_P7_U0_PLD_ORT3 EQU 0x40010e36
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_MC_CFG_CEN_CONST
CYDEV_UCFG_B0_P7_U0_MC_CFG_CEN_CONST EQU 0x40010e38
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_MC_CFG_XORFB
CYDEV_UCFG_B0_P7_U0_MC_CFG_XORFB EQU 0x40010e3a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_MC_CFG_SET_RESET
CYDEV_UCFG_B0_P7_U0_MC_CFG_SET_RESET EQU 0x40010e3c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_MC_CFG_BYPASS
CYDEV_UCFG_B0_P7_U0_MC_CFG_BYPASS EQU 0x40010e3e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_CFG0
CYDEV_UCFG_B0_P7_U0_CFG0 EQU 0x40010e40
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_CFG1
CYDEV_UCFG_B0_P7_U0_CFG1 EQU 0x40010e41
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_CFG2
CYDEV_UCFG_B0_P7_U0_CFG2 EQU 0x40010e42
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_CFG3
CYDEV_UCFG_B0_P7_U0_CFG3 EQU 0x40010e43
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_CFG4
CYDEV_UCFG_B0_P7_U0_CFG4 EQU 0x40010e44
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_CFG5
CYDEV_UCFG_B0_P7_U0_CFG5 EQU 0x40010e45
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_CFG6
CYDEV_UCFG_B0_P7_U0_CFG6 EQU 0x40010e46
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_CFG7
CYDEV_UCFG_B0_P7_U0_CFG7 EQU 0x40010e47
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_CFG8
CYDEV_UCFG_B0_P7_U0_CFG8 EQU 0x40010e48
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_CFG9
CYDEV_UCFG_B0_P7_U0_CFG9 EQU 0x40010e49
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B0_P7_U0_CFG10
CYDEV_UCFG_B0_P7_U0_CFG10 EQU 0x40010e4a
    ENDIF
