MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv.inc
CYDEV_UCFG_B1_P5_U0_CFG0 EQU 0x40011a40
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG1
CYDEV_UCFG_B1_P5_U0_CFG1 EQU 0x40011a41
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG2
CYDEV_UCFG_B1_P5_U0_CFG2 EQU 0x40011a42
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG3
CYDEV_UCFG_B1_P5_U0_CFG3 EQU 0x40011a43
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG4
CYDEV_UCFG_B1_P5_U0_CFG4 EQU 0x40011a44
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG5
CYDEV_UCFG_B1_P5_U0_CFG5 EQU 0x40011a45
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG6
CYDEV_UCFG_B1_P5_U0_CFG6 EQU 0x40011a46
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG7
CYDEV_UCFG_B1_P5_U0_CFG7 EQU 0x40011a47
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG8
CYDEV_UCFG_B1_P5_U0_CFG8 EQU 0x40011a48
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG9
CYDEV_UCFG_B1_P5_U0_CFG9 EQU 0x40011a49
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG10
CYDEV_UCFG_B1_P5_U0_CFG10 EQU 0x40011a4a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG11
CYDEV_UCFG_B1_P5_U0_CFG11 EQU 0x40011a4b
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG12
CYDEV_UCFG_B1_P5_U0_CFG12 EQU 0x40011a4c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG13
CYDEV_UCFG_B1_P5_U0_CFG13 EQU 0x40011a4d
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG14
CYDEV_UCFG_B1_P5_U0_CFG14 EQU 0x40011a4e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG15
CYDEV_UCFG_B1_P5_U0_CFG15 EQU 0x40011a4f
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG16
CYDEV_UCFG_B1_P5_U0_CFG16 EQU 0x40011a50
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG20
CYDEV_UCFG_B1_P5_U0_CFG20 EQU 0x40011a54
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG21
CYDEV_UCFG_B1_P5_U0_CFG21 EQU 0x40011a55
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG22
CYDEV_UCFG_B1_P5_U0_CFG22 EQU 0x40011a56
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG23
CYDEV_UCFG_B1_P5_U0_CFG23 EQU 0x40011a57
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG24
CYDEV_UCFG_B1_P5_U0_CFG24 EQU 0x40011a58
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG25
CYDEV_UCFG_B1_P5_U0_CFG25 EQU 0x40011a59
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG26
CYDEV_UCFG_B1_P5_U0_CFG26 EQU 0x40011a5a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG27
CYDEV_UCFG_B1_P5_U0_CFG27 EQU 0x40011a5b
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG28
CYDEV_UCFG_B1_P5_U0_CFG28 EQU 0x40011a5c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG29
CYDEV_UCFG_B1_P5_U0_CFG29 EQU 0x40011a5d
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG30
CYDEV_UCFG_B1_P5_U0_CFG30 EQU 0x40011a5e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_CFG31
CYDEV_UCFG_B1_P5_U0_CFG31 EQU 0x40011a5f
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_DCFG0
CYDEV_UCFG_B1_P5_U0_DCFG0 EQU 0x40011a60
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_DCFG1
CYDEV_UCFG_B1_P5_U0_DCFG1 EQU 0x40011a62
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_DCFG2
CYDEV_UCFG_B1_P5_U0_DCFG2 EQU 0x40011a64
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_DCFG3
CYDEV_UCFG_B1_P5_U0_DCFG3 EQU 0x40011a66
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_DCFG4
CYDEV_UCFG_B1_P5_U0_DCFG4 EQU 0x40011a68
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_DCFG5
CYDEV_UCFG_B1_P5_U0_DCFG5 EQU 0x40011a6a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_DCFG6
CYDEV_UCFG_B1_P5_U0_DCFG6 EQU 0x40011a6c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U0_DCFG7
CYDEV_UCFG_B1_P5_U0_DCFG7 EQU 0x40011a6e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_BASE
CYDEV_UCFG_B1_P5_U1_BASE EQU 0x40011a80
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_SIZE
CYDEV_UCFG_B1_P5_U1_SIZE EQU 0x00000070
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_PLD_IT0
CYDEV_UCFG_B1_P5_U1_PLD_IT0 EQU 0x40011a80
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_PLD_IT1
CYDEV_UCFG_B1_P5_U1_PLD_IT1 EQU 0x40011a84
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_PLD_IT2
CYDEV_UCFG_B1_P5_U1_PLD_IT2 EQU 0x40011a88
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_PLD_IT3
CYDEV_UCFG_B1_P5_U1_PLD_IT3 EQU 0x40011a8c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_PLD_IT4
CYDEV_UCFG_B1_P5_U1_PLD_IT4 EQU 0x40011a90
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_PLD_IT5
CYDEV_UCFG_B1_P5_U1_PLD_IT5 EQU 0x40011a94
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_PLD_IT6
CYDEV_UCFG_B1_P5_U1_PLD_IT6 EQU 0x40011a98
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_PLD_IT7
CYDEV_UCFG_B1_P5_U1_PLD_IT7 EQU 0x40011a9c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_PLD_IT8
CYDEV_UCFG_B1_P5_U1_PLD_IT8 EQU 0x40011aa0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_PLD_IT9
CYDEV_UCFG_B1_P5_U1_PLD_IT9 EQU 0x40011aa4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_PLD_IT10
CYDEV_UCFG_B1_P5_U1_PLD_IT10 EQU 0x40011aa8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_PLD_IT11
CYDEV_UCFG_B1_P5_U1_PLD_IT11 EQU 0x40011aac
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_PLD_ORT0
CYDEV_UCFG_B1_P5_U1_PLD_ORT0 EQU 0x40011ab0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_PLD_ORT1
CYDEV_UCFG_B1_P5_U1_PLD_ORT1 EQU 0x40011ab2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_PLD_ORT2
CYDEV_UCFG_B1_P5_U1_PLD_ORT2 EQU 0x40011ab4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_PLD_ORT3
CYDEV_UCFG_B1_P5_U1_PLD_ORT3 EQU 0x40011ab6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_MC_CFG_CEN_CONST
CYDEV_UCFG_B1_P5_U1_MC_CFG_CEN_CONST EQU 0x40011ab8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_MC_CFG_XORFB
CYDEV_UCFG_B1_P5_U1_MC_CFG_XORFB EQU 0x40011aba
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_MC_CFG_SET_RESET
CYDEV_UCFG_B1_P5_U1_MC_CFG_SET_RESET EQU 0x40011abc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_MC_CFG_BYPASS
CYDEV_UCFG_B1_P5_U1_MC_CFG_BYPASS EQU 0x40011abe
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG0
CYDEV_UCFG_B1_P5_U1_CFG0 EQU 0x40011ac0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG1
CYDEV_UCFG_B1_P5_U1_CFG1 EQU 0x40011ac1
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG2
CYDEV_UCFG_B1_P5_U1_CFG2 EQU 0x40011ac2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG3
CYDEV_UCFG_B1_P5_U1_CFG3 EQU 0x40011ac3
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG4
CYDEV_UCFG_B1_P5_U1_CFG4 EQU 0x40011ac4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG5
CYDEV_UCFG_B1_P5_U1_CFG5 EQU 0x40011ac5
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG6
CYDEV_UCFG_B1_P5_U1_CFG6 EQU 0x40011ac6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG7
CYDEV_UCFG_B1_P5_U1_CFG7 EQU 0x40011ac7
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG8
CYDEV_UCFG_B1_P5_U1_CFG8 EQU 0x40011ac8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG9
CYDEV_UCFG_B1_P5_U1_CFG9 EQU 0x40011ac9
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG10
CYDEV_UCFG_B1_P5_U1_CFG10 EQU 0x40011aca
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG11
CYDEV_UCFG_B1_P5_U1_CFG11 EQU 0x40011acb
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG12
CYDEV_UCFG_B1_P5_U1_CFG12 EQU 0x40011acc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG13
CYDEV_UCFG_B1_P5_U1_CFG13 EQU 0x40011acd
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG14
CYDEV_UCFG_B1_P5_U1_CFG14 EQU 0x40011ace
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG15
CYDEV_UCFG_B1_P5_U1_CFG15 EQU 0x40011acf
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG16
CYDEV_UCFG_B1_P5_U1_CFG16 EQU 0x40011ad0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG20
CYDEV_UCFG_B1_P5_U1_CFG20 EQU 0x40011ad4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG21
CYDEV_UCFG_B1_P5_U1_CFG21 EQU 0x40011ad5
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG22
CYDEV_UCFG_B1_P5_U1_CFG22 EQU 0x40011ad6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG23
CYDEV_UCFG_B1_P5_U1_CFG23 EQU 0x40011ad7
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG24
CYDEV_UCFG_B1_P5_U1_CFG24 EQU 0x40011ad8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG25
CYDEV_UCFG_B1_P5_U1_CFG25 EQU 0x40011ad9
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG26
CYDEV_UCFG_B1_P5_U1_CFG26 EQU 0x40011ada
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG27
CYDEV_UCFG_B1_P5_U1_CFG27 EQU 0x40011adb
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG28
CYDEV_UCFG_B1_P5_U1_CFG28 EQU 0x40011adc
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG29
CYDEV_UCFG_B1_P5_U1_CFG29 EQU 0x40011add
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG30
CYDEV_UCFG_B1_P5_U1_CFG30 EQU 0x40011ade
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_CFG31
CYDEV_UCFG_B1_P5_U1_CFG31 EQU 0x40011adf
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_DCFG0
CYDEV_UCFG_B1_P5_U1_DCFG0 EQU 0x40011ae0
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_DCFG1
CYDEV_UCFG_B1_P5_U1_DCFG1 EQU 0x40011ae2
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_DCFG2
CYDEV_UCFG_B1_P5_U1_DCFG2 EQU 0x40011ae4
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_DCFG3
CYDEV_UCFG_B1_P5_U1_DCFG3 EQU 0x40011ae6
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_DCFG4
CYDEV_UCFG_B1_P5_U1_DCFG4 EQU 0x40011ae8
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_DCFG5
CYDEV_UCFG_B1_P5_U1_DCFG5 EQU 0x40011aea
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_DCFG6
CYDEV_UCFG_B1_P5_U1_DCFG6 EQU 0x40011aec
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_U1_DCFG7
CYDEV_UCFG_B1_P5_U1_DCFG7 EQU 0x40011aee
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_ROUTE_BASE
CYDEV_UCFG_B1_P5_ROUTE_BASE EQU 0x40011b00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_B1_P5_ROUTE_SIZE
CYDEV_UCFG_B1_P5_ROUTE_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI0_BASE
CYDEV_UCFG_DSI0_BASE EQU 0x40014000
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI0_SIZE
CYDEV_UCFG_DSI0_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI1_BASE
CYDEV_UCFG_DSI1_BASE EQU 0x40014100
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI1_SIZE
CYDEV_UCFG_DSI1_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI2_BASE
CYDEV_UCFG_DSI2_BASE EQU 0x40014200
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI2_SIZE
CYDEV_UCFG_DSI2_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI3_BASE
CYDEV_UCFG_DSI3_BASE EQU 0x40014300
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI3_SIZE
CYDEV_UCFG_DSI3_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI4_BASE
CYDEV_UCFG_DSI4_BASE EQU 0x40014400
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI4_SIZE
CYDEV_UCFG_DSI4_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI5_BASE
CYDEV_UCFG_DSI5_BASE EQU 0x40014500
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI5_SIZE
CYDEV_UCFG_DSI5_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI6_BASE
CYDEV_UCFG_DSI6_BASE EQU 0x40014600
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI6_SIZE
CYDEV_UCFG_DSI6_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI7_BASE
CYDEV_UCFG_DSI7_BASE EQU 0x40014700
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI7_SIZE
CYDEV_UCFG_DSI7_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI8_BASE
CYDEV_UCFG_DSI8_BASE EQU 0x40014800
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI8_SIZE
CYDEV_UCFG_DSI8_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI9_BASE
CYDEV_UCFG_DSI9_BASE EQU 0x40014900
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI9_SIZE
CYDEV_UCFG_DSI9_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI12_BASE
CYDEV_UCFG_DSI12_BASE EQU 0x40014c00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI12_SIZE
CYDEV_UCFG_DSI12_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI13_BASE
CYDEV_UCFG_DSI13_BASE EQU 0x40014d00
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_DSI13_SIZE
CYDEV_UCFG_DSI13_SIZE EQU 0x000000ef
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL0_BASE
CYDEV_UCFG_BCTL0_BASE EQU 0x40015000
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL0_SIZE
CYDEV_UCFG_BCTL0_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL0_MDCLK_EN
CYDEV_UCFG_BCTL0_MDCLK_EN EQU 0x40015000
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL0_MBCLK_EN
CYDEV_UCFG_BCTL0_MBCLK_EN EQU 0x40015001
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL0_WAIT_CFG
CYDEV_UCFG_BCTL0_WAIT_CFG EQU 0x40015002
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL0_BANK_CTL
CYDEV_UCFG_BCTL0_BANK_CTL EQU 0x40015003
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL0_DCLK_EN0
CYDEV_UCFG_BCTL0_DCLK_EN0 EQU 0x40015008
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL0_BCLK_EN0
CYDEV_UCFG_BCTL0_BCLK_EN0 EQU 0x40015009
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL0_DCLK_EN1
CYDEV_UCFG_BCTL0_DCLK_EN1 EQU 0x4001500a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL0_BCLK_EN1
CYDEV_UCFG_BCTL0_BCLK_EN1 EQU 0x4001500b
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL0_DCLK_EN2
CYDEV_UCFG_BCTL0_DCLK_EN2 EQU 0x4001500c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL0_BCLK_EN2
CYDEV_UCFG_BCTL0_BCLK_EN2 EQU 0x4001500d
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL0_DCLK_EN3
CYDEV_UCFG_BCTL0_DCLK_EN3 EQU 0x4001500e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL0_BCLK_EN3
CYDEV_UCFG_BCTL0_BCLK_EN3 EQU 0x4001500f
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL1_BASE
CYDEV_UCFG_BCTL1_BASE EQU 0x40015010
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL1_SIZE
CYDEV_UCFG_BCTL1_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL1_MDCLK_EN
CYDEV_UCFG_BCTL1_MDCLK_EN EQU 0x40015010
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL1_MBCLK_EN
CYDEV_UCFG_BCTL1_MBCLK_EN EQU 0x40015011
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL1_WAIT_CFG
CYDEV_UCFG_BCTL1_WAIT_CFG EQU 0x40015012
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL1_BANK_CTL
CYDEV_UCFG_BCTL1_BANK_CTL EQU 0x40015013
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL1_DCLK_EN0
CYDEV_UCFG_BCTL1_DCLK_EN0 EQU 0x40015018
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL1_BCLK_EN0
CYDEV_UCFG_BCTL1_BCLK_EN0 EQU 0x40015019
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL1_DCLK_EN1
CYDEV_UCFG_BCTL1_DCLK_EN1 EQU 0x4001501a
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL1_BCLK_EN1
CYDEV_UCFG_BCTL1_BCLK_EN1 EQU 0x4001501b
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL1_DCLK_EN2
CYDEV_UCFG_BCTL1_DCLK_EN2 EQU 0x4001501c
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL1_BCLK_EN2
CYDEV_UCFG_BCTL1_BCLK_EN2 EQU 0x4001501d
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL1_DCLK_EN3
CYDEV_UCFG_BCTL1_DCLK_EN3 EQU 0x4001501e
    ENDIF
    IF :LNOT::DEF:CYDEV_UCFG_BCTL1_BCLK_EN3
CYDEV_UCFG_BCTL1_BCLK_EN3 EQU 0x4001501f
    ENDIF
    IF :LNOT::DEF:CYDEV_IDMUX_BASE
CYDEV_IDMUX_BASE EQU 0x40015100
    ENDIF
    IF :LNOT::DEF:CYDEV_IDMUX_SIZE
CYDEV_IDMUX_SIZE EQU 0x00000016
    ENDIF
    IF :LNOT::DEF:CYDEV_IDMUX_IRQ_CTL0
CYDEV_IDMUX_IRQ_CTL0 EQU 0x40015100
    ENDIF
    IF :LNOT::DEF:CYDEV_IDMUX_IRQ_CTL1
CYDEV_IDMUX_IRQ_CTL1 EQU 0x40015101
    ENDIF
    IF :LNOT::DEF:CYDEV_IDMUX_IRQ_CTL2
CYDEV_IDMUX_IRQ_CTL2 EQU 0x40015102
    ENDIF
    IF :LNOT::DEF:CYDEV_IDMUX_IRQ_CTL3
CYDEV_IDMUX_IRQ_CTL3 EQU 0x40015103
    ENDIF
    IF :LNOT::DEF:CYDEV_IDMUX_IRQ_CTL4
CYDEV_IDMUX_IRQ_CTL4 EQU 0x40015104
    ENDIF
    IF :LNOT::DEF:CYDEV_IDMUX_IRQ_CTL5
CYDEV_IDMUX_IRQ_CTL5 EQU 0x40015105
    ENDIF
    IF :LNOT::DEF:CYDEV_IDMUX_IRQ_CTL6
CYDEV_IDMUX_IRQ_CTL6 EQU 0x40015106
    ENDIF
    IF :LNOT::DEF:CYDEV_IDMUX_IRQ_CTL7
CYDEV_IDMUX_IRQ_CTL7 EQU 0x40015107
    ENDIF
    IF :LNOT::DEF:CYDEV_IDMUX_DRQ_CTL0
CYDEV_IDMUX_DRQ_CTL0 EQU 0x40015110
    ENDIF
    IF :LNOT::DEF:CYDEV_IDMUX_DRQ_CTL1
CYDEV_IDMUX_DRQ_CTL1 EQU 0x40015111
    ENDIF
    IF :LNOT::DEF:CYDEV_IDMUX_DRQ_CTL2
CYDEV_IDMUX_DRQ_CTL2 EQU 0x40015112
    ENDIF
    IF :LNOT::DEF:CYDEV_IDMUX_DRQ_CTL3
CYDEV_IDMUX_DRQ_CTL3 EQU 0x40015113
    ENDIF
    IF :LNOT::DEF:CYDEV_IDMUX_DRQ_CTL4
CYDEV_IDMUX_DRQ_CTL4 EQU 0x40015114
    ENDIF
    IF :LNOT::DEF:CYDEV_IDMUX_DRQ_CTL5
CYDEV_IDMUX_DRQ_CTL5 EQU 0x40015115
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_BASE
CYDEV_P3BA_BASE EQU 0x40050300
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_SIZE
CYDEV_P3BA_SIZE EQU 0x0000002b
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_Y_START
CYDEV_P3BA_Y_START EQU 0x40050300
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_YROLL
CYDEV_P3BA_YROLL EQU 0x40050301
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_YCFG
CYDEV_P3BA_YCFG EQU 0x40050302
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_X_START1
CYDEV_P3BA_X_START1 EQU 0x40050303
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_X_START2
CYDEV_P3BA_X_START2 EQU 0x40050304
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_XROLL1
CYDEV_P3BA_XROLL1 EQU 0x40050305
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_XROLL2
CYDEV_P3BA_XROLL2 EQU 0x40050306
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_XINC
CYDEV_P3BA_XINC EQU 0x40050307
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_XCFG
CYDEV_P3BA_XCFG EQU 0x40050308
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_OFFSETADDR1
CYDEV_P3BA_OFFSETADDR1 EQU 0x40050309
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_OFFSETADDR2
CYDEV_P3BA_OFFSETADDR2 EQU 0x4005030a
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_OFFSETADDR3
CYDEV_P3BA_OFFSETADDR3 EQU 0x4005030b
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_ABSADDR1
CYDEV_P3BA_ABSADDR1 EQU 0x4005030c
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_ABSADDR2
CYDEV_P3BA_ABSADDR2 EQU 0x4005030d
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_ABSADDR3
CYDEV_P3BA_ABSADDR3 EQU 0x4005030e
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_ABSADDR4
CYDEV_P3BA_ABSADDR4 EQU 0x4005030f
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_DATCFG1
CYDEV_P3BA_DATCFG1 EQU 0x40050310
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_DATCFG2
CYDEV_P3BA_DATCFG2 EQU 0x40050311
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_CMP_RSLT1
CYDEV_P3BA_CMP_RSLT1 EQU 0x40050314
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_CMP_RSLT2
CYDEV_P3BA_CMP_RSLT2 EQU 0x40050315
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_CMP_RSLT3
CYDEV_P3BA_CMP_RSLT3 EQU 0x40050316
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_CMP_RSLT4
CYDEV_P3BA_CMP_RSLT4 EQU 0x40050317
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_DATA_REG1
CYDEV_P3BA_DATA_REG1 EQU 0x40050318
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_DATA_REG2
CYDEV_P3BA_DATA_REG2 EQU 0x40050319
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_DATA_REG3
CYDEV_P3BA_DATA_REG3 EQU 0x4005031a
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_DATA_REG4
CYDEV_P3BA_DATA_REG4 EQU 0x4005031b
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_EXP_DATA1
CYDEV_P3BA_EXP_DATA1 EQU 0x4005031c
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_EXP_DATA2
CYDEV_P3BA_EXP_DATA2 EQU 0x4005031d
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_EXP_DATA3
CYDEV_P3BA_EXP_DATA3 EQU 0x4005031e
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_EXP_DATA4
CYDEV_P3BA_EXP_DATA4 EQU 0x4005031f
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_MSTR_HRDATA1
CYDEV_P3BA_MSTR_HRDATA1 EQU 0x40050320
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_MSTR_HRDATA2
CYDEV_P3BA_MSTR_HRDATA2 EQU 0x40050321
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_MSTR_HRDATA3
CYDEV_P3BA_MSTR_HRDATA3 EQU 0x40050322
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_MSTR_HRDATA4
CYDEV_P3BA_MSTR_HRDATA4 EQU 0x40050323
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_BIST_EN
CYDEV_P3BA_BIST_EN EQU 0x40050324
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_PHUB_MASTER_SSR
CYDEV_P3BA_PHUB_MASTER_SSR EQU 0x40050325
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_SEQCFG1
CYDEV_P3BA_SEQCFG1 EQU 0x40050326
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_SEQCFG2
CYDEV_P3BA_SEQCFG2 EQU 0x40050327
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_Y_CURR
CYDEV_P3BA_Y_CURR EQU 0x40050328
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_X_CURR1
CYDEV_P3BA_X_CURR1 EQU 0x40050329
    ENDIF
    IF :LNOT::DEF:CYDEV_P3BA_X_CURR2
CYDEV_P3BA_X_CURR2 EQU 0x4005032a
    ENDIF
    IF :LNOT::DEF:CYDEV_PANTHER_BASE
CYDEV_PANTHER_BASE EQU 0x40080000
    ENDIF
    IF :LNOT::DEF:CYDEV_PANTHER_SIZE
CYDEV_PANTHER_SIZE EQU 0x00000018
    ENDIF
    IF :LNOT::DEF:CYDEV_PANTHER_STCALIB_CFG
CYDEV_PANTHER_STCALIB_CFG EQU 0x40080000
    ENDIF
    IF :LNOT::DEF:CYDEV_PANTHER_WAITPIPE
CYDEV_PANTHER_WAITPIPE EQU 0x40080004
    ENDIF
    IF :LNOT::DEF:CYDEV_PANTHER_TRACE_CFG
CYDEV_PANTHER_TRACE_CFG EQU 0x40080008
    ENDIF
    IF :LNOT::DEF:CYDEV_PANTHER_ETMFIFO
CYDEV_PANTHER_ETMFIFO EQU 0x4008000c
    ENDIF
    IF :LNOT::DEF:CYDEV_PANTHER_PVTCFG1
CYDEV_PANTHER_PVTCFG1 EQU 0x40080010
    ENDIF
    IF :LNOT::DEF:CYDEV_PANTHER_PVTCFG2
CYDEV_PANTHER_PVTCFG2 EQU 0x40080014
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSECC_BASE
CYDEV_FLSECC_BASE EQU 0x48000000
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSECC_SIZE
CYDEV_FLSECC_SIZE EQU 0x00008000
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSECC_DATA_MBASE
CYDEV_FLSECC_DATA_MBASE EQU 0x48000000
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSECC_DATA_MSIZE
CYDEV_FLSECC_DATA_MSIZE EQU 0x00008000
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_BASE
CYDEV_FLSHID_BASE EQU 0x49000000
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_SIZE
CYDEV_FLSHID_SIZE EQU 0x00001000
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_RSVD_MBASE
CYDEV_FLSHID_RSVD_MBASE EQU 0x49000000
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_RSVD_MSIZE
CYDEV_FLSHID_RSVD_MSIZE EQU 0x00000080
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_MDATA_MBASE
CYDEV_FLSHID_CUST_MDATA_MBASE EQU 0x49000080
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_MDATA_MSIZE
CYDEV_FLSHID_CUST_MDATA_MSIZE EQU 0x00000080
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_BASE
CYDEV_FLSHID_CUST_TABLES_BASE EQU 0x49000100
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_SIZE
CYDEV_FLSHID_CUST_TABLES_SIZE EQU 0x00000040
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_Y_LOC
CYDEV_FLSHID_CUST_TABLES_Y_LOC EQU 0x49000100
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_X_LOC
CYDEV_FLSHID_CUST_TABLES_X_LOC EQU 0x49000101
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_WAFER_NUM
CYDEV_FLSHID_CUST_TABLES_WAFER_NUM EQU 0x49000102
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_LOT_LSB
CYDEV_FLSHID_CUST_TABLES_LOT_LSB EQU 0x49000103
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_LOT_MSB
CYDEV_FLSHID_CUST_TABLES_LOT_MSB EQU 0x49000104
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_WRK_WK
CYDEV_FLSHID_CUST_TABLES_WRK_WK EQU 0x49000105
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_FAB_YR
CYDEV_FLSHID_CUST_TABLES_FAB_YR EQU 0x49000106
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_MINOR
CYDEV_FLSHID_CUST_TABLES_MINOR EQU 0x49000107
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_IMO_3MHZ
CYDEV_FLSHID_CUST_TABLES_IMO_3MHZ EQU 0x49000108
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_IMO_6MHZ
CYDEV_FLSHID_CUST_TABLES_IMO_6MHZ EQU 0x49000109
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_IMO_12MHZ
CYDEV_FLSHID_CUST_TABLES_IMO_12MHZ EQU 0x4900010a
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_IMO_24MHZ
CYDEV_FLSHID_CUST_TABLES_IMO_24MHZ EQU 0x4900010b
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_IMO_67MHZ
CYDEV_FLSHID_CUST_TABLES_IMO_67MHZ EQU 0x4900010c
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_IMO_80MHZ
CYDEV_FLSHID_CUST_TABLES_IMO_80MHZ EQU 0x4900010d
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_IMO_92MHZ
CYDEV_FLSHID_CUST_TABLES_IMO_92MHZ EQU 0x4900010e
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_IMO_USB
CYDEV_FLSHID_CUST_TABLES_IMO_USB EQU 0x4900010f
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_CMP0_TR0_HS
CYDEV_FLSHID_CUST_TABLES_CMP0_TR0_HS EQU 0x49000110
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_CMP1_TR0_HS
CYDEV_FLSHID_CUST_TABLES_CMP1_TR0_HS EQU 0x49000111
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_CMP2_TR0_HS
CYDEV_FLSHID_CUST_TABLES_CMP2_TR0_HS EQU 0x49000112
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_CMP3_TR0_HS
CYDEV_FLSHID_CUST_TABLES_CMP3_TR0_HS EQU 0x49000113
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DEC_1L
CYDEV_FLSHID_CUST_TABLES_DEC_1L EQU 0x49000114
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DEC_1H
CYDEV_FLSHID_CUST_TABLES_DEC_1H EQU 0x49000115
    ENDIF
