MaurinElectroTextile/Active_matrix/Proto_2_v_3_0.cywrk/Proto_2_v_2_1\Proto 2.cydsn\Generated_Source\PSoC5\cydevicerv.inc
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DEC_4L
CYDEV_FLSHID_CUST_TABLES_DEC_4L EQU 0x49000116
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DEC_4H
CYDEV_FLSHID_CUST_TABLES_DEC_4H EQU 0x49000117
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DEC_16L
CYDEV_FLSHID_CUST_TABLES_DEC_16L EQU 0x49000118
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DEC_16H
CYDEV_FLSHID_CUST_TABLES_DEC_16H EQU 0x49000119
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DEC_P25L
CYDEV_FLSHID_CUST_TABLES_DEC_P25L EQU 0x4900011a
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DEC_P25H
CYDEV_FLSHID_CUST_TABLES_DEC_P25H EQU 0x4900011b
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC0_M1
CYDEV_FLSHID_CUST_TABLES_DAC0_M1 EQU 0x4900011c
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC0_M2
CYDEV_FLSHID_CUST_TABLES_DAC0_M2 EQU 0x4900011d
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC0_M3
CYDEV_FLSHID_CUST_TABLES_DAC0_M3 EQU 0x4900011e
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC0_M4
CYDEV_FLSHID_CUST_TABLES_DAC0_M4 EQU 0x4900011f
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC0_M5
CYDEV_FLSHID_CUST_TABLES_DAC0_M5 EQU 0x49000120
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC0_M6
CYDEV_FLSHID_CUST_TABLES_DAC0_M6 EQU 0x49000121
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC0_M7
CYDEV_FLSHID_CUST_TABLES_DAC0_M7 EQU 0x49000122
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC0_M8
CYDEV_FLSHID_CUST_TABLES_DAC0_M8 EQU 0x49000123
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC2_M1
CYDEV_FLSHID_CUST_TABLES_DAC2_M1 EQU 0x49000124
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC2_M2
CYDEV_FLSHID_CUST_TABLES_DAC2_M2 EQU 0x49000125
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC2_M3
CYDEV_FLSHID_CUST_TABLES_DAC2_M3 EQU 0x49000126
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC2_M4
CYDEV_FLSHID_CUST_TABLES_DAC2_M4 EQU 0x49000127
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC2_M5
CYDEV_FLSHID_CUST_TABLES_DAC2_M5 EQU 0x49000128
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC2_M6
CYDEV_FLSHID_CUST_TABLES_DAC2_M6 EQU 0x49000129
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC2_M7
CYDEV_FLSHID_CUST_TABLES_DAC2_M7 EQU 0x4900012a
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC2_M8
CYDEV_FLSHID_CUST_TABLES_DAC2_M8 EQU 0x4900012b
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC1_M1
CYDEV_FLSHID_CUST_TABLES_DAC1_M1 EQU 0x4900012c
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC1_M2
CYDEV_FLSHID_CUST_TABLES_DAC1_M2 EQU 0x4900012d
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC1_M3
CYDEV_FLSHID_CUST_TABLES_DAC1_M3 EQU 0x4900012e
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC1_M4
CYDEV_FLSHID_CUST_TABLES_DAC1_M4 EQU 0x4900012f
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC1_M5
CYDEV_FLSHID_CUST_TABLES_DAC1_M5 EQU 0x49000130
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC1_M6
CYDEV_FLSHID_CUST_TABLES_DAC1_M6 EQU 0x49000131
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC1_M7
CYDEV_FLSHID_CUST_TABLES_DAC1_M7 EQU 0x49000132
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC1_M8
CYDEV_FLSHID_CUST_TABLES_DAC1_M8 EQU 0x49000133
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC3_M1
CYDEV_FLSHID_CUST_TABLES_DAC3_M1 EQU 0x49000134
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC3_M2
CYDEV_FLSHID_CUST_TABLES_DAC3_M2 EQU 0x49000135
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC3_M3
CYDEV_FLSHID_CUST_TABLES_DAC3_M3 EQU 0x49000136
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC3_M4
CYDEV_FLSHID_CUST_TABLES_DAC3_M4 EQU 0x49000137
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC3_M5
CYDEV_FLSHID_CUST_TABLES_DAC3_M5 EQU 0x49000138
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC3_M6
CYDEV_FLSHID_CUST_TABLES_DAC3_M6 EQU 0x49000139
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC3_M7
CYDEV_FLSHID_CUST_TABLES_DAC3_M7 EQU 0x4900013a
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_CUST_TABLES_DAC3_M8
CYDEV_FLSHID_CUST_TABLES_DAC3_M8 EQU 0x4900013b
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_MFG_CFG_BASE
CYDEV_FLSHID_MFG_CFG_BASE EQU 0x49000180
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_MFG_CFG_SIZE
CYDEV_FLSHID_MFG_CFG_SIZE EQU 0x00000080
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_MFG_CFG_DAC2_TR
CYDEV_FLSHID_MFG_CFG_DAC2_TR EQU 0x4900011f
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_MFG_CFG_IMO_TR1
CYDEV_FLSHID_MFG_CFG_IMO_TR1 EQU 0x49000182
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_MFG_CFG_CMP0_TR0
CYDEV_FLSHID_MFG_CFG_CMP0_TR0 EQU 0x490001a8
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_MFG_CFG_CMP1_TR0
CYDEV_FLSHID_MFG_CFG_CMP1_TR0 EQU 0x490001aa
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_MFG_CFG_CMP2_TR0
CYDEV_FLSHID_MFG_CFG_CMP2_TR0 EQU 0x490001ac
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_MFG_CFG_CMP3_TR0
CYDEV_FLSHID_MFG_CFG_CMP3_TR0 EQU 0x490001ae
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_MFG_CFG_DAC0_TR
CYDEV_FLSHID_MFG_CFG_DAC0_TR EQU 0x490001be
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_MFG_CFG_DAC1_TR
CYDEV_FLSHID_MFG_CFG_DAC1_TR EQU 0x490001c2
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_MFG_CFG_DAC3_TR
CYDEV_FLSHID_MFG_CFG_DAC3_TR EQU 0x490001c4
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_MFG_CFG_SAR0_TR0
CYDEV_FLSHID_MFG_CFG_SAR0_TR0 EQU 0x490001d0
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_MFG_CFG_SAR0_TR1
CYDEV_FLSHID_MFG_CFG_SAR0_TR1 EQU 0x490001d2
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_MFG_CFG_SAR1_TR0
CYDEV_FLSHID_MFG_CFG_SAR1_TR0 EQU 0x490001d4
    ENDIF
    IF :LNOT::DEF:CYDEV_FLSHID_MFG_CFG_SAR1_TR1
CYDEV_FLSHID_MFG_CFG_SAR1_TR1 EQU 0x490001d6
    ENDIF
    IF :LNOT::DEF:CYDEV_EXTMEM_BASE
CYDEV_EXTMEM_BASE EQU 0x60000000
    ENDIF
    IF :LNOT::DEF:CYDEV_EXTMEM_SIZE
CYDEV_EXTMEM_SIZE EQU 0x01000000
    ENDIF
    IF :LNOT::DEF:CYDEV_EXTMEM_DATA_MBASE
CYDEV_EXTMEM_DATA_MBASE EQU 0x60000000
    ENDIF
    IF :LNOT::DEF:CYDEV_EXTMEM_DATA_MSIZE
CYDEV_EXTMEM_DATA_MSIZE EQU 0x01000000
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_BASE
CYDEV_NVIC_BASE EQU 0xe000e000
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_SIZE
CYDEV_NVIC_SIZE EQU 0x00000d3c
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_SYSTICK_CTL
CYDEV_NVIC_SYSTICK_CTL EQU 0xe000e010
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_SYSTICK_RELOAD
CYDEV_NVIC_SYSTICK_RELOAD EQU 0xe000e014
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_SYSTICK_CURRENT
CYDEV_NVIC_SYSTICK_CURRENT EQU 0xe000e018
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_SYSTICK_CAL
CYDEV_NVIC_SYSTICK_CAL EQU 0xe000e01c
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_SETENA0
CYDEV_NVIC_SETENA0 EQU 0xe000e100
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_CLRENA0
CYDEV_NVIC_CLRENA0 EQU 0xe000e180
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_SETPEND0
CYDEV_NVIC_SETPEND0 EQU 0xe000e200
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_CLRPEND0
CYDEV_NVIC_CLRPEND0 EQU 0xe000e280
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_ACTIVE0
CYDEV_NVIC_ACTIVE0 EQU 0xe000e300
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_0
CYDEV_NVIC_PRI_0 EQU 0xe000e400
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_1
CYDEV_NVIC_PRI_1 EQU 0xe000e401
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_2
CYDEV_NVIC_PRI_2 EQU 0xe000e402
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_3
CYDEV_NVIC_PRI_3 EQU 0xe000e403
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_4
CYDEV_NVIC_PRI_4 EQU 0xe000e404
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_5
CYDEV_NVIC_PRI_5 EQU 0xe000e405
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_6
CYDEV_NVIC_PRI_6 EQU 0xe000e406
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_7
CYDEV_NVIC_PRI_7 EQU 0xe000e407
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_8
CYDEV_NVIC_PRI_8 EQU 0xe000e408
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_9
CYDEV_NVIC_PRI_9 EQU 0xe000e409
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_10
CYDEV_NVIC_PRI_10 EQU 0xe000e40a
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_11
CYDEV_NVIC_PRI_11 EQU 0xe000e40b
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_12
CYDEV_NVIC_PRI_12 EQU 0xe000e40c
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_13
CYDEV_NVIC_PRI_13 EQU 0xe000e40d
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_14
CYDEV_NVIC_PRI_14 EQU 0xe000e40e
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_15
CYDEV_NVIC_PRI_15 EQU 0xe000e40f
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_16
CYDEV_NVIC_PRI_16 EQU 0xe000e410
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_17
CYDEV_NVIC_PRI_17 EQU 0xe000e411
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_18
CYDEV_NVIC_PRI_18 EQU 0xe000e412
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_19
CYDEV_NVIC_PRI_19 EQU 0xe000e413
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_20
CYDEV_NVIC_PRI_20 EQU 0xe000e414
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_21
CYDEV_NVIC_PRI_21 EQU 0xe000e415
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_22
CYDEV_NVIC_PRI_22 EQU 0xe000e416
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_23
CYDEV_NVIC_PRI_23 EQU 0xe000e417
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_24
CYDEV_NVIC_PRI_24 EQU 0xe000e418
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_25
CYDEV_NVIC_PRI_25 EQU 0xe000e419
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_26
CYDEV_NVIC_PRI_26 EQU 0xe000e41a
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_27
CYDEV_NVIC_PRI_27 EQU 0xe000e41b
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_28
CYDEV_NVIC_PRI_28 EQU 0xe000e41c
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_29
CYDEV_NVIC_PRI_29 EQU 0xe000e41d
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_30
CYDEV_NVIC_PRI_30 EQU 0xe000e41e
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_PRI_31
CYDEV_NVIC_PRI_31 EQU 0xe000e41f
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_INTR_CTRL_STATE
CYDEV_NVIC_INTR_CTRL_STATE EQU 0xe000ed04
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_VECT_OFFSET
CYDEV_NVIC_VECT_OFFSET EQU 0xe000ed08
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_APPLN_INTR
CYDEV_NVIC_APPLN_INTR EQU 0xe000ed0c
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_SYSTEM_CONTROL
CYDEV_NVIC_SYSTEM_CONTROL EQU 0xe000ed10
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_CFG_CONTROL
CYDEV_NVIC_CFG_CONTROL EQU 0xe000ed14
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_SYS_PRIO_HANDLER_4_7
CYDEV_NVIC_SYS_PRIO_HANDLER_4_7 EQU 0xe000ed18
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_SYS_PRIO_HANDLER_8_11
CYDEV_NVIC_SYS_PRIO_HANDLER_8_11 EQU 0xe000ed1c
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_SYS_PRIO_HANDLER_12_15
CYDEV_NVIC_SYS_PRIO_HANDLER_12_15 EQU 0xe000ed20
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_SYS_HANDLER_CSR
CYDEV_NVIC_SYS_HANDLER_CSR EQU 0xe000ed24
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_MEMMAN_FAULT_STATUS
CYDEV_NVIC_MEMMAN_FAULT_STATUS EQU 0xe000ed28
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_BUS_FAULT_STATUS
CYDEV_NVIC_BUS_FAULT_STATUS EQU 0xe000ed29
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_USAGE_FAULT_STATUS
CYDEV_NVIC_USAGE_FAULT_STATUS EQU 0xe000ed2a
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_HARD_FAULT_STATUS
CYDEV_NVIC_HARD_FAULT_STATUS EQU 0xe000ed2c
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_DEBUG_FAULT_STATUS
CYDEV_NVIC_DEBUG_FAULT_STATUS EQU 0xe000ed30
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_MEMMAN_FAULT_ADD
CYDEV_NVIC_MEMMAN_FAULT_ADD EQU 0xe000ed34
    ENDIF
    IF :LNOT::DEF:CYDEV_NVIC_BUS_FAULT_ADD
CYDEV_NVIC_BUS_FAULT_ADD EQU 0xe000ed38
    ENDIF
    IF :LNOT::DEF:CYDEV_TPIU_BASE
CYDEV_TPIU_BASE EQU 0xe0040000
    ENDIF
    IF :LNOT::DEF:CYDEV_TPIU_SIZE
CYDEV_TPIU_SIZE EQU 0x000000f4
    ENDIF
    IF :LNOT::DEF:CYDEV_TPIU_PROTOCOL
CYDEV_TPIU_PROTOCOL EQU 0xe00400f0
    ENDIF
    IF :LNOT::DEF:CYDEV_FLS_SIZE
CYDEV_FLS_SIZE EQU CYDEV_FLASH_SIZE
    ENDIF
    IF :LNOT::DEF:CYDEV_ECC_BASE
CYDEV_ECC_BASE EQU CYDEV_FLSECC_BASE
    ENDIF
    IF :LNOT::DEF:CYDEV_FLS_SECTOR_SIZE
CYDEV_FLS_SECTOR_SIZE EQU 0x00010000
    ENDIF
    IF :LNOT::DEF:CYDEV_ECC_SECTOR_SIZE
CYDEV_ECC_SECTOR_SIZE EQU 0x00002000
    ENDIF
    IF :LNOT::DEF:CYDEV_FLS_ROW_SIZE
CYDEV_FLS_ROW_SIZE EQU 0x00000100
    ENDIF
    IF :LNOT::DEF:CYDEV_ECC_ROW_SIZE
CYDEV_ECC_ROW_SIZE EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYDEV_EEPROM_ROW_SIZE
CYDEV_EEPROM_ROW_SIZE EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYDEV_PERIPH_BASE
CYDEV_PERIPH_BASE EQU CYDEV_CLKDIST_BASE
    ENDIF
    IF :LNOT::DEF:CYCLK_LD_DISABLE
CYCLK_LD_DISABLE EQU 0x00000004
    ENDIF
    IF :LNOT::DEF:CYCLK_LD_SYNC_EN
CYCLK_LD_SYNC_EN EQU 0x00000002
    ENDIF
    IF :LNOT::DEF:CYCLK_LD_LOAD
CYCLK_LD_LOAD EQU 0x00000001
    ENDIF
    IF :LNOT::DEF:CYCLK_PIPE
CYCLK_PIPE EQU 0x00000080
    ENDIF
    IF :LNOT::DEF:CYCLK_SSS
CYCLK_SSS EQU 0x00000040
    ENDIF
    IF :LNOT::DEF:CYCLK_EARLY
CYCLK_EARLY EQU 0x00000020
    ENDIF
    IF :LNOT::DEF:CYCLK_DUTY
CYCLK_DUTY EQU 0x00000010
    ENDIF
    IF :LNOT::DEF:CYCLK_SYNC
CYCLK_SYNC EQU 0x00000008
    ENDIF
    IF :LNOT::DEF:CYCLK_SRC_SEL_CLK_SYNC_D
CYCLK_SRC_SEL_CLK_SYNC_D EQU 0
    ENDIF
    IF :LNOT::DEF:CYCLK_SRC_SEL_SYNC_DIG
CYCLK_SRC_SEL_SYNC_DIG EQU 0
    ENDIF
    IF :LNOT::DEF:CYCLK_SRC_SEL_IMO
CYCLK_SRC_SEL_IMO EQU 1
    ENDIF
    IF :LNOT::DEF:CYCLK_SRC_SEL_XTAL_MHZ
CYCLK_SRC_SEL_XTAL_MHZ EQU 2
    ENDIF
    IF :LNOT::DEF:CYCLK_SRC_SEL_XTALM
CYCLK_SRC_SEL_XTALM EQU 2
    ENDIF
    IF :LNOT::DEF:CYCLK_SRC_SEL_ILO
CYCLK_SRC_SEL_ILO EQU 3
    ENDIF
    IF :LNOT::DEF:CYCLK_SRC_SEL_PLL
CYCLK_SRC_SEL_PLL EQU 4
    ENDIF
    IF :LNOT::DEF:CYCLK_SRC_SEL_XTAL_KHZ
CYCLK_SRC_SEL_XTAL_KHZ EQU 5
    ENDIF
    IF :LNOT::DEF:CYCLK_SRC_SEL_XTALK
CYCLK_SRC_SEL_XTALK EQU 5
    ENDIF
    IF :LNOT::DEF:CYCLK_SRC_SEL_DSI_G
CYCLK_SRC_SEL_DSI_G EQU 6
    ENDIF
    IF :LNOT::DEF:CYCLK_SRC_SEL_DSI_D
CYCLK_SRC_SEL_DSI_D EQU 7
    ENDIF
    IF :LNOT::DEF:CYCLK_SRC_SEL_CLK_SYNC_A
CYCLK_SRC_SEL_CLK_SYNC_A EQU 0
    ENDIF
    IF :LNOT::DEF:CYCLK_SRC_SEL_DSI_A
CYCLK_SRC_SEL_DSI_A EQU 7
    ENDIF
    END
